{"api_op":0,"md":1,"sections":2,"op":3,"api":4,"op_module":5,"op_grads_module":6,"deepmd":7,"tf":8,"env":9,"ase":10,"use":11,"deep":12,"potential":13,"see":14,"environment":15,"variables":16,"runtime":17,"can":18,"set":19,"up":20,"calculator":21,"obtain":22,"energies":23,"forces":24,"python":25,"from":26,"import":27,"atoms":28,"dp":29,"water":30,"h2o":31,"positions":32,"7601":33,"9270":34,"9575":35,"cell":36,"100":37,"model":38,"frozen_model":39,"pb":40,"print":41,"get_potential_energy":42,"get_forces":43,"pth":44,"json":45,"optimization":46,"also":47,"available":48,"optimize":49,"bfgs":50,"dyn":51,"run":52,"fmax":53,"1e":54,"get_positions":55,"backend":56,"supported":57,"backends":58,"tensorflow":59,"pytorch":60,"jax":61,"paddle":62,"paddlepaddle":63,"kit":64,"supports":65,"multiple":66,"you":67,"must":68,"install":69,"least":70,"one":71,"each":72,"does":73,"support":74,"all":75,"features":76,"documentation":77,"icons":78,"used":79,"mark":80,"whether":81,"feature":82,"filename":83,"extension":84,"checkpoint":85,"meta":86,"index":87,"data":88,"00000":89,"00001":90,"https":91,"org":92,"first":93,"version":94,"10":95,"v2":96,"uses":97,"v1":98,"compat":99,"graph":100,"mode":101,"pt":102,"above":103,"required":104,"while":105,"same":106,"package":107,"have":108,"different":109,"meanings":110,"distinguish":111,"xlo":112,"savedmodel":113,"readthedocs":114,"io":115,"33":116,"both":117,"customized":118,"format":119,"extensions":120,"defined":121,"since":122,"has":123,"convention":124,"file":125,"www":126,"guide":127,"saved_model":128,"generated":129,"jax2tf":130,"which":131,"needs":132,"installation":133,"only":134,"inference":135,"interface":136,"device":137,"specific":138,"so":139,"gpu":140,"cannot":141,"cpus":142,"currently":143,"developed":144,"actively":145,"training":146,"pdiparams":147,"pd":148,"cn":149,"storage":150,"commonly":151,"utilized":152,"during":153,"testing":154,"computational":155,"pir":156,"representation":157,"docs":158,"zh":159,"develop":160,"guides":161,"paddle_v3_features":162,"paddle_ir_cn":163,"html":164,"stores":165,"parameters":166,"files":167,"exported":168,"together":169,"freezing":170,"switch":171,"convert":172,"between":173,"development":174,"should":175,"take":176,"production":177,"yaml":178,"yml":179,"reference":180,"pure":181,"numpy":182,"implement":183,"models":184,"without":185,"using":186,"any":187,"heavy":188,"learning":189,"frameworks":190,"due":191,"limitation":192,"doesn":193,"gradient":194,"calculation":195,"thus":196,"aimed":197,"best":198,"performance":199,"correct":200,"results":201,"two":202,"formats":203,"independent":204,"hdf5":205,"h5py":206,"store":207,"serialization":208,"good":209,"save":210,"plain":211,"texts":212,"easy":213,"read":214,"human":215,"beings":216,"load":217,"21":218,"when":219,"command":220,"line":221,"doing":222,"detects":223,"example":224,"ends":225,"protobuf":226,"consider":227,"cli":228,"rst":229,"build":230,"conda":231,"building":232,"packages":233,"official":234,"channel":235,"been":236,"deprecated":237,"refer":238,"forge":239,"maintainer":240,"adding_pkgs":241,"how":242,"contribute":243,"locally":244,"change":245,"bias":246,"output":247,"trained":248,"typically":249,"originates":250,"statistical":251,"dataset":252,"several":253,"scenarios":254,"where":255,"might":256,"want":257,"adjust":258,"after":259,"zero":260,"shot":261,"similar":262,"procedure":263,"before":264,"step":265,"fine":266,"tuning":267,"manually":268,"setting":269,"following":270,"methods":271,"adjusting":272,"changing":273,"provided":274,"systems":275,"sh":276,"ckpt":277,"data_dir":278,"model_updated":279,"user":280,"input":281,"energy":282,"92":283,"523":284,"187":285,"66":286,"multitask":287,"branch":288,"specified":289,"multi_model":290,"model_1":291,"cicd":292,"ci":293,"cd":294,"test":295,"cuda":296,"todo":297,"written":298,"action":299,"runs":300,"tests":301,"self":302,"hosted":303,"runner":304,"nvidia":305,"card":306,"triggered":307,"every":308,"pr":309,"developer":310,"who":311,"permission":312,"manage":313,"label":314,"apply":315,"trigger":316,"github":317,"actions":318,"pre":319,"compiled":320,"commit":321,"latest":322,"dev":323,"section":324,"learn":325,"cmake":326,"find":327,"library":328,"installed":329,"find_package":330,"note":331,"may":332,"need":333,"add":334,"deepmd_root":335,"cached":336,"variable":337,"cmake_prefix_path":338,"link":339,"against":340,"target_link_libraries":341,"some_library":342,"private":343,"deepmd_c":344,"deepmd_cc":345,"coding":346,"conventions":347,"preface":348,"rules":349,"aim":350,"standards":351,"help":352,"create":353,"codebase":354,"consistent":355,"style":356,"contributor":357,"get":358,"easily":359,"familiar":360,"enhance":361,"code":362,"readability":363,"styles":364,"contributors":365,"everything":366,"documented":367,"diffs":368,"smaller":369,"because":370,"unified":371,"finally":372,"static":373,"typing":374,"hunting":375,"down":376,"bugs":377,"even":378,"contributed":379,"refused":380,"merely":381,"strictly":382,"adhere":383,"conditions":384,"long":385,"internally":386,"clean":387,"probably":388,"accepted":389,"don":390,"surprised":391,"offending":392,"gets":393,"fiddled":394,"overtime":395,"conform":396,"checks":397,"automatically":398,"fix":399,"compatible":400,"oldest":401,"project":402,"follows":403,"generic":404,"peps":405,"pep":406,"0008":407,"docstring":408,"0257":409,"0484":410,"clarified":411,"extended":412,"do":413,"imports":414,"module":415,"instead":416,"list":417,"explicitly":418,"spaces":419,"per":420,"indentation":421,"level":422,"tabs":423,"liner":424,"compound":425,"statements":426,"return":427,"lines":428,"maximum":429,"length":430,"88":431,"characters":432,"recommended":433,"black":434,"com":435,"psf":436,"less":437,"strict":438,"than":439,"suggests":440,"studlycaps":441,"class":442,"names":443,"lowercase":444,"lowercase_with_underscores":445,"function":446,"method":447,"short":448,"joined":449,"tagname":450,"choose":451,"what":452,"most":453,"readable":454,"single":455,"character":456,"except":457,"indices":458,"loops":459,"encompass":460,"very":461,"small":462,"number":463,"range":464,"avoid":465,"lambda":466,"expressions":467,"named":468,"functions":469,"functional":470,"constructs":471,"filter":472,"map":473,"etc":474,"comprehensions":475,"double":476,"quotes":477,"string":478,"literals":479,"triple":480,"ok":481,"something":482,"like":483,"else":484,"strings":485,"2f":486,"old":487,"formatting":488,"sparsely":489,"more":490,"convenient":491,"whitespace":492,"general":493,"advice":494,"writing":495,"scripts":496,"check":497,"sparingly":498,"maintain":499,"pep8":500,"trailing":501,"whitespaces":502,"http":503,"gnu":504,"software":505,"emacs":506,"manual":507,"html_node":508,"useless":509,"excessive":510,"your":511,"blank":512,"commas":513,"colons":514,"semi":515,"isn":516,"next":517,"end":518,"bracket":519,"brace":520,"parentheses":521,"operators":522,"space":523,"sides":524,"operator":525,"slicing":526,"considered":527,"binary":528,"them":529,"directly":530,"calling":531,"indexing":532,"brackets":533,"collection":534,"values":535,"make":536,"sure":537,"optional":538,"choices":539,"rid":540,"many":541,"break":542,"continue":543,"possible":544,"write":545,"fit":546,"within":547,"standard":548,"screen":549,"descriptive":550,"here":551,"docstrings":552,"blob":553,"master":554,"doc":555,"py":556,"found":557,"numpydoc":558,"en":559,"clang":560,"root":561,"repository":562,"based":563,"google":564,"some":565,"modifications":566,"idea":567,"prek":568,"j178":569,"bash":570,"uv":571,"tool":572,"issues":573,"compress":574,"theory":575,"compression":576,"three":577,"techniques":578,"tabulated":579,"merging":580,"precise":581,"neighbor":582,"improve":583,"properly":584,"better":585,"nn":586,"replaced":587,"evaluations":588,"dimension":589,"approximate":590,"piece":591,"wise":592,"polynomial":593,"fitting":594,"domain":595,"compact":596,"mathbb":597,"divided":598,"l_c":599,"equally":600,"spaced":601,"intervals":602,"we":603,"fifth":604,"order":605,"l_m":606,"approximation":607,"th":608,"component":609,"math":610,"quad":611,"x_l":612,"x_":613,"dots":614,"x_1":615,"endpoints":616,"computed":617,"equations":618,"below":619,"frac":620,"delta":621,"12h_":622,"30h_":623,"14y":624,"16y":625,"2y":626,"3y":627,"20h_":628,"8y":629,"12y":630,"y_":631,"denotes":632,"size":633,"interval":634,"h_":635,"y_m":636,"_m":637,"value":638,"derivative":639,"second":640,"target":641,"point":642,"respectively":643,"derivatives":644,"calculated":645,"back":646,"propagation":647,"taking":648,"body":649,"embedding":650,"descriptor":651,"train":652,"se":653,"e2":654,"matrix":655,"product":656,"mathcal":657,"requires":658,"transfer":659,"tensor":660,"register":661,"host":662,"memories":663,"usually":664,"becomes":665,"bottle":666,"neck":667,"computation":668,"relatively":669,"memory":670,"bandwidth":671,"gpus":672,"compressed":673,"merges":674,"multiplication":675,"specifically":676,"once":677,"column":678,"evaluated":679,"immediately":680,"multiplied":681,"row":682,"outer":683,"deposited":684,"result":685,"technique":686,"allocation":687,"movement":688,"avoided":689,"derived":690,"analogously":691,"n_c":692,"matrices":693,"expected":694,"neighbors":695,"atom":696,"corresponding":697,"pad":698,"zeros":699,"practice":700,"real":701,"significantly":702,"notable":703,"operation":704,"spent":705,"padding":706,"precisely":707,"indexed":708,"stage":709,"further":710,"saving":711,"costs":712,"instructions":713,"frozen":714,"obtained":715,"neural":716,"network":717,"structure":718,"its":719,"weights":720,"biases":721,"way":722,"gives":723,"original":724,"other":725,"options":726,"passed":727,"checked":728,"explanation":729,"program":730,"parameter":731,"includes":732,"tabulating":733,"net":734,"table":735,"composed":736,"coefficients":737,"assembled":738,"sub":739,"tables":740,"se_e2_a":741,"type":742,"takes":743,"stride":744,"uniform":745,"se_e3":746,"detected":747,"ranges":748,"upper":749,"boundary":750,"extrapolate":751,"added":752,"frequency":753,"indicates":754,"often":755,"overflow":756,"overflows":757,"justification":758,"little":759,"loss":760,"accuracy":761,"greatly":762,"speed":763,"time":764,"according":765,"simulation":766,"speedup":767,"reach":768,"times":769,"cpu":770,"devices":771,"usage":772,"reducing":773,"much":774,"20":775,"under":776,"hardware":777,"acceptable":778,"generation":779,"alpha":780,"upgrade":781,"through":782,"eg":783,"old_frozen_model":784,"new_frozen_model":785,"activation":786,"tanh":787,"gelu":788,"relu":789,"relu6":790,"softplus":791,"sigmoid":792,"requirements":793,"compressing":794,"freeze":795,"envvar":796,"dp_enable_pytorch":797,"source":798,"built":799,"upon":800,"jinzhe":801,"zeng":802,"duo":803,"zhang":804,"denghui":805,"lu":806,"pinghui":807,"mo":808,"zeyu":809,"li":810,"yixiao":811,"chen":812,"marián":813,"rynik":814,"ang":815,"huang":816,"ziyao":817,"shaochen":818,"shi":819,"yingze":820,"wang":821,"haotian":822,"ye":823,"ping":824,"tuo":825,"jiabin":826,"yang":827,"ding":828,"yifan":829,"davide":830,"tisi":831,"qiyu":832,"han":833,"bao":834,"yu":835,"xia":836,"jiameng":837,"koki":838,"muraoka":839,"yibo":840,"junhan":841,"chang":842,"fengbo":843,"yuan":844,"sigbjørn":845,"løland":846,"bore":847,"chun":848,"cai":849,"yinnian":850,"lin":851,"bo":852,"jiayan":853,"xu":854,"jia":855,"xin":856,"zhu":857,"chenxing":858,"luo":859,"yuzhi":860,"rhys":861,"goodall":862,"wenshuo":863,"liang":864,"anurag":865,"kumar":866,"singh":867,"sikai":868,"yao":869,"jingchao":870,"renata":871,"wentzcovitch":872,"jiequn":873,"jie":874,"liu":875,"weile":876,"darrin":877,"york":878,"weinan":879,"roberto":880,"car":881,"linfeng":882,"chem":883,"phys":884,"159":885,"054801":886,"2023":887,"doi":888,"1063":889,"0155600":890,"licensed":891,"creative":892,"commons":893,"attribution":894,"cc":895,"license":896,"creativecommons":897,"licenses":898,"design":899,"new":900,"descriptors":901,"context":902,"applies":903,"listed":904,"covered":905,"existing":906,"reuse":907,"efficient":908,"modules":909,"processing":910,"trainer":911,"incorporate":912,"custom":913,"ll":914,"components":915,"arguments":916,"inputs":917,"codes":918,"v3":919,"expanded":920,"include":921,"additional":922,"alongside":923,"framework":924,"dpmodel":925,"adopts":926,"highly":927,"modularized":928,"provide":929,"flexibility":930,"extensibility":931,"ensures":932,"experience":933,"aligning":934,"implemented":935,"serving":936,"ensure":937,"consistency":938,"pattern":939,"closely":940,"parallels":941,"creating":942,"essential":943,"inherit":944,"base_descriptor":945,"basedescriptor":946,"torch":947,"abstract":948,"including":949,"forward":950,"others":951,"remain":952,"crucial":953,"implementation":954,"complete":955,"involves":956,"registering":957,"designated":958,"key":959,"utils":960,"data_system":961,"deepmddatasystem":962,"some_descrpt":963,"somedescript":964,"def":965,"__init__":966,"arg1":967,"bool":968,"arg2":969,"float":970,"none":971,"pass":972,"get_rcut":973,"get_nnei":974,"int":975,"get_ntypes":976,"get_dim_out":977,"get_dim_emb":978,"mixed_types":979,"coord_ext":980,"atype_ext":981,"nlist":982,"mapping":983,"serialize":984,"dict":985,"deserialize":986,"cls":987,"update_sel":988,"train_data":989,"type_map":990,"str":991,"local_jdata":992,"important":993,"cross":994,"conversion":995,"nets":996,"floating":997,"precision":998,"instances":999,"requirement":1000,"scalar":1001,"properties":1002,"task":1003,"ener":1004,"invarfitting":1005,"however":1006,"base_fitting":1007,"basefitting":1008,"alternatively":1009,"straightforward":1010,"approach":1011,"inheritance":1012,"generalfitting":1013,"option":1014,"fittingoutputdef":1015,"fitting_check_output":1016,"some_fitting":1017,"somefittingnet":1018,"atype":1019,"gr":1020,"g2":1021,"h2":1022,"fparam":1023,"aparam":1024,"output_def":1025,"architecture":1026,"meticulously":1027,"structured":1028,"layers":1029,"abstraction":1030,"ensuring":1031,"high":1032,"degree":1033,"process":1034,"commences":1035,"atomic":1036,"responsible":1037,"property":1038,"calculations":1039,"inherits":1040,"atomic_model":1041,"base_atomic_model":1042,"baseatomicmodel":1043,"subsequently":1044,"atomicmodel":1045,"encapsulated":1046,"make_model":1047,"leverages":1048,"purpose":1049,"wrapper":1050,"facilitate":1051,"translation":1052,"predictions":1053,"differentiation":1054,"reduction":1055,"contribution":1056,"autodiff":1057,"calculating":1058,"virial":1059,"developers":1060,"someatomicmodel":1061,"forward_atomic":1062,"obey":1063,"those":1064,"normalization":1065,"global_pt_float_precision":1066,"cast":1067,"ops":1068,"unit":1069,"universal":1070,"let":1071,"someone":1072,"returns":1073,"argument":1074,"dargs":1075,"argcheck":1076,"descrpt_args_plugin":1077,"descrpt_some_args":1078,"false":1079,"balabala":1080,"true":1081,"default":1082,"haha":1083,"allows":1084,"main":1085,"gnn":1086,"gitlab":1087,"rutgerslbsr":1088,"entry":1089,"points":1090,"pyproject":1091,"toml":1092,"deepmd_some_descrtpt":1093,"equivalent":1094,"place":1095,"entry_points":1096,"now":1097,"follow":1098,"tutorials":1099,"advanced":1100,"torch_script_custom_ops":1101,"meth":1102,"load_library":1103,"define":1104,"dp_plugin_path":1105,"directory":1106,"provides":1107,"suites":1108,"subdirectory":1109,"cases":1110,"defines":1111,"fixtures":1112,"networks":1113,"suite":1114,"apis":1115,"serialized":1116,"give":1117,"specially":1118,"permutation":1119,"rotation":1120,"invariant":1121,"differentiable":1122,"smooth":1123,"near":1124,"cutoff":1125,"radius":1126,"force":1127,"negative":1128,"adding":1129,"fixture":1130,"subdiretory":1131,"implementing":1132,"transferring":1133,"another":1134,"regression":1135,"validate":1136,"presently":1137,"cover":1138,"deserialization":1139,"necessary":1140,"jit":1141,"override":1142,"keep":1143,"unchanged":1144,"create_op":1145,"load_op_library":1146,"credits":1147,"authors":1148,"cite":1149,"local":1150,"frame":1151,"loc_frame":1152,"title":1153,"ref":1154,"deeppot":1155,"se_e2_r":1156,"se_atten":1157,"attention":1158,"se_atten_v2":1159,"dpa":1160,"dpa2":1161,"electronic":1162,"temperature":1163,"dipole":1164,"polarizability":1165,"density":1166,"states":1167,"relative":1168,"dplr":1169,"hybrid":1170,"dprc":1171,"interpolation":1172,"pair":1173,"deviation":1174,"nvnmd":1175,"band":1176,"gap":1177,"multi":1178,"zixuan":1179,"designing":1180,"deepmodeling":1181,"logo":1182,"everyone":1183,"mailing":1184,"contributing":1185,"discussions":1186,"decisions":1187,"cxx":1188,"faster":1189,"infer_water":1190,"cpp":1191,"given":1192,"std":1193,"vector":1194,"coord":1195,"compute":1196,"predicted":1197,"system":1198,"details":1199,"compile":1200,"gcc":1201,"lib":1202,"tensorflow_root":1203,"wl":1204,"needed":1205,"ldeepmd_cc":1206,"lstdc":1207,"ltensorflow_cc":1208,"rpath":1209,"although":1210,"harder":1211,"affected":1212,"versions":1213,"compilers":1214,"stdio":1215,"stdlib":1216,"c_api":1217,"const":1218,"char":1219,"init":1220,"pointers":1221,"malloc":1222,"sizeof":1223,"natoms":1224,"ae":1225,"av":1226,"27":1227,"dp_deeppot":1228,"dp_newdeeppot":1229,"dp_deeppotcompute":1230,"printf":1231,"ii":1232,"free":1233,"dp_deletedeeppot":1234,"virials":1235,"func":1236,"ldeepmd_c":1237,"header":1238,"abi":1239,"compatibility":1240,"powerful":1241,"hpp":1242,"still":1243,"limited":1244,"compared":1245,"infer_water_hpp":1246,"native":1247,"revised":1248,"nlist_vec":1249,"ilist":1250,"numneigh":1251,"firstneigh":1252,"inputnlist":1253,"convert_nlist":1254,"means":1255,"conv":1256,"raw":1257,"stored":1258,"text":1259,"ending":1260,"non":1261,"periodic":1262,"empty":1263,"nopbc":1264,"put":1265,"labeled":1266,"saved":1267,"npy":1268,"stable":1269,"directories":1270,"contain":1271,"000":1272,"001":1273,"assume":1274,"types":1275,"frames":1276,"integers":1277,"cat":1278,"sometimes":1279,"integer":1280,"atten":1281,"sparse":1282,"organized":1283,"group":1284,"name":1285,"path":1286,"divide":1287,"paths":1288,"start":1289,"large":1290,"cluster":1291,"information":1292,"item":1293,"box":1294,"coordinate":1295,"724":1296,"039":1297,"951":1298,"841":1299,"464":1300,"363":1301,"737":1302,"554":1303,"587":1304,"803":1305,"062":1306,"222":1307,"968":1308,"163":1309,"020":1310,"225":1311,"789":1312,"343":1313,"contains":1314,"having":1315,"columns":1316,"numbers":1317,"similarly":1318,"identical":1319,"script":1320,"deepmd_source_dir":1321,"raw_to_set":1322,"prepared":1323,"6000":1324,"ls":1325,"2000":1326,"nframe":1327,"nline":1328,"sets":1329,"making":1330,"002":1331,"generates":1332,"containing":1333,"pipeline":1334,"message":1335,"passing":1336,"intuition":1337,"physical":1338,"paper":1339,"1038":1340,"s41524":1341,"024":1342,"01493":1343,"examples":1344,"input_torch_medium":1345,"readme":1346,"levels":1347,"proposed":1348,"lams":1349,"builds":1350,"representations":1351,"coupled":1352,"channels":1353,"notation":1354,"mathbf":1355,"rotationally":1356,"beta":1357,"equivariant":1358,"cutoffs":1359,"stages":1360,"repinit":1361,"initializer":1362,"initializes":1363,"fuses":1364,"geometry":1365,"environments":1366,"repformer":1367,"transformer":1368,"stacked":1369,"update":1370,"convolution":1371,"symmetrization":1372,"mlp":1373,"interactions":1374,"final":1375,"formed":1376,"learned":1377,"downstream":1378,"updates":1379,"layer":1380,"residual":1381,"connections":1382,"conceptually":1383,"performs":1384,"neighborhood":1385,"aggregation":1386,"conditioned":1387,"mathrm":1388,"mp":1389,"left":1390,"right":1391,"goals":1392,"family":1393,"satisfy":1394,"translational":1395,"invariance":1396,"depends":1397,"coordinates":1398,"rotational":1399,"permutational":1400,"symmetry":1401,"conservative":1402,"formulation":1403,"gradients":1404,"smoothness":1405,"designed":1406,"shared":1407,"heads":1408,"workflow":1409,"limitations":1410,"lammps":1411,"wants":1412,"mpi":1413,"aware":1414,"solutions":1415,"otherwise":1416,"communication":1417,"cards":1418,"falls":1419,"slower":1420,"ranks":1421,"yes":1422,"atom_modify":1423,"lmp":1424,"jax_dpa":1425,"mixed":1426,"tebd_dim":1427,"tebd_input_mode":1428,"strip":1429,"attn_layer":1430,"geometric":1431,"parts":1432,"inside":1433,"input_torch_compressible":1434,"improvement":1435,"expensive":1436,"dpa3":1437,"series":1438,"ligs":1439,"interatomic":1440,"lam":1441,"integrate":1442,"jointly":1443,"datasets":1444,"domains":1445,"covering":1446,"diverse":1447,"chemical":1448,"materials":1449,"robust":1450,"generalization":1451,"beyond":1452,"preserves":1453,"conservation":1454,"symmetries":1455,"surface":1456,"reliable":1457,"wide":1458,"scientific":1459,"applications":1460,"arxiv":1461,"abs":1462,"2506":1463,"01686":1464,"input_torch":1465,"operating":1466,"constructed":1467,"configurations":1468,"initial":1469,"representing":1470,"vertices":1471,"pairs":1472,"neighboring":1473,"r_c":1474,"edges":1475,"transform":1476,"converting":1477,"edge":1478,"vertex":1479,"whose":1480,"share":1481,"common":1482,"recursively":1483,"applying":1484,"graphs":1485,"ldots":1486,"sequence":1487,"called":1488,"geometrically":1489,"correspond":1490,"bonds":1491,"angles":1492,"sharing":1493,"dihedral":1494,"four":1495,"bond":1496,"across":1497,"denoted":1498,"d_v":1499,"d_e":1500,"denote":1501,"dimensions":1502,"repflowargs":1503,"n_":1504,"dim":1505,"e_":1506,"a_":1507,"recursive":1508,"_v":1509,"_e":1510,"updated":1511,"messages":1512,"connected":1513,"identity":1514,"eliminates":1515,"redundant":1516,"rule":1517,"therefore":1518,"evolve":1519,"via":1520,"drive":1521,"construction":1522,"configuration":1523,"serve":1524,"total":1525,"consumed":1526,"prediction":1527,"objectives":1528,"respects":1529,"absolute":1530,"intermediate":1531,"contracted":1532,"produce":1533,"species":1534,"treated":1535,"identically":1536,"operations":1537,"re":1538,"labeling":1539,"addition":1540,"inherently":1541,"partial":1542,"suitable":1543,"molecular":1544,"dynamics":1545,"simulations":1546,"effective":1547,"prior":1548,"work":1549,"scaling":1550,"increasing":1551,"l3":1552,"l6":1553,"l12":1554,"l24":1555,"hyperparameter":1556,"systematically":1557,"six":1558,"representative":1559,"dft":1560,"ais":1561,"square":1562,"aissquare":1563,"detail":1564,"pagetype":1565,"dpa3_hyperparameter_search":1566,"id":1567,"316":1568,"metallic":1569,"alloy":1570,"almgcu":1571,"covalent":1572,"material":1573,"boron":1574,"drug":1575,"liquid":1576,"5m":1577,"steps":1578,"batch_size":1579,"auto":1580,"128":1581,"impact":1582,"hyperparameters":1583,"validation":1584,"comparative":1585,"analysis":1586,"focused":1587,"average":1588,"rmses":1589,"mean":1590,"error":1591,"summarized":1592,"scenario":1593,"selection":1594,"comment":1595,"nlayers":1596,"n_dim":1597,"e_dim":1598,"a_dim":1599,"e_sel":1600,"a_sel":1601,"start_lr":1602,"stop_lr":1603,"prefactors":1604,"rmse_e":1605,"mev":1606,"rmse_f":1607,"rmse_v":1608,"wall":1609,"256":1610,"32":1611,"120":1612,"30":1613,"3e":1614,"60":1615,"02":1616,"74":1617,"85":1618,"43":1619,"64":1620,"99":1621,"93":1622,"46":1623,"sel":1624,"154":1625,"48":1626,"70":1627,"83":1628,"14":1629,"79":1630,"39":1631,"19":1632,"11":1633,"77":1634,"41":1635,"76":1636,"78":1637,"40":1638,"31":1639,"medium":1640,"51e":1641,"08":1642,"1000":1643,"12":1644,"109":1645,"start_pref_e":1646,"limit_pref_e":1647,"start_pref_f":1648,"limit_pref_f":1649,"start_pref_v":1650,"limit_pref_v":1651,"were":1652,"averaged":1653,"exclusively":1654,"labels":1655,"float32":1656,"float64":1657,"users":1658,"skip":1659,"integration":1660,"linked":1661,"setup":1662,"node":1663,"repflow":1664,"dpdata":1665,"prepare":1666,"principle":1667,"execute":1668,"pip":1669,"vasp":1670,"outcar":1671,"data_conv":1672,"dsys":1673,"labeledsystem":1674,"deepmd_data":1675,"set_size":1676,"get_nframes":1677,"enforces":1678,"equal":1679,"viz":1680,"created":1681,"folder":1682,"nice":1683,"website":1684,"notice":1685,"interfaces":1686,"subject":1687,"described":1688,"introduce":1689,"adds":1690,"electrostatic":1691,"ele":1692,"fitted":1693,"ast":1694,"introduced":1695,"gaussian":1696,"distributions":1697,"fourier":1698,"pi":1699,"sum_":1700,"neq":1701,"leq":1702,"exp":1703,"freely":1704,"tunable":1705,"controls":1706,"spread":1707,"gaussians":1708,"factor":1709,"sum_i":1710,"q_i":1711,"imath":1712,"boldsymbol":1713,"r_i":1714,"sum_n":1715,"q_n":1716,"w_n":1717,"sqrt":1718,"imaginary":1719,"ion":1720,"charge":1721,"wannier":1722,"centroid":1723,"wc":1724,"separated":1725,"proved":1726,"approximations":1727,"dominated":1728,"summation":1729,"quadrupole":1730,"decay":1731,"distance":1732,"centroids":1733,"dw":1734,"represent":1735,"position":1736,"associated":1737,"consult":1738,"introduction":1739,"detailed":1740,"tutorial":1741,"purposes":1742,"noted":1743,"enough":1744,"productive":1745,"settings":1746,"fitting_net":1747,"dipole_type":1748,"neuron":1749,"seed":1750,"oxygens":1751,"displacement":1752,"oxygen":1753,"shares":1754,"dimensional":1755,"vectors":1756,"pref":1757,"pref_atomic":1758,"atomic_dipole":1759,"represents":1760,"wannier_centroid_position":1761,"atom_position":1762,"tools":1763,"wannier90":1764,"started":1765,"modify":1766,"part":1767,"modifier":1768,"dipole_charge":1769,"model_name":1770,"model_charge_map":1771,"sys_charge_map":1772,"ewald_h":1773,"00":1774,"ewald_beta":1775,"specifies":1776,"predict":1777,"wcs":1778,"amount":1779,"assigned":1780,"nuclear":1781,"hydrogen":1782,"charges":1783,"assigns":1784,"grid":1785,"transformation":1786,"kspace":1787,"interaction":1788,"propagated":1789,"classical":1790,"virtual":1791,"site":1792,"unfortunately":1793,"natively":1794,"sites":1795,"hack":1796,"makes":1797,"wired":1798,"atom_style":1799,"full":1800,"moreover":1801,"established":1802,"indicate":1803,"molecules":1804,"512":1805,"16":1806,"421037674":1807,"xhi":1808,"ylo":1809,"yhi":1810,"zlo":1811,"zhi":1812,"xy":1813,"xz":1814,"yz":1815,"masses":1816,"4960699081e":1817,"5073699951e":1818,"6371297836e":1819,"0597701073e":1820,"8156299591e":1821,"2051420212e":1822,"01":1823,"385":1824,"386":1825,"hydrogens":1826,"simulate":1827,"mass":1828,"explanations":1829,"groups":1830,"real_atom":1831,"virtual_atom":1832,"bonded":1833,"applied":1834,"bond_sytle":1835,"pair_style":1836,"pair_coeff":1837,"bond_style":1838,"bond_coeff":1839,"special_bonds":1840,"lj":1841,"coul":1842,"angle":1843,"inferred":1844,"switches":1845,"off":1846,"exclusion":1847,"intramolecular":1848,"kspace_style":1849,"pppm":1850,"gewald":1851,"ik":1852,"kspace_modify":1853,"diff":1854,"mesh":1855,"kmesh":1856,"dense":1857,"converged":1858,"syntax":1859,"style_name":1860,"keyword":1861,"prettier":1862,"16160":1863,"ignore":1864,"_dplr_":1865,"appended":1866,"type_associate":1867,"bond_type":1868,"efield":1869,"pair_deepmd_index":1870,"nr1":1871,"nw1":1872,"nr2":1873,"nw2":1874,"nri":1875,"nwi":1876,"nb1":1877,"nb2":1878,"nbi":1879,"ex":1880,"ey":1881,"ez":1882,"electric":1883,"field":1884,"along":1885,"direction":1886,"idx":1887,"starting":1888,"asserting":1889,"associates":1890,"fix_modify":1891,"calculates":1892,"propagates":1893,"toms":1894,"third":1895,"party":1896,"assign":1897,"determine":1898,"elements":1899,"mapped":1900,"dependent":1901,"efield_z":1902,"sin":1903,"006":1904,"v_efield_z":1905,"behaves":1906,"fix_efield":1907,"yet":1908,"description":1909,"document":1910,"excluding":1911,"real_temp":1912,"temp":1913,"real_press":1914,"pressure":1915,"nvt":1916,"tau_t":1917,"kinetic":1918,"thermostat":1919,"accessed":1920,"thermo_print":1921,"thermo_freq":1922,"pe":1923,"ke":1924,"etotal":1925,"enthalpy":1926,"c_real_temp":1927,"c_real_press":1928,"vol":1929,"append":1930,"thermo":1931,"out":1932,"press":1933,"pxx":1934,"pyy":1935,"pzz":1936,"complains":1937,"exists":1938,"copied":1939,"lasts":1940,"longer":1941,"blow":1942,"poor":1943,"quality":1944,"restriction":1945,"printed":1946,"later":1947,"2112":1948,"13327":1949,"correction":1950,"combine":1951,"qm":1952,"mm":1953,"corrects":1954,"low":1955,"initially":1956,"fast":1957,"linear":1958,"semiempirical":1959,"ab":1960,"initio":1961,"quantitatively":1962,"mid":1963,"leveraging":1964,"lists":1965,"routinely":1966,"mechanical":1967,"fields":1968,"amber":1969,"ranged":1970,"modeled":1971,"efficiently":1972,"particle":1973,"ewald":1974,"multipolar":1975,"potentials":1976,"modified":1977,"disable":1978,"s_":1979,"r_":1980,"ij":1981,"begin":1982,"land":1983,"remove":1984,"e_i":1985,"_0":1986,"worth":1987,"mentioning":1988,"jctc":1989,"1021":1990,"acs":1991,"1c00201":1992,"normal":1993,"_ab":1994,"initio_":1995,"eliminated":1996,"assuming":1997,"hw":1998,"ow":1999,"describe":2000,"separately":2001,"se_a_ebd_v2":2002,"rcut_smth":2003,"rcut":2004,"25":2005,"50":2006,"exclude_types":2007,"axis_neuron":2008,"_comment":2009,"set_davg_zero":2010,"type_one_side":2011,"itertools":2012,"combinations_with_replacement":2013,"assumes":2014,"atom_ener":2015,"240":2016,"resnet_dt":2017,"null":2018,"works":2019,"practices":2020,"amberdprc":2021,"able":2022,"accepts":2023,"pairwise":2024,"too":2025,"try":2026,"experimental":2027,"internal":2028,"sum":2029,"residue":2030,"region":2031,"fragmentation":2032,"qm_model":2033,"qmmm_model":2034,"pairwise_dprc":2035,"type_embedding":2036,"24":2037,"residues":2038,"shape":2039,"nframes":2040,"always":2041,"grouped":2042,"docker":2043,"download":2044,"release":2045,"projects":2046,"matches":2047,"tag":2048,"pull":2049,"ghcr":2050,"extra":2051,"url":2052,"cu12":2053,"simple":2054,"downloaded":2055,"nightly":2056,"workflows":2057,"package_c":2058,"libdeepmd_c":2059,"tar":2060,"gz":2061,"zip":2062,"shell":2063,"wget":2064,"unzip":2065,"kit_dev":2066,"kit_rc":2067,"knowledge_base":2068,"1s":2069,"various":2070,"prefer":2071,"yourself":2072,"jump":2073,"mpirun":2074,"considering":2075,"parallel":2076,"require":2077,"libc":2078,"17":2079,"driver":2080,"deploy":2081,"minor":2082,"advance":2083,"detection":2084,"tasks":2085,"overriding":2086,"faq":2087,"just":2088,"copy":2089,"paste":2090,"curl":2091,"fssl":2092,"dp1s":2093,"activity":2094,"offline":2095,"releases":2096,"page":2097,"split":2098,"limit":2099,"merge":2100,"downloading":2101,"cuda118":2102,"linux":2103,"x86_64":2104,"enable":2105,"activate":2106,"anaconda":2107,"distribution":2108,"miniconda":2109,"miniforge":2110,"horovod":2111,"platforms":2112,"x86":2113,"macos":2114,"arm64":2115,"tipsandtricks":2116,"installing":2117,"enabled":2118,"challenging":2119,"dependencies":2120,"maintainers":2121,"organization":2122,"members":2123,"pkgs":2124,"container":2125,"8_cpu":2126,"8_cuda12":2127,"0_gpu":2128,"toolkit":2129,"cudnn":2130,"whl":2131,"cuda12":2132,"generate":2133,"ipi":2134,"tab":2135,"cu126":2136,"platform":2137,"aarch64":2138,"28":2139,"windows":2140,"rocm":2141,"please":2142,"extras":2143,"mpich":2144,"alias":2145,"tf_inter_op_parallelism_threads":2146,"control":2147,"parallelism":2148,"eigen":2149,"job":2150,"troubleshooting":2151,"howtoset_num_nodes":2152,"tf_intra_op_parallelism_threads":2153,"openmp":2154,"spec":2155,"openmpch6":2156,"threads":2157,"omp_num_threads":2158,"openmpse50":2159,"x289":2160,"20540006":2161,"programming":2162,"cuda_visible_devices":2163,"amd":2164,"conceptual":2165,"isolation":2166,"torch_environment_variables":2167,"jax_platforms":2168,"controlling":2169,"placement":2170,"xla_flags":2171,"gpu_performance_tips":2172,"xla":2173,"flags":2174,"parallelization":2175,"either":2176,"decrease":2177,"1024":2178,"until":2179,"batch":2180,"multiplying":2181,"cores":2182,"whichever":2183,"subprocesses":2184,"loading":2185,"programs":2186,"unix":2187,"plugin":2188,"libraries":2189,"plugin1":2190,"plugin2":2191,"dll":2192,"kineto":2193,"profiler":2194,"stem":2195,"unset":2196,"disabled":2197,"profiling":2198,"lifetime":2199,"loaded":2200,"trace":2201,"finish":2202,"env_value":2203,"_gpu":2204,"running":2205,"examined":2206,"chrome":2207,"viewer":2208,"ui":2209,"perfetto":2210,"tracing":2211,"activities":2212,"export":2213,"dp_profiler":2214,"np":2215,"produces":2216,"result_gpux":2217,"rank":2218,"tips":2219,"sizable":2220,"limiting":2221,"distinct":2222,"finetuning":2223,"finetune":2224,"pretraining":2225,"widely":2226,"computer":2227,"vision":2228,"cv":2229,"natural":2230,"language":2231,"nlp":2232,"vastly":2233,"reduce":2234,"cost":2235,"trivial":2236,"compositions":2237,"samples":2238,"upstream":2239,"leading":2240,"shifts":2241,"diversities":2242,"recently":2243,"emerging":2244,"nature":2245,"articles":2246,"01278":2247,"brought":2248,"us":2249,"perform":2250,"approaches":2251,"hopefully":2252,"knowledge":2253,"especially":2254,"pretrained":2255,"oc2m":2256,"open":2257,"catalyst":2258,"ocp":2259,"strategy":2260,"performed":2261,"simply":2262,"last":2263,"overwritten":2264,"contained":2265,"structures":2266,"trainable":2267,"simplified":2268,"adaptable":2269,"methodology":2270,"encompasses":2271,"primary":2272,"variations":2273,"saying":2274,"tune":2275,"utilizes":2276,"modifies":2277,"continuing":2278,"case":2279,"implementations":2280,"wish":2281,"conduct":2282,"randomly":2283,"initialized":2284,"random":2285,"know":2286,"params":2287,"pretrain":2288,"subsection":2289,"additionally":2290,"offered":2291,"maintaining":2292,"individual":2293,"multitask_pretrained":2294,"select":2295,"choosen_branch":2296,"included":2297,"branches":2298,"referring":2299,"show":2300,"selected":2301,"typical":2302,"relying":2303,"solely":2304,"gradually":2305,"lead":2306,"forgetting":2307,"desirable":2308,"retain":2309,"prevent":2310,"could":2311,"beneficial":2312,"achieve":2313,"clearly":2314,"identify":2315,"retained":2316,"subsequent":2317,"multi_input":2318,"suppose":2319,"downstream_data":2320,"pre_data1":2321,"pre_data2":2322,"ideally":2323,"extracting":2324,"model_dict":2325,"loss_dict":2326,"data_dict":2327,"model_prob":2328,"desired":2329,"insert":2330,"thereby":2331,"generating":2332,"specify":2333,"finetune_head":2334,"appear":2335,"shared_dict":2336,"learning_rate":2337,"training_data":2338,"training_data_config_for_downstream_data":2339,"validation_data":2340,"validation_data_config_for_downstream_data":2341,"initiate":2342,"akin":2343,"whereas":2344,"2312":2345,"15492":2346,"refering":2347,"extracted":2348,"dumped":2349,"our":2350,"morgan":2351,"blog":2352,"metaflow":2353,"fr":2354,"d4f3596b3adc":2355,"chosen_branch":2356,"head":2357,"model_branch1":2358,"known":2359,"restricted":2360,"controlled":2361,"theoretically":2362,"accept":2363,"about":2364,"4096":2365,"gromacs":2366,"methane":2367,"tip3p":2368,"relevant":2369,"topology":2370,"preparation":2371,"dihedrals":2372,"columb":2373,"nnp":2374,"turned":2375,"modifying":2376,"exclusions":2377,"ethane":2378,"deeppotential":2379,"presented":2380,"itp":2381,"atomtypes":2382,"btype":2383,"ptype":2384,"sigma":2385,"epsilon":2386,"c3":2387,"339771":2388,"451035":2389,"hc":2390,"260018":2391,"087027":2392,"moleculetype":2393,"nrexcl":2394,"nr":2395,"resnr":2396,"cgnr":2397,"mol":2398,"c1":2399,"1068":2400,"010":2401,"h1":2402,"0267":2403,"008":2404,"h3":2405,"h4":2406,"b0":2407,"kb":2408,"ai":2409,"aj1":2410,"aj2":2411,"aj3":2412,"aj4":2413,"comparison":2414,"acpype":2415,"methane_gmx":2416,"2021":2417,"05t22":2418,"15":2419,"50cet":2420,"wed":2421,"sep":2422,"53":2423,"amb":2424,"39771e":2425,"51035e":2426,"91":2427,"1078":2428,"60018e":2429,"70272e":2430,"0208":2431,"resi":2432,"res":2433,"qtot":2434,"106800":2435,"01000":2436,"107":2437,"026700":2438,"00800":2439,"080":2440,"053":2441,"027":2442,"aj":2443,"funct":2444,"0970e":2445,"1455e":2446,"05":2447,"ak":2448,"theta":2449,"cth":2450,"0758e":2451,"2635e":2452,"tell":2453,"gmx_deepmd_input_json":2454,"working":2455,"graph_file":2456,"type_file":2457,"index_file":2458,"pbc":2459,"looks":2460,"gro":2461,"alchemical":2462,"condition":2463,"gmx":2464,"mdrun":2465,"usual":2466,"turn":2467,"shown":2468,"top":2469,"num":2470,"0000":2471,"00000e":2472,"mentioned":2473,"ensemble":2474,"plot":2475,"radial":2476,"rdf":2477,"perfectly":2478,"evidence":2479,"validity":2480,"png":2481,"recommend":2482,"howtoset_netsize":2483,"al2o3":2484,"form":2485,"forms":2486,"l2err":2487,"ev":2488,"angstrom":2489,"742252e":2490,"259383e":2491,"014115e":2492,"80":2493,"799349e":2494,"497287e":2495,"042977e":2496,"799036e":2497,"495984e":2498,"068806e":2499,"834032e":2500,"641801e":2501,"094784e":2502,"913058e":2503,"971073e":2504,"154775e":2505,"932914e":2506,"053808e":2507,"188052e":2508,"944832e":2509,"103467e":2510,"217826e":2511,"068631e":2512,"619296e":2513,"300497e":2514,"267962e":2515,"449840e":2516,"413609e":2517,"813596e":2518,"172332e":2519,"04":2520,"781115e":2521,"135002e":2522,"306251e":2523,"373120e":2524,"hidden":2525,"situation":2526,"cu":2527,"909990e":2528,"212496e":2529,"734667e":2530,"357767e":2531,"399070e":2532,"706385e":2533,"060367e":2534,"525153e":2535,"333304e":2536,"656043e":2537,"356685e":2538,"793539e":2539,"277023e":2540,"198759e":2541,"459995e":2542,"302282e":2543,"426174e":2544,"672238e":2545,"135548e":2546,"615449e":2547,"940946e":2548,"323858e":2549,"689007e":2550,"955762e":2551,"399364e":2552,"718502e":2553,"962891e":2554,"468404e":2555,"745470e":2556,"970111e":2557,"463580e":2558,"743586e":2559,"972011e":2560,"493758e":2561,"755374e":2562,"971303e":2563,"500736e":2564,"758100e":2565,"973878e":2566,"542073e":2567,"774247e":2568,"964761e":2569,"545168e":2570,"775456e":2571,"983201e":2572,"203562e":2573,"642016e":2574,"925881e":2575,"146672e":2576,"619794e":2577,"936911e":2578,"263060e":2579,"665258e":2580,"955818e":2581,"994913e":2582,"951138e":2583,"007786e":2584,"022157e":2585,"992802e":2586,"532119e":2587,"362098e":2588,"320695e":2589,"073860e":2590,"061800e":2591,"758515e":2592,"126418e":2593,"843161e":2594,"844985e":2595,"348505e":2596,"404335e":2597,"673568e":2598,"304089e":2599,"508016e":2600,"890688e":2601,"382356e":2602,"686949e":2603,"783965e":2604,"294820e":2605,"1589e":2606,"1540e":2607,"200":2608,"3221e":2609,"2366e":2610,"160":2611,"4274e":2612,"3403e":2613,"5407e":2614,"3093e":2615,"4605e":2616,"3402e":2617,"8533e":2618,"5790e":2619,"0057e":2620,"03":2621,"8232e":2622,"0466e":2623,"2279e":2624,"1154e":2625,"7994e":2626,"1289e":2627,"9613e":2628,"2368e":2629,"9786e":2630,"3558e":2631,"7042e":2632,"4633e":2633,"1265e":2634,"5193e":2635,"2136e":2636,"mg":2637,"al":2638,"5080e":2639,"3593e":2640,"7996e":2641,"6338e":2642,"0353e":2643,"2776e":2644,"1254e":2645,"3195e":2646,"2495e":2647,"0371e":2648,"3604e":2649,"9883e":2650,"4358e":2651,"7389e":2652,"1765e":2653,"7276e":2654,"9606e":2655,"6289e":2656,"9449e":2657,"6471e":2658,"0947e":2659,"6413e":2660,"9234e":2661,"6283e":2662,"9758e":2663,"6506e":2664,"9142e":2665,"6348e":2666,"1302e":2667,"7006e":2668,"3433e":2669,"7524e":2670,"3154e":2671,"9716e":2672,"4210e":2673,"9710e":2674,"2667e":2675,"2568e":2676,"3676e":2677,"6375e":2678,"3999e":2679,"6097e":2680,"0292e":2681,"6555e":2682,"1743e":2683,"7026e":2684,"8138e":2685,"8516e":2686,"6052e":2687,"0709e":2688,"1335e":2689,"1450e":2690,"6469e":2691,"3003e":2692,"8222e":2693,"6318e":2694,"0678e":2695,"9559e":2696,"multiprocessing":2697,"nodes":2698,"mpi4py":2699,"torchrun":2700,"elastic":2701,"decreases":2702,"indirectly":2703,"enables":2704,"developer_parallel":2705,"distributed":2706,"processes":2707,"num_nodes":2708,"hpc":2709,"scheduler":2710,"streams":2711,"dp_inter_op_parallelism_threads":2712,"stream":2713,"encouraged":2714,"dp_intra_op_parallelism_threads":2715,"intel":2716,"onednn":2717,"care":2718,"environmental":2719,"kmp_blocktime":2720,"content":2721,"technical":2722,"maximize":2723,"considerations":2724,"recommendations":2725,"recipes":2726,"tuning_guide":2727,"situations":2728,"empirical":2729,"again":2730,"compete":2731,"howtoset_rcut":2732,"half":2733,"boxsize":2734,"seeking":2735,"considers":2736,"mirror":2737,"cells":2738,"ps":2739,"reason":2740,"why":2741,"nearest":2742,"mirrors":2743,"center":2744,"howtoset_sel":2745,"sel_a":2746,"accurate":2747,"larger":2748,"largest":2749,"overhead":2750,"increases":2751,"balance":2752,"organizes":2753,"roughly":2754,"view":2755,"snapshot":2756,"trajectory":2757,"necessarily":2758,"come":2759,"records":2760,"assumed":2761,"patch":2762,"well":2763,"own":2764,"xzf":2765,"glibc":2766,"installs":2767,"kits":2768,"deepmd_c_root":2769,"mkdir":2770,"ddeepmd_c_root":2771,"dcmake_install_prefix":2772,"j8":2773,"dp_ipi":2774,"prefix":2775,"webpage":2776,"tree":2777,"git":2778,"clone":2779,"workspace":2780,"convenience":2781,"record":2782,"location":2783,"pwd":2784,"machine":2785,"deepmd_venv":2786,"virtualenv":2787,"python3":2788,"bin":2789,"instruction":2790,"concerned":2791,"verify":2792,"reduce_sum":2793,"stack":2794,"ml":2795,"activated":2796,"he":2797,"she":2798,"deactivate":2799,"interpreters":2800,"remember":2801,"compiler":2802,"higher":2803,"_glibcxx_use_cxx11_abi":2804,"onlinedocs":2805,"libstdc":2806,"using_dual_abi":2807,"tested_build_configurations":2808,"compiler_version":2809,"executing":2810,"variant":2811,"nvcc":2812,"rocm_root":2813,"look":2814,"rocm_path":2815,"hipconfig":2816,"rocmpath":2817,"installer":2818,"finds":2819,"getusersitepackages":2820,"sysconfig":2821,"get_path":2822,"purelib":2823,"517":2824,"0517":2825,"tensorflow_version":2826,"pypi":2827,"pytorch_version":2828,"compilation":2829,"lang":2830,"hip":2831,"compiling":2832,"cmake_lang_flags":2833,"critical":2834,"released":2835,"december":2836,"2025":2837,"patches":2838,"feedstock":2839,"recipe":2840,"nccl":2841,"communicator":2842,"horovod_without_gloo":2843,"horovod_with_tensorflow":2844,"horovod_gpu_operations":2845,"horovod_nccl_home":2846,"proper":2847,"invoke":2848,"horovodrun":2849,"v0":2850,"22":2851,"mxnet":2852,"controllers":2853,"gloo":2854,"ddl":2855,"ccl":2856,"shipped":2857,"fall":2858,"serial":2859,"previous":2860,"safely":2861,"libtensorflow_cc":2862,"packaged":2863,"tested":2864,"noticed":2865,"build_tf":2866,"libtorch":2867,"prebuilt":2868,"lang_c":2869,"nothing":2870,"download_and_extract":2871,"paddle_inference_install_dir":2872,"weekly":2873,"cuda123_cudnn900_trt8616_d1":2874,"paddle_inference":2875,"tgz":2876,"qa":2877,"bj":2878,"bcebos":2879,"github_docker_compile_test_cuda123_cudnn900_trt8616_d1":2880,"github_docker_compile_test_cpu_mkl_avx_d1":2881,"go":2882,"flag":2883,"denable_tensorflow":2884,"duse_tf_python_libs":2885,"dtensorflow_root":2886,"torch_root":2887,"denable_pytorch":2888,"dcmake_prefix_path":2889,"duse_pt_python_libs":2890,"enable_jax":2891,"denable_jax":2892,"tensorflow_c_root":2893,"paddle_inference_dir":2894,"denable_paddle":2895,"dpaddle_inference_dir":2896,"var":2897,"cmdoption":2898,"enable_tensorflow":2899,"cmake_install_prefix":2900,"search":2901,"findcudatoolkit":2902,"8apr2021":2903,"______________________________________________________________________":2904,"executed":2905,"successfully":2906,"commands":2907,"j4":2908,"executable":2909,"2020":2910,"deepmd_kit_root":2911,"dp_gmx_patch":2912,"gromacs_root":2913,"refers":2914,"attempting":2915,"guarantee":2916,"patching":2917,"protocolbuffers":2918,"deepmd_env_dir":2919,"cause":2920,"incompatibility":2921,"sample":2922,"usr":2923,"fftw":2924,"cmake3":2925,"dcmake_cxx_standard":2926,"seems":2927,"dgmx_mpi":2928,"dgmx_gpu":2929,"fully":2930,"dcudatoolkit_root":2931,"client":2932,"server":2933,"integrating":2934,"replica":2935,"computes":2936,"communicate":2937,"socket":2938,"internet":2939,"already":2940,"drivers":2941,"pytest":2942,"pyargs":2943,"ways":2944,"uncompress":2945,"archive":2946,"stable_22jul2025_update2":2947,"xf":2948,"src":2949,"cp":2950,"lmp_mpi":2951,"removed":2952,"cmakelists":2953,"txt":2954,"echo":2955,"builtin":2956,"lammps_install_rpath":2957,"build_shared_libs":2958,"allowing":2959,"lammps_source_root":2960,"pkg_plugin":2961,"cmake_install_libdir":2962,"cmake_install_full_libdir":2963,"applicable":2964,"runpath":2965,"man7":2966,"man":2967,"pages":2968,"man8":2969,"ld":2970,"liblammps":2971,"patchelf":2972,"13":2973,"nodejs":2974,"js":2975,"npm":2976,"world":2977,"swig":2978,"globally":2979,"v4":2980,"v12":2981,"v18":2982,"gyp":2983,"build_nodejs_if":2984,"nodejs_include_dirs":2985,"bind":2986,"deepmdjavascript_wrap":2987,"firstly":2988,"bazel":2989,"bazelisk":2990,"bazelbuild":2991,"launched":2992,"amd64":2993,"chmod":2994,"depth":2995,"configure":2996,"answer":2997,"questions":2998,"question":2999,"xxx":3000,"opencl":3001,"sycl":3002,"tensorrt":3003,"lib64":3004,"comma":3005,"capabilities":3006,"capability":3007,"config":3008,"opt":3009,"march":3010,"wno":3011,"sign":3012,"compare":3013,"would":3014,"interactively":3015,"android":3016,"configuring":3017,"preconfigured":3018,"configs":3019,"bazelrc":3020,"mkl":3021,"monolithic":3022,"mostly":3023,"ngraph":3024,"numa":3025,"dynamic_kernels":3026,"kernels":3027,"separate":3028,"objects":3029,"noaws":3030,"aws":3031,"s3":3032,"filesystem":3033,"nogcp":3034,"gcp":3035,"nohdfs":3036,"hdfs":3037,"nonccl":3038,"finished":3039,"accordingly":3040,"verbose_failures":3041,"copt":3042,"msse4":3043,"mavx":3044,"mavx2":3045,"mfma":3046,"sse4":3047,"avx":3048,"avx2":3049,"fma":3050,"simd":3051,"accelerations":3052,"chosen":3053,"ram":3054,"issue":3055,"local_resources":3056,"2048":3057,"oneapi":3058,"partnership":3059,"exist":3060,"libtensorflow_framework":3061,"headers":3062,"rsync":3063,"avzh":3064,"exclude":3065,"_virtual_includes":3066,"inc":3067,"core":3068,"tsl":3069,"third_party":3070,"external":3071,"eigen_archive":3072,"unsupported":3073,"com_google_protobuf":3074,"com_google_absl":3075,"absl":3076,"ve":3077,"libiomp5":3078,"k8":3079,"llvm_openmp":3080,"unknown":3081,"early":3082,"upgrading":3083,"newer":3084,"resolve":3085,"inadequate":3086,"plugins":3087,"say":3088,"produced":3089,"failure":3090,"clear":3091,"rm":3092,"redo":3093,"integral":3094,"xml":3095,"allow":3096,"computing":3097,"replicas":3098,"verbose":3099,"use_unix":3100,"port":3101,"31415":3102,"localhost":3103,"coord_file":3104,"conf":3105,"xyz":3106,"atom_type":3107,"hw1":3108,"hw2":3109,"wikipedia":3110,"wiki":3111,"xyz_file_format":3112,"meanwhile":3113,"ignores":3114,"translates":3115,"units":3116,"metal":3117,"aa":3118,"proton":3119,"si":3120,"welcome":3121,"done":3122,"thing":3123,"deeptensor":3124,"totally":3125,"infer":3126,"quantities":3127,"request":3128,"libdeepmd_lmp":3129,"patch_24mar2022":3130,"lammps_plugin_path":3131,"deepmd_lmp":3132,"deepspin":3133,"referred":3134,"serves":3135,"timestep":3136,"among":3137,"out_freq":3138,"timesteps":3139,"_out_file_":3140,"_out_freq_":3141,"_fparam_":3142,"_fparam_from_compute_":3143,"_aparam_from_compute_":3144,"_atomic_":3145,"_relative_":3146,"_relative_v_":3147,"_aparam_":3148,"_ttm_":3149,"out_file":3150,"model_devi":3151,"freq":3152,"evaluation":3153,"fparam_from_compute":3154,"aparam_from_compute":3155,"relative_v":3156,"ttm":3157,"graph_0":3158,"graph_1":3159,"graph_2":3160,"evaluate":3161,"edition":3162,"evaluates":3163,"maximal":3164,"minimal":3165,"deviations":3166,"scale":3167,"pair_hybrid":3168,"f_i":3169,"d_":3170,"norm":3171,"definition":3172,"v_i":3173,"fed":3174,"global":3175,"compute_temp":3176,"compute_ke_atom":3177,"temperatures":3178,"fix_ttm":3179,"ntypes":3180,"specifying":3181,"placeholders":3182,"indexes":3183,"restrictions":3184,"visit":3185,"spin":3186,"magnetic":3187,"ni":3188,"tensorial":3189,"dpspin":3190,"model_file":3191,"dump":3192,"c_dipole":3193,"reciprocal":3194,"writes":3195,"0e":3196,"45":3197,"direct":3198,"cut":3199,"splitting":3200,"stress":3201,"3x3":3202,"heat":3203,"flux":3204,"dvatom":3205,"_n":3206,"de_m":3207,"nth":3208,"velocity":3209,"compute_stress_atom":3210,"thompson2":3211,"meaning":3212,"keywords":3213,"cvatom":3214,"inconsistent":3215,"behavior":3216,"corrected":3217,"c_stress":3218,"array":3219,"xx":3220,"yy":3221,"zz":3222,"yx":3223,"zx":3224,"zy":3225,"bertossa":3226,"baroni":3227,"preprint":3228,"2108":3229,"10850":3230,"e_n":3231,"v_n":3232,"r_m":3233,"r_n":3234,"ke_id":3235,"pe_id":3236,"stress_id":3237,"flux_id":3238,"c_flux":3239,"convective":3240,"portion":3241,"compute_heat_flux":3242,"detailes":3243,"d3":3244,"dispersion":3245,"4feb2025":3246,"pair_dispersion_d3":3247,"pbe0":3248,"overlay":3249,"journals":3250,"aps":3251,"prl":3252,"1103":3253,"physrevlett":3254,"143001":3255,"dl":3256,"acm":3257,"5555":3258,"3327345":3259,"3327356":3260,"physrevb":3261,"110":3262,"064427":3263,"rate":3264,"warmup":3265,"phase":3266,"migration":3267,"schedule":3268,"consists":3269,"phases":3270,"followed":3271,"tau":3272,"linearly":3273,"gamma":3274,"cdot":3275,"geq":3276,"decays":3277,"exponential":3278,"exponentially":3279,"lfloor":3280,"rfloor":3281,"stop":3282,"stopping":3283,"cosine":3284,"annealing":3285,"cos":3286,"smoothly":3287,"curve":3288,"over":3289,"ratio":3290,"rho":3291,"stop_lr_ratio":3292,"mutually":3293,"exclusive":3294,"legacy":3295,"decay_steps":3296,"5000":3297,"explicit":3298,"schedules":3299,"specification":3300,"basic":3301,"appropriately":3302,"satisfactorily":3303,"converge":3304,"decayed":3305,"exceeds":3306,"num_steps":3307,"warmup_steps":3308,"decay_rate":3309,"adjusted":3310,"sensible":3311,"stepped":3312,"manner":3313,"formula":3314,"lr":3315,"floor":3316,"current":3317,"decay_phase_steps":3318,"numb_steps":3319,"stabilize":3320,"configured":3321,"warmup_start_factor":3322,"warmup_ratio":3323,"duration":3324,"actual":3325,"starts":3326,"demonstrate":3327,"shows":3328,"10000":3329,"0001":3330,"unlike":3331,"gradual":3332,"exponentiallr":3333,"steplr":3334,"lgplv3":3335,"arbitrary":3336,"linear_ener":3337,"model0":3338,"model1":3339,"floats":3340,"picture":3341,"media":3342,"prefers":3343,"color":3344,"scheme":3345,"dark":3346,"srcset":3347,"_static":3348,"svg":3349,"light":3350,"img":3351,"alt":3352,"beaver":3353,"beavers":3354,"europe":3355,"asia":3356,"became":3357,"nearly":3358,"extinct":3359,"state":3360,"protected":3361,"animal":3362,"china":3363,"population":3364,"giant":3365,"pandas":3366,"hope":3367,"awareness":3368,"protect":3369,"undulation":3370,"undulates":3371,"violently":3372,"far":3373,"equilibrium":3374,"truly":3375,"checking":3376,"happens":3377,"solve":3378,"problem":3379,"suffices":3380,"decompress":3381,"tarball":3382,"scratch":3383,"compatability":3384,"mds":3385,"guarantees":3386,"major":3387,"revisions":3388,"legend":3389,"incompatible":3390,"calculate":3391,"epsilon_y":3392,"n_m":3393,