{"sources":0,"dpgen":1,"__init__":2,"py":3,"defines":4,"def":5,"info":6,"uses":7,"logging":8,"os":9,"__version__":10,"import":11,"root_path":12,"__path__":13,"name":14,"short_cmd":15,"dlog":16,"getlogger":17,"__name__":18,"setlevel":19,"dlogf":20,"filehandler":21,"getcwd":22,"sep":23,"log":24,"delay":25,"true":26,"dlogf_formatter":27,"formatter":28,"asctime":29,"levelname":30,"message":31,"filename":32,"funcname":33,"lineno":34,"setformatter":35,"addhandler":36,"basicconfig":37,"level":38,"warning":39,"__author__":40,"han":41,"wang":42,"__copyright__":43,"copyright":44,"2019":45,"__status__":46,"development":47,"try":48,"from":49,"_version":50,"version":51,"except":52,"importerror":53,"unkown":54,"show":55,"basic":56,"information":57,"about":58,"its":59,"location":60,"print":61,"deepmodeling":62,"path":63,"dependency":64,"modui":65,"numpy":66,"dpdata":67,"pymatgen":68,"monty":69,"ase":70,"paramiko":71,"custodian":72,"mm":73,"__import__":74,"10s":75,"noqa":76,"up031":77,"found":78,"attributeerror":79,"unknown":80,"reference":81,"please":82,"cite":83,"yuzhi":84,"zhang":85,"haidi":86,"weijie":87,"chen":88,"jinzhe":89,"zeng":90,"linfeng":91,"weinan":92,"dp":93,"gen":94,"concurrent":95,"learning":96,"platform":97,"generation":98,"reliable":99,"deep":100,"based":101,"potential":102,"energy":103,"models":104,"computer":105,"physics":106,"communications":107,"2020":108,"107206":109,"typing":110,"tuple":111,"union":112,"file":113,"generated":114,"setuptools":115,"scm":116,"don":117,"change":118,"track":119,"control":120,"__all__":121,"__version_tuple__":122,"version_tuple":123,"type_checking":124,"false":125,"int":126,"str":127,"else":128,"object":129,"13":130,"arginfo":131,"general_mdata_arginfo":132,"tasks":133,"argument":134,"dargs":135,"dispatcher":136,"mdata_arginfo":137,"generate":138,"general":139,"mdata":140,"parameters":141,"task":142,"keys":143,"train":144,"model_devi":145,"fp":146,"returns":147,"doc_api_version":148,"set":149,"doc_deepmd_version":150,"deepmd":151,"kit":152,"doc_run_mdata":153,"machine":154,"json":155,"arg_api_version":156,"api_version":157,"default":158,"optional":159,"doc":160,"arg_deepmd_version":161,"deepmd_version":162,"sub_fields":163,"doc_mdata":164,"command":165,"resources":166,"append":167,"dict":168,"return":169,"auto_test":170,"abacus":171,"class":172,"self":173,"inter_parameter":174,"path_to_poscar":175,"make_potential_files":176,"output_dir":177,"labeledsystem":178,"serialization":179,"dumpfn":180,"abacus_scf":181,"lib":182,"generator":183,"util":184,"sepline":185,"inter":186,"inter_type":187,"type":188,"incar":189,"get":190,"potcar_prefix":191,"potcars":192,"none":193,"orbfile":194,"orb_files":195,"deepks":196,"deepks_desc":197,"deepks_model":198,"if_define_orb_file":199,"scope":200,"after":201,"before":202,"modify_input":203,"make_input_file":204,"compute":205,"stru":206,"abspath":207,"join":208,"isfile":209,"raise":210,"filenotfounderror":211,"stru_data":212,"get_abacus_stru":213,"atom_names":214,"pp_files":215,"dpks_descriptor":216,"islink":217,"stru_path":218,"tmpf":219,"split":220,"readlink":221,"runtimeerror":222,"pseudopotential":223,"pp_dir":224,"cwd":225,"chdir":226,"isdir":227,"pp_orb":228,"mkdir":229,"pp_orb_file":230,"iatom":231,"atomname":232,"enumerate":233,"specify":234,"each":235,"atom":236,"orbital":237,"defined":238,"so":239,"parameter":240,"setting":241,"elif":242,"needed":243,"ignore":244,"descriptor":245,"dpks":246,"model":247,"link":248,"files":249,"file_stru":250,"file_param":251,"filename_in_stru":252,"filename_in_para":253,"match":254,"src_file":255,"can":256,"find":257,"tar_file":258,"remove":259,"symlink":260,"task_type":261,"task_param":262,"forward_files":263,"forward_common_files":264,"indent":265,"ch":266,"assert":267,"exists":268,"input":269,"relaxation":270,"relax_incar_path":271,"incar_relax":272,"get_abacus_input_parameters":273,"deal":274,"cal_type":275,"cal_setting":276,"user":277,"property":278,"calculation":279,"input_prop":280,"incar_prop":281,"detected":282,"use":283,"revise":284,"provided":285,"interaction":286,"key":287,"relax_pos":288,"relax_shape":289,"relax_vol":290,"k_points":291,"continue":292,"lower":293,"fix_atom":294,"relax":295,"cell":296,"fixed_axes":297,"volume":298,"fix":299,"shape":300,"supported":301,"scf":302,"static":303,"modify":304,"base":305,"value":306,"stru_fix_atom":307,"basis_type":308,"pw":309,"property_type":310,"backward_files":311,"lcao":312,"mess":313,"define":314,"format":315,"model_file":316,"write_input":317,"kspacing":318,"isinstance":319,"float":320,"len":321,"kpt":322,"make_kspacing_kpt":323,"point":324,"you":325,"word":326,"unit":327,"bohr":328,"one":329,"three":330,"list":331,"write_kpt":332,"cannot":333,"skip":334,"ls":335,"fmt":336,"outcar_dict":337,"as_dict":338,"eos":339,"inter_param":340,"make_confs":341,"path_to_work":342,"path_to_equi":343,"refine":344,"glob":345,"re":346,"np":347,"loadfn":348,"vasp":349,"make_refine":350,"reproduce":351,"make_repro":352,"post_repro":353,"reprod":354,"init_from_suffix":355,"output_suffix":356,"vol_start":357,"vol_end":358,"vol_step":359,"vol_abs":360,"default_cal_setting":361,"00":362,"post_process":363,"already":364,"makedirs":365,"start_confs_path":366,"init_path_list":367,"struct_init_name_list":368,"ii":369,"struct_output_name":370,"relax_task":371,"task_list":372,"starts":373,"init_data_path":374,"provide":375,"initial":376,"data":377,"reprod_last_frame":378,"init_from_path":379,"sub":380,"count":381,"task_list_basename":382,"map":383,"basename":384,"init_from_task":385,"output_task":386,"relpath":387,"every":388,"treat":389,"absolute":390,"relative":391,"equi_contcar":392,"final_stru":393,"contcar":394,"do":395,"first":396,"vol_to_poscar":397,"abs":398,"linalg":399,"det":400,"cells":401,"array":402,"atom_numbs":403,"sum":404,"poscar_vol":405,"poscar_natoms":406,"scale2equi":407,"task_num":408,"while":409,"vol":410,"arange":411,"100":412,"06d":413,"exist_ok":414,"poscar":415,"poscar_orig":416,"orig":417,"scale_func":418,"stru_scale":419,"poscar_scale":420,"potcar":421,"conf":422,"lmp":423,"lammps":424,"scale":425,"eos_params":426,"06":427,"22":428,"_compute_lower":429,"output_file":430,"all_tasks":431,"all_res":432,"pass":433,"res_data":434,"ptr_data":435,"conf_dir":436,"dirname":437,"vpa":438,"epa":439,"ev":440,"range":441,"task_result":442,"energies":443,"3f":444,"4f":445,"force":446,"open":447,"dump":448,"elastic":449,"shutil":450,"copyfile":451,"incar_upper":452,"default_norm_def":453,"1e":454,"default_shear_def":455,"norm_deform":456,"shear_deform":457,"analysis":458,"elasticity":459,"strain":460,"deformedstructureset":461,"core":462,"structure":463,"task_poscar":464,"output":465,"stress":466,"unsupported":467,"result":468,"fin":469,"equi_result":470,"load":471,"equi_stress":472,"equi":473,"record":474,"df":475,"from_deformation":476,"dfm_ss":477,"deformations":478,"idid":479,"norm_def":480,"shear_def":481,"norm_strains":482,"shear_strains":483,"ss":484,"stru2structure":485,"from_file":486,"symmetry":487,"n_dfm":488,"norm":489,"shear":490,"jj":491,"deformed_structures":492,"poscar2stru":493,"io":494,"kpoints":495,"poscar_start":496,"input_aba":497,"del":498,"rename":499,"kgamma":500,"ret":501,"make_kspacing_kpoints":502,"kp":503,"from_string":504,"from_str":505,"write_file":506,"kpoints_universal":507,"elastictensor":508,"1000":509,"lst_strain":510,"lst_stress":511,"result_task":512,"et":513,"from_independent_strains":514,"eq_stress":515,"elastic_tensor":516,"voigt":517,"1e4":518,"2f":519,"bv":520,"k_voigt":521,"gv":522,"g_voigt":523,"uv":524,"bulk":525,"modulus":526,"gpa":527,"youngs":528,"poission":529,"ratio":530,"gamma":531,"lattice":532,"cubic":533,"bcc":534,"fcc":535,"bodycenteredcubic":536,"facecenteredcubic":537,"common":538,"lines":539,"miller_index":540,"displace_direction":541,"lattice_type":542,"supercell_size":543,"min_vacuum_size":544,"20":545,"add_fix":546,"standard":547,"method":548,"n_steps":549,"10":550,"atom_num":551,"centralize_slab":552,"return_direction":553,"__gen_slab_ase":554,"line":555,"miller":556,"we":557,"now":558,"only":559,"support":560,"metals":561,"slip":562,"systems":563,"planes":564,"direction":565,"010":566,"110":567,"111":568,"112":569,"123":570,"system":571,"tmp":572,"ptypes":573,"get_poscar_types":574,"read":575,"relaxed":576,"rewrite":577,"new":578,"direct":579,"coords":580,"relax_a":581,"relax_b":582,"relax_c":583,"slab":584,"symbol":585,"lat_param":586,"displace":587,"vectors":588,"disp_vector":589,"all_slabs":590,"__displace_slab":591,"sites":592,"03d":593,"atoms":594,"make":595,"confs":596,"regulate_poscar":597,"sort_poscar":598,"perturb_xz":599,"pert_xz":600,"staticmethod":601,"z_pos_list":602,"site":603,"position":604,"sort":605,"central_atoms":606,"central_cell":607,"disp_length":608,"miller_str":609,"direct_str":610,"search_key":611,"specific":612,"dict_directions":613,"directions":614,"keyerror":615,"combination":616,"index":617,"displacement":618,"aseatomsadaptor":619,"error":620,"slab_ase":621,"size":622,"latticeconstant":623,"hcp":624,"center":625,"vacuum":626,"axis":627,"slab_pymatgen":628,"get_structure":629,"leave":630,"function":631,"later":632,"__gen_slab_pmg":633,"pmg_struc":634,"slabgen":635,"slabgenerator":636,"min_slab_size":637,"center_slab":638,"in_unit_planes":639,"lll_reduce":640,"primitive":641,"max_normal_search":642,"slab_pmg":643,"get_slab":644,"make_supercell":645,"scaling_matrix":646,"displaced":647,"objects":648,"__poscar_fix":649,"add":650,"condition":651,"__stru_fix":652,"__inlammpes_fix":653,"inlammps":654,"copy":655,"frac_disp":656,"unit_vector":657,"number":658,"which":659,"above":660,"disp_atoms_list":661,"where":662,"frac_coords":663,"translate_sites":664,"indices":665,"vector":666,"to_unit_cell":667,"insert_pos":668,"fix_dict":669,"add_fix_str":670,"fin1":671,"contents":672,"readlines":673,"insert":674,"selective":675,"dynamics":676,"replace":677,"fin2":678,"write":679,"fix_xyz":680,"addfix":681,"null":682,"all":683,"setforce":684,"upper":685,"search":686,"variable":687,"equal":688,"min_style":689,"cg":690,"lower_id":691,"upper_id":692,"calc_type":693,"plane":694,"along":695,"no_task":696,"tdisplacement":697,"tstacking_fault_e":698,"slab_equi_epa":699,"task_result_slab_equi":700,"natoms":701,"equi_epa_slab":702,"aa":703,"cross":704,"equi_path":705,"equi_epa":706,"structure_dir":707,"cf":708,"60217657e":709,"16":710,"001":711,"sfe":712,"25s":713,"interstitial":714,"default_supercell":715,"supercell":716,"insert_ele":717,"defects":718,"generators":719,"interstitialgenerator":720,"element":721,"out":722,"dss":723,"insert_element_task":724,"pre_vds":725,"vds":726,"temp":727,"get_supercell_structure":728,"sc_mat":729,"diag":730,"smallest_distance":731,"distance_matrix":732,"ravel":733,"conf_filters":734,"min_dist":735,"fout":736,"generate_defect_structure":737,"savetxt":738,"bcc_self":739,"super_size":740,"num_atom":741,"chl":742,"readline":743,"latt_param":744,"000000":745,"need":746,"pos_line":747,"super_latt_param":748,"output_task1":749,"6f":750,"tetrahedral":751,"output_task2":752,"octahedral":753,"output_task3":754,"crowdion":755,"idx":756,"replace_label":757,"output_task4":758,"dumbbell":759,"output_task5":760,"output_task6":761,"total_task":762,"conf_line":763,"insert_line":764,"type_map":765,"type_map_list":766,"element_list":767,"type_num":768,"types":769,"10f":770,"close":771,"fc":772,"struct":773,"inter_e":774,"equi_e":775,"evac":776,"supercell_index":777,"set_inter_type_func":778,"set_model_param":779,"warnings":780,"inter_deepmd":781,"inter_eam_alloy":782,"inter_eam_fs":783,"inter_meam":784,"supported_inter":785,"meam":786,"eam_fs":787,"eam_alloy":788,"in_lammps":789,"auto":790,"inter_func":791,"model_name":792,"model_param":793,"param_type":794,"model_lib":795,"link_lib":796,"link_file":797,"cvt_lammps_conf":798,"etol":799,"ftol":800,"maxiter":801,"5000":802,"maxeval":803,"500000":804,"b0":805,"70":806,"bp":807,"ntypes":808,"make_lammps_equi":809,"make_lammps_press_relax":810,"make_lammps_eval":811,"in_lammps_not_link_list":812,"log_lammps":813,"dump_lammps":814,"warn":815,"box":816,"coord":817,"virial":818,"dumptime":819,"item":820,"timestep":821,"natom":822,"xlo_bound":823,"xhi_bound":824,"xy":825,"ylo_bound":826,"yhi_bound":827,"xz":828,"zlo":829,"zhi":830,"yz":831,"xx":832,"max":833,"min":834,"yy":835,"zz":836,"type_list":837,"xs":838,"ys":839,"zs":840,"a_x":841,"a_y":842,"a_z":843,"fx":844,"fy":845,"fz":846,"total":847,"wall":848,"time":849,"finished":850,"seek":851,"kk":852,"exception":853,"virials":854,"1e5":855,"30":856,"1e19":857,"6021766208":858,"stress_to_virial":859,"break":860,"_tmp":861,"debug":862,"type_map_idx":863,"d_dump":864,"frame_idx":865,"result_dict":866,"module":867,"atom_types":868,"dtype":869,"int64":870,"float64":871,"forces":872,"outlog":873,"abc":874,"abstractmethod":875,"calculator":876,"make_calculator":877,"print_file":878,"constructor":879,"configurations":880,"directory":881,"named":882,"xxxxxx":883,"important":884,"handel":885,"case":886,"when":887,"located":888,"equilibrated":889,"configuration":890,"has":891,"existing":892,"directories":893,"computational":894,"example":895,"ediffg":896,"postprocess":897,"database":898,"txt":899,"working":900,"locate":901,"task_dirs":902,"idata":903,"res":904,"ptr":905,"results":906,"dist":907,"storing":908,"printed":909,"string":910,"surface":911,"01":912,"default_max_miller":913,"max_miller":914,"generate_all_slabs":915,"slabs":916,"miller_indices":917,"tsurf_e":918,"specifies":919,"indicating":920,"initialized":921,"prepare":922,"prepares":923,"frozen":924,"should":925,"stored":926,"notes":927,"following":928,"including":929,"computation":930,"calculates":931,"strcture":932,"ediff":933,"converted":934,"xxx":935,"forward":936,"backward":937,"potcar_not_link_list":938,"vacancy":939,"ele_pot_list":940,"pos_str":941,"ele_pos_list_tmp":942,"species":943,"ele_pos_list":944,"strip":945,"isif":946,"nsw":947,"encut":948,"must":949,"given":950,"outcar":951,"kb":952,"stress_xx":953,"stress_yy":954,"stress_zz":955,"stress_xy":956,"stress_yz":957,"stress_zx":958,"oszicar":959,"xdatcar":960,"vacancygenerator":961,"tvac_e":962,"instance":963,"siesta":964,"common_equi":965,"make_equi":966,"relax_param":967,"poscars":968,"like":969,"mp":970,"packaging":971,"crys":972,"run_equi":973,"post_equi":974,"utils":975,"create_path":976,"mpdb":977,"make_submission":978,"remote":979,"decide_machine":980,"convert_mdata":981,"lammps_task_type":982,"ele_list":983,"conf_dirs":984,"extend":985,"names":986,"single":987,"crystal":988,"element_label":989,"crys_type":990,"pwd":991,"std":992,"fcc1":993,"dhcp":994,"diamond":995,"sc":996,"exit":997,"bk":998,"modify_stru_path":999,"autotest":1000,"jr":1001,"relax_dirs":1002,"consistent":1003,"task_dir":1004,"processes":1005,"work_path_list":1006,"all_task":1007,"run_tasks":1008,"something":1009,"wrong":1010,"dispatch":1011,"here":1012,"useless":1013,"virtual_calculator":1014,"logs":1015,"group_size":1016,"get_machine_info":1017,"work_path":1018,"runing":1019,"api":1020,"been":1021,"removed":1022,"upgrade":1023,"submission":1024,"mdata_machine":1025,"mdata_resources":1026,"commands":1027,"errlog":1028,"run_submission":1029,"common_prop":1030,"make_property_instance":1031,"multiprocessing":1032,"pool":1033,"make_property":1034,"run_property":1035,"worker":1036,"prop_type":1037,"property_list":1038,"post_property":1039,"screen":1040,"do_refine":1041,"suffix":1042,"eos_00":1043,"determine":1044,"scratch":1045,"inter_param_prop":1046,"overwrite_interaction":1047,"prop":1048,"same":1049,"doing":1050,"submit":1051,"job":1052,"via":1053,"multiple_ret":1054,"tmp_task_list":1055,"collect_task":1056,"apply_async":1057,"successful":1058,"jobs":1059,"gen_confs":1060,"test_fit":1061,"make_path_mp":1062,"gen_ele_std":1063,"ele_name":1064,"ctype":1065,"gen_element":1066,"gen_element_std":1067,"argparse":1068,"structure_matcher":1069,"structurematcher":1070,"ext":1071,"matproj":1072,"mprester":1073,"gen_alloy":1074,"_main":1075,"usr":1076,"bin":1077,"env":1078,"python3":1079,"global_std_crystal":1080,"fit":1081,"pf":1082,"pretty_formula":1083,"task_id":1084,"fposcar":1085,"fjson":1086,"mpr":1087,"query":1088,"elements":1089,"nelements":1090,"properties":1091,"formula":1092,"anonymous_formula":1093,"formation_energy_per_atom":1094,"energy_per_atom":1095,"eles":1096,"alloy_file":1097,"alloy":1098,"parser":1099,"argumentparser":1100,"description":1101,"structures":1102,"add_argument":1103,"help":1104,"id":1105,"material":1106,"project":1107,"nargs":1108,"appeared":1109,"args":1110,"parse_args":1111,"__main__":1112,"make_unlabeled_stru":1113,"uniq_atom_names":1114,"dpdata_poscar":1115,"a2bohr":1116,"8897261254578281":1117,"mass_dict":1118,"0079":1119,"he":1120,"0026":1121,"li":1122,"941":1123,"0122":1124,"811":1125,"12":1126,"0107":1127,"14":1128,"0067":1129,"15":1130,"9994":1131,"18":1132,"9984":1133,"ne":1134,"1797":1135,"na":1136,"9897":1137,"mg":1138,"24":1139,"305":1140,"al":1141,"26":1142,"9815":1143,"si":1144,"28":1145,"0855":1146,"9738":1147,"32":1148,"065":1149,"cl":1150,"35":1151,"453":1152,"39":1153,"0983":1154,"ar":1155,"948":1156,"ca":1157,"40":1158,"078":1159,"44":1160,"9559":1161,"ti":1162,"47":1163,"867":1164,"50":1165,"9415":1166,"cr":1167,"51":1168,"9961":1169,"mn":1170,"54":1171,"938":1172,"fe":1173,"55":1174,"845":1175,"ni":1176,"58":1177,"6934":1178,"co":1179,"9332":1180,"cu":1181,"63":1182,"546":1183,"zn":1184,"65":1185,"ga":1186,"69":1187,"723":1188,"ge":1189,"72":1190,"64":1191,"74":1192,"9216":1193,"se":1194,"78":1195,"96":1196,"br":1197,"79":1198,"904":1199,"kr":1200,"83":1201,"rb":1202,"85":1203,"4678":1204,"sr":1205,"87":1206,"62":1207,"88":1208,"9059":1209,"zr":1210,"91":1211,"224":1212,"nb":1213,"92":1214,"9064":1215,"mo":1216,"95":1217,"94":1218,"tc":1219,"98":1220,"ru":1221,"101":1222,"07":1223,"rh":1224,"102":1225,"9055":1226,"pd":1227,"106":1228,"42":1229,"ag":1230,"107":1231,"8682":1232,"cd":1233,"411":1234,"114":1235,"818":1236,"sn":1237,"118":1238,"71":1239,"sb":1240,"121":1241,"76":1242,"126":1243,"9045":1244,"te":1245,"127":1246,"xe":1247,"131":1248,"293":1249,"cs":1250,"132":1251,"ba":1252,"137":1253,"327":1254,"la":1255,"138":1256,"ce":1257,"140":1258,"116":1259,"pr":1260,"9077":1261,"nd":1262,"144":1263,"pm":1264,"145":1265,"sm":1266,"150":1267,"36":1268,"eu":1269,"151":1270,"964":1271,"gd":1272,"157":1273,"25":1274,"tb":1275,"158":1276,"9253":1277,"dy":1278,"162":1279,"ho":1280,"164":1281,"9303":1282,"er":1283,"167":1284,"259":1285,"tm":1286,"168":1287,"9342":1288,"yb":1289,"173":1290,"04":1291,"lu":1292,"174":1293,"967":1294,"hf":1295,"178":1296,"49":1297,"ta":1298,"180":1299,"9479":1300,"183":1301,"84":1302,"186":1303,"207":1304,"190":1305,"23":1306,"ir":1307,"192":1308,"217":1309,"pt":1310,"195":1311,"au":1312,"196":1313,"9665":1314,"hg":1315,"200":1316,"59":1317,"tl":1318,"204":1319,"3833":1320,"pb":1321,"bi":1322,"208":1323,"9804":1324,"po":1325,"209":1326,"210":1327,"rn":1328,"222":1329,"fr":1330,"223":1331,"ra":1332,"226":1333,"ac":1334,"227":1335,"pa":1336,"231":1337,"0359":1338,"th":1339,"232":1340,"0381":1341,"237":1342,"238":1343,"0289":1344,"am":1345,"243":1346,"pu":1347,"244":1348,"cm":1349,"247":1350,"251":1351,"es":1352,"252":1353,"fm":1354,"257":1355,"md":1356,"258":1357,"rf":1358,"261":1359,"lr":1360,"262":1361,"db":1362,"bh":1363,"264":1364,"sg":1365,"266":1366,"mt":1367,"268":1368,"rg":1369,"272":1370,"hs":1371,"277":1372,"key_words_list":1373,"atomic_species":1374,"numerical_orbital":1375,"lattice_constant":1376,"lattice_vectors":1377,"atomic_positions":1378,"numerical_descriptor":1379,"dictionary":1380,"param":1381,"some":1382,"words":1383,"atom_masses":1384,"masses":1385,"usally":1386,"rotated":1387,"triangular":1388,"rstrip":1389,"to_system_data":1390,"atom_mass":1391,"pseudo":1392,"orb":1393,"atom_mass_dict":1394,"mass":1395,"stru_string":1396,"pp_file":1397,"struf":1398,"stru_in":1399,"stru_out":1400,"kptf":1401,"kptlist":1402,"inputf":1403,"inputdict":1404,"check_finished":1405,"fname":1406,"check_stru_fixed":1407,"cartesian":1408,"magnetic":1409,"move_x":1410,"move_y":1411,"move_z":1412,"f1":1413,"flag_read_coord_type":1414,"flag_read_atom_number":1415,"flag_atom_number":1416,"writelines":1417,"struc":1418,"context":1419,"n0":1420,"ngamma":1421,"input_parameters":1422,"values":1423,"bohr2ang":1424,"dot":1425,"coef":1426,"pi":1427,"ixy":1428,"abacus_path":1429,"fixed":1430,"out_stru":1431,"bool":1432,"logf":1433,"running_":1434,"stru_ion_d":1435,"final":1436,"stru_ion":1437,"_d":1438,"v3":1439,"stru_ion0_d":1440,"stru_ion1_d":1441,"stru_ion10_d":1442,"last":1443,"stru_ions":1444,"lambda":1445,"final_stru_ion":1446,"27":1447,"step":1448,"molecular":1449,"max_step":1450,"stru_md_":1451,"unrecognized":1452,"block":1453,"strucf":1454,"tpath":1455,"file_numb":1456,"ppfile":1457,"tmp_line":1458,"ele":1459,"05":1460,"551340126037118":1461,"2144871302356037":1462,"sqrt":1463,"latt":1464,"12500000000000":1465,"87500000000000":1466,"ofmt":1467,"apply_type_map":1468,"conf_file":1469,"deepmd_type_map":1470,"_get_ntype":1471,"_get_conf_natom":1472,"periodic_table":1473,"convert":1474,"imcomplete":1475,"situation":1476,"supp_ofmt":1477,"supp_exts":1478,"d_poscar":1479,"to_lammps_lmp":1480,"to_vasp_poscar":1481,"apply":1482,"new_lines":1483,"idx_ntypes":1484,"entry":1485,"idx_atom_entry":1486,"old_id":1487,"new_id":1488,"indicate":1489,"08":1490,"eam":1491,"fs":1492,"make_lammps_elastic":1493,"pair_style":1494,"model_list":1495,"out_freq":1496,"out_file":1497,"pair_coeff":1498,"type_map_reverse":1499,"items":1500,"tmp_list":1501,"calcualtion":1502,"clear":1503,"units":1504,"metal":1505,"dimension":1506,"boundary":1507,"atom_style":1508,"atomic":1509,"tilt":1510,"large":1511,"read_data":1512,"neigh_modify":1513,"check":1514,"mype":1515,"pe":1516,"thermo":1517,"thermo_style":1518,"custom":1519,"pxx":1520,"pyy":1521,"pzz":1522,"pxy":1523,"pxz":1524,"pyz":1525,"lx":1526,"ly":1527,"lz":1528,"c_mype":1529,"09":1530,"give":1531,"run":1532,"tmplx":1533,"tmply":1534,"done":1535,"per":1536,"area":1537,"change_box":1538,"make_lammps_phonon":1539,"equilibritation":1540,"iso":1541,"minimize":1542,"aniso":1543,"tri":1544,"_get_epa":1545,"_get_vpa":1546,"_get_natoms":1547,"certain":1548,"respect":1549,"equilibrium":1550,"gpa2bar":1551,"yeta":1552,"px0":1553,"exp":1554,"px":1555,"press":1556,"bar":1557,"get_nev":1558,"get_base_area":1559,"get_stress":1560,"poscar_from_last_dump":1561,"poscar_out":1562,"check_finished_new":1563,"keyword":1564,"volume_per_atom":1565,"vstress":1566,"voigt_to_stress":1567,"frame":1568,"traj":1569,"step_idx":1570,"tmp_dump":1571,"flag":1572,"_get_block":1573,"lmpbox2box":1574,"lohi":1575,"box2lmpbox":1576,"get_atoms":1577,"get_natoms":1578,"get_natomtypes":1579,"_atom_info_mol":1580,"_atom_info_atom":1581,"get_natoms_vec":1582,"get_atype":1583,"get_posi":1584,"get_lmpbox":1585,"system_data":1586,"from_system_data":1587,"idx_s":1588,"lens":1589,"dd":1590,"zeros":1591,"vec":1592,"mole_type":1593,"atom_type":1594,"charge":1595,"atype":1596,"natoms_vec":1597,"natomtypes":1598,"alines":1599,"atom_lines":1600,"posis":1601,"box_info":1602,"xlo":1603,"xhi":1604,"ylo":1605,"yhi":1606,"type_":1607,"coordinates":1608,"water":1609,"spce":1610,"bonds":1611,"bonds1":1612,"tilt1":1613,"mfp_eosfit":1614,"get_eos_list_4p":1615,"get_eos_list_5p":1616,"get_eos_list_6p":1617,"get_eos_list_3p":1618,"get_eos_list":1619,"res_murnaghan":1620,"pars":1621,"murnaghan":1622,"res_birch":1623,"birch":1624,"res_mbm4":1625,"calc_props_mbm4":1626,"plt":1627,"scipy":1628,"interpolate":1629,"bpoly":1630,"lsqunivariatespline":1631,"univariatespline":1632,"interp1d":1633,"optimize":1634,"mbm4":1635,"res_mbm5":1636,"mbm5":1637,"matplotlib":1638,"pyplot":1639,"fsolve":1640,"leastsq":1641,"3806488e":1642,"kb_ev":1643,"6173324e":1644,"62606957e":1645,"34":1646,"h_ev":1647,"135667516e":1648,"hb":1649,"054571726e":1650,"hb_ev":1651,"58211928e":1652,"mu":1653,"660538921e":1654,"kg":1655,"me":1656,"1093821545e":1657,"31":1658,"02214129e23":1659,"mol":1660,"ev2gpa":1661,"602176565e2":1662,"ev2mol":1663,"648455461e4":1664,"eos_list_4p":1665,"bm4":1666,"mbm4poly":1667,"rbm4":1668,"rpt4":1669,"log4":1670,"vinet":1671,"li4p":1672,"universal":1673,"morse":1674,"morse_ab":1675,"mie":1676,"mie_simple":1677,"sjx_v2":1678,"eos_list_5p":1679,"bm5":1680,"rbm5":1681,"mbm5poly":1682,"rpt5":1683,"log5":1684,"teos":1685,"sjx_5p":1686,"eos_list_6p":1687,"morse_6p":1688,"eos_list_3p":1689,"morse_3p":1690,"list_all":1691,"four":1692,"prb":1693,"5480":1694,"1983":1695,"e0":1696,"v0":1697,"ee":1698,"intermetallic":1699,"compounds":1700,"principles":1701,"practice":1702,"princples":1703,"chapter":1704,"pages":1705,"mehl":1706,"klein":1707,"papaconstantopoulos":1708,"paper":1709,"downloaded":1710,"web":1711,"bpp":1712,"45":1713,"props":1714,"res_mbm4poly":1715,"calc_v0_mbm4poly":1716,"calc_props_mbm4poly":1717,"res_mbm5poly":1718,"calc_v0_mbm5poly":1719,"calc_props_mbm5poly":1720,"equation":1721,"224107":1722,"order":1723,"bm":1724,"11":1725,"mbm":1726,"vv":1727,"power":1728,"modified":1729,"shang":1730,"sl":1731,"comput":1732,"mater":1733,"sci":1734,"2010":1735,"1040":1736,"1048":1737,"b2p":1738,"shunli":1739,"matlab":1740,"scripts":1741,"122":1742,"57":1743,"48":1744,"retype":1745,"according":1746,"article":1747,"original":1748,"expressions":1749,"res_bm4":1750,"calc_props_bm4":1751,"res_bm5":1752,"res_rbm4":1753,"rbm4_pv":1754,"guess":1755,"vtest":1756,"linspace":1757,"etest":1758,"vg":1759,"argmin":1760,"sol":1761,"root":1762,"dedv":1763,"dedv2":1764,"dedv3":1765,"80":1766,"280":1767,"dedv4":1768,"81":1769,"880":1770,"3640":1771,"dbdv":1772,"dpdv":1773,"dbdv2":1774,"dpdv2":1775,"143":1776,"eta":1777,"b0p":1778,"b0pp":1779,"t1":1780,"t2":1781,"t3":1782,"t4":1783,"t5":1784,"res_rbm4_pv":1785,"res_rbm5":1786,"rbm5_pv":1787,"res_rbm5_pv":1788,"res_universal":1789,"res_log4":1790,"calc_props_log4":1791,"res_rpt4":1792,"implementions":1793,"alberto":1794,"otero":1795,"de":1796,"roza":1797,"used":1798,"comm":1799,"2011":1800,"182":1801,"1708":1802,"1720":1803,"relations":1804,"state":1805,"phys":1806,"condens":1807,"matter":1808,"p1941":1809,"1989":1810,"t6":1811,"natrual":1812,"poirier":1813,"tarantola":1814,"paramters":1815,"seems":1816,"work":1817,"near":1818,"equillibrium":1819,"follows":1820,"rpt4_pv":1821,"res_rpt4_pv":1822,"res_log5":1823,"res_rpt5":1824,"rpt5_pv":1825,"res_rpt5_pv":1826,"res_vinet":1827,"labeled":1828,"pt3":1829,"however":1830,"mention":1831,"fn":1832,"t7":1833,"calc_props_vinet":1834,"vinet_pv":1835,"res_vinet_pv":1836,"res_li4p":1837,"calc_props_morse":1838,"res_morse":1839,"en":1840,"res_morse_ab":1841,"19":1842,"jh":1843,"apl":1844,"194111":1845,"2005":1846,"fact":1847,"just":1848,"small":1849,"rose":1850,"astar":1851,"delta":1852,"shunlishang":1853,"script":1854,"usually":1855,"high":1856,"pressure":1857,"maybe":1858,"failed":1859,"expansion":1860,"res_morse_3p":1861,"par":1862,"calc_props_morse_6p":1863,"res_morse_6p":1864,"res_mie":1865,"res_mie_simple":1866,"res_teos":1867,"res_sjx_v2":1868,"song":1869,"fvt":1870,"souces":1871,"p0":1872,"generalized":1873,"proposed":1874,"qin":1875,"see":1876,"rev":1877,"2008":1878,"214108":1879,"77":1880,"220103":1881,"holland":1882,"journal":1883,"metamorphic":1884,"geology":1885,"29":1886,"333":1887,"383":1888,"tait":1889,"huang":1890,"chow":1891,"relation":1892,"nonsenses":1893,"res_sjx_5p":1894,"calc_props_sjx_5p":1895,"read_ve":1896,"read_vlp":1897,"read_velp":1898,"init_guess":1899,"sun":1900,"jiuxun":1901,"chem":1902,"solids":1903,"66":1904,"773":1905,"782":1906,"said":1907,"satified":1908,"limiting":1909,"alpha":1910,"beta":1911,"60":1912,"five":1913,"physica":1914,"406":1915,"1276":1916,"1282":1917,"c1":1918,"c2":1919,"utility":1920,"functions":1921,"could":1922,"sys":1923,"nline":1924,"ve":1925,"dat":1926,"two":1927,"numbers":1928,"fstart":1929,"fend":1930,"repro_ve":1931,"totally":1932,"points":1933,"reading":1934,"cella":1935,"cellb":1936,"cellc":1937,"cellba":1938,"cellca":1939,"vlp":1940,"velp":1941,"vmin":1942,"vmax":1943,"special":1944,"conditions":1945,"positive":1946,"eosfit":1947,"exceed":1948,"available":1949,"reset":1950,"predefined":1951,"func":1952,"vol_i":1953,"repro_vp":1954,"ext_vec":1955,"ext_splint":1956,"ext_velp":1957,"eng":1958,"polyfit":1959,"comes":1960,"pylab":1961,"guesses":1962,"x0":1963,"ndata":1964,"eni":1965,"eval":1966,"dv":1967,"efunc":1968,"vols":1969,"vole":1970,"refit":1971,"show_fig":1972,"xp":1973,"yp":1974,"unispl":1975,"lsqfit_eos":1976,"parse_argument":1977,"extrapolate":1978,"fitted":1979,"very":1980,"loadtxt":1981,"sca":1982,"vext_start":1983,"vext_end":1984,"n_ext":1985,"vol_ext":1986,"en_ext":1987,"ext_ve_":1988,"fw":1989,"vx":1990,"ex":1991,"cax":1992,"flush":1993,"plot":1994,"rd":1995,"legend":1996,"dft_calc":1997,"_ext":1998,"loc":1999,"best":2000,"savefig":2001,"png":2002,"old":2003,"implement":2004,"interpolation":2005,"splint":2006,"bounds_error":2007,"piecepoly":2008,"from_derivatives":2009,"smoothing":2010,"spline":2011,"better":2012,"sa":2013,"cellaa":2014,"cellbb":2015,"cellcc":2016,"sba":2017,"cellbaba":2018,"cellcaca":2019,"cellca_cal":2020,"nfigure":2021,"lp_ext":2022,"lp_ori":2023,"lp_ylabel":2024,"c_ext":2025,"a_ext":2026,"subplot":2027,"ylabel":2028,"ori":2029,"xlabel":2030,"save":2031,"vba":2032,"12s":2033,"cext":2034,"aext":2035,"using":2036,"relationship":2037,"start":2038,"fitting":2039,"integer":2040,"polynomial":2041,"included":2042,"f_end":2043,"f_start":2044,"attentions":2045,"num":2046,"popt":2047,"pcov":2048,"infodict":2049,"mesg":2050,"ier":2051,"res_":2052,"full_output":2053,"maxfev":2054,"400":2055,"nfev":2056,"fvec":2057,"psi_i":2058,"psi_min":2059,"pfactor":2060,"wi":2061,"pfi":2062,"optimal":2063,"iterations":2064,"12f":2065,"prop_func":2066,"calc_props_":2067,"evaluate":2068,"en_i":2069,"calculate":2070,"residuals":2071,"square":2072,"errors":2073,"res_opt":2074,"fit_res":2075,"fit_var":2076,"var":2077,"fit_std":2078,"nfitted":2079,"16e":2080,"variations":2081,"deviations":2082,"too":2083,"swithing":2084,"tag":2085,"figure":2086,"title":2087,"calc":2088,"eosfit_":2089,"repro_en":2090,"repro_press":2091,"fve":2092,"_ve_fit":2093,"fvp":2094,"_vp_fit":2095,"20s":2096,"cal":2097,"mbar":2098,"kbar":2099,"20f":2100,"p_tmp":2101,"mtp":2102,"calculations":2103,"choice":2104,"mfp":2105,"infile":2106,"choose":2107,"vr":2108,"vrange":2109,"frange":2110,"ns":2111,"eord":2112,"extorder":2113,"enum":2114,"extnum":2115,"action":2116,"prog":2117,"main":2118,"cho":2119,"eos_list":2120,"extvs":2121,"extve":2122,"eorder":2123,"abort":2124,"pwscf":2125,"_make_pwscf_01_runctrl":2126,"sys_data":2127,"ecut":2128,"smearing":2129,"degauss":2130,"_make_pwscf_02_species":2131,"pps":2132,"_make_pwscf_03_config":2133,"_kshift":2134,"nkpt":2135,"_make_pwscf_04_kpoints":2136,"_make_smearing":2137,"make_pwscf_input":2138,"system_from_poscar":2139,"tot_natoms":2140,"restart_mode":2141,"from_scratch":2142,"pseudo_dir":2143,"outdir":2144,"tprnfor":2145,"tstress":2146,"disk_io":2147,"ibrav":2148,"nat":2149,"ntyp":2150,"vdw_corr":2151,"ts":2152,"ecutwfc":2153,"ts_vdw_econv_thr":2154,"nosym":2155,"electrons":2156,"conv_thr":2157,"reshape":2158,"cell_parameters":2159,"angstrom":2160,"cc":2161,"rcell":2162,"inv":2163,"ceil":2164,"astype":2165,"automatic":2166,"fp_params":2167,"fp_pp_files":2168,"sigma":2169,"gauss":2170,"fd":2171,"unknow":2172,"pp":2173,"c_hscv_pbe":2174,"upf":2175,"h_hscv_pbe":2176,"n_hscv_pbe":2177,"_make_siesta_01_common":2178,"mixingweight":2179,"numberpulay":2180,"_make_siesta_02_species":2181,"_make_siesta_03_kpoint":2182,"_make_siesta_04_ucvectorcoord":2183,"make_siesta_input":2184,"systemname":2185,"systemlabel":2186,"numberofatoms":2187,"nnumberofspecies":2188,"writeforces":2189,"writecoorstep":2190,"writecoorxmol":2191,"writemdxmol":2192,"writemdhistory":2193,"meshcutoff":2194,"ry":2195,"dm":2196,"tolerance":2197,"usesavedm":2198,"usesavexv":2199,"xc":2200,"functional":2201,"gga":2202,"authors":2203,"pbe":2204,"writedm":2205,"netcdf":2206,"writedmhs":2207,"atom_nums":2208,"chemical_species_label":2209,"endblock":2210,"understand":2211,"矩阵求逆":2212,"矩阵转置":2213,"是向上取整":2214,"与四舍五入无关":2215,"进行范数运算":2216,"范数是对向量":2217,"或者矩阵":2218,"的度量":2219,"是一个标量":2220,"scalar":2221,"kgrid_monkhorst_pack":2222,"t0":2223,"coordinate":2224,"try_input_output":2225,"ang":2226,"latticevectors":2227,"atomiccoordinatesformat":2228,"atomiccoordinatesandatomicspecies":2229,"inpt":2230,"insert_data":2231,"username":2232,"file_name":2233,"make_work_path":2234,"jdata":2235,"reprod_opt":2236,"requests":2237,"cmd_append_log":2238,"revised":2239,"surf":2240,"url":2241,"http":2242,"115":2243,"161":2244,"insert_test_data":2245,"expr_type":2246,"data_type":2247,"post":2248,"upload":2249,"conf_path":2250,"task_path":2251,"user_incar":2252,"scf_incar":2253,"vasp_params":2254,"relax_incar":2255,"vasp_exec":2256,"fp_command":2257,"fp_group_size":2258,"fp_resources":2259,"fp_machine":2260,"model_devi_exec":2261,"model_devi_command":2262,"model_devi_group_size":2263,"model_devi_resources":2264,"model_devi_machine":2265,"running_relax":2266,"run_tasks_":2267,"fres":2268,"make_iter_name":2269,"iter_index":2270,"pattern":2271,"subst":2272,"copy_file_list":2273,"file_list":2274,"from_path":2275,"to_path":2276,"cmd":2277,"log_file":2278,"log_iter":2279,"repeat_to_length":2280,"string_to_expand":2281,"length":2282,"log_task":2283,"record_iter":2284,"iter_format":2285,"task_format":2286,"log_iter_head":2287,"process":2288,"counter":2289,"bk_dirname":2290,"move":2291,"file_handel":2292,"file_string":2293,"copytree":2294,"header":2295,"frec":2296,"outcaritemerror":2297,"poscar_in":2298,"new_names":2299,"pert":2300,"reciprocal_box":2301,"get_energies":2302,"get_boxes":2303,"get_poscar":2304,"lmp_dump":2305,"dump_file":2306,"counts":2307,"uniq_name":2308,"uniq_count":2309,"nn":2310,"zip":2311,"all_lines":2312,"ele_lines":2313,"new_counts":2314,"az":2315,"rbox":2316,"matmul":2317,"_get_energies":2318,"_split_box_line":2319,"_get_boxes":2320,"_get_volumes":2321,"_get_stress":2322,"_compute_isif":2323,"ks":2324,"make_vasp_kpoints":2325,"incomplete":2326,"ener":2327,"elapsed":2328,"sec":2329,"ipt":2330,"ions":2331,"free":2332,"toten":2333,"tmp_box":2334,"relax_ions":2335,"relax_volume":2336,"make_vasp_static_incar":2337,"npar":2338,"kpar":2339,"ismear":2340,"make_vasp_relax_incar":2341,"relax_ion":2342,"make_vasp_phonon_incar":2343,"get_poscar_natoms":2344,"sv":2345,"valueerror":2346,"style":2347,"prec":2348,"isym":2349,"algo":2350,"normal":2351,"lreal":2352,"istart":2353,"icharg":2354,"nelmin":2355,"ibrion":2356,"lwave":2357,"lcharg":2358,"pstress":2359,"nelm":2360,"_poscar_natoms":2361,"_poscar_scale_direct":2362,"str_in":2363,"_poscar_scale_cartesian":2364,"_make_vasp_kp_gamma":2365,"_make_vasp_kp_mp":2366,"numb_atoms":2367,"pscale":2368,"boxl":2369,"boxv":2370,"cv":2371,"make_vasp_kpoints_from_incar":2372,"work_dir":2373,"mesh":2374,"monkhorst":2375,"pack":2376,"fp_aniso_kspacing":2377,"standard_incar":2378,"check_apikey":2379,"mp_id":2380,"mpresterror":2381,"materials":2382,"org":2383,"apikey":2384,"environ":2385,"mapi_key":2386,"have":2387,"execute":2388,"echo":2389,"export":2390,"yourkey":2391,"bashrc":2392,"source":2393,"_exit":2394,"manually":2395,"get_structure_by_material_id":2396,"init_from":2397,"does":2398,"exist":2399,"init_from_task_tot":2400,"believe":2401,"init_poscar":2402,"init_data_path_list":2403,"label":2404,"init_data_path_todo":2405,"init_data_task_todo":2406,"previous":2407,"fout_element":2408,"fin_element":2409,"nframe":2410,"insert_element":2411,"dir":2412,"initial_path":2413,"init_e":2414,"reprod_e":2415,"difference":2416,"init_ener_tot":2417,"output_ener_tot":2418,"init_task_result":2419,"init_ener":2420,"output_ener":2421,"output_task_result":2422,"output_epa":2423,"init_epa":2424,"error_start":2425,"diff":2426,"nframes":2427,"init":2428,"lmp_ener_tot":2429,"vasp_ener_tot":2430,"run_task":2431,"param_file":2432,"machine_file":2433,"gen_test":2434,"supply":2435,"testing":2436,"collect":2437,"collect_data":2438,"target_folder":2439,"verbose":2440,"shuffle":2441,"merge":2442,"data_system_fmt":2443,"expand_sys_str":2444,"gen_collect":2445,"goto":2446,"sys_configs_prefix":2447,"sys_configs":2448,"max_str_len":2449,"max_form_len":2450,"ptr_fmt":2451,"ds":2452,"6d":2453,"init_data":2454,"init_data_prefix":2455,"init_data_sys":2456,"npy":2457,"iter":2458,"dirs":2459,"coll_data":2460,"numb_sys":2461,"model_devi_jobs":2462,"numb_jobs":2463,"iters":2464,"loop":2465,"over":2466,"iter_data":2467,"02":2468,"sys_str":2469,"get_nframes":2470,"create":2471,"out_dir":2472,"set_size":2473,"job_dir":2474,"provides":2475,"store_true":2476,"chemical":2477,"init_bulk_mdata_arginfo":2478,"init_surf_mdata_arginfo":2479,"init_reaction_mdata_arginfo":2480,"init_bulk_vasp_args":2481,"init_bulk_abacus_args":2482,"init_bulk_variant_type_args":2483,"variant":2484,"init_bulk_jdata_arginfo":2485,"init_surf_jdata_arginfo":2486,"init_reaction_jdata_arginfo":2487,"init_bulk":2488,"init_bulk_mdata":2489,"init_surf":2490,"init_surf_mdata":2491,"init_reaction":2492,"init_reaction_mdata":2493,"reaxff":2494,"build":2495,"doc_relax_kpt":2496,"stage":2497,"useful":2498,"init_fp_style":2499,"doc_md_kpt":2500,"simulations":2501,"doc_atom_masses":2502,"relax_kpt":2503,"md_kpt":2504,"doc_init_fp_style":2505,"principle":2506,"software":2507,"absent":2508,"more":2509,"added":2510,"default_tag":2511,"doc_init_bulk":2512,"doc_stages":2513,"stages":2514,"doc_elements":2515,"doc_potcars":2516,"doc_cell_type":2517,"specifying":2518,"typical":2519,"options":2520,"include":2521,"doc_super_cell":2522,"doc_from_poscar":2523,"deciding":2524,"whether":2525,"beginning":2526,"cell_type":2527,"aborted":2528,"otherwise":2529,"necessary":2530,"doc_from_poscar_path":2531,"from_poscar":2532,"doc_relax_incar":2533,"doc_md_incar":2534,"doc_scale":2535,"scales":2536,"isotropic":2537,"transforming":2538,"doc_skip_relax":2539,"may":2540,"directly":2541,"perturb":2542,"unrelaxed":2543,"doc_pert_numb":2544,"perturbations":2545,"scaled":2546,"doc_pert_box":2547,"anisotropic":2548,"perturbation":2549,"independent":2550,"changes":2551,"lengths":2552,"well":2553,"angel":2554,"among":2555,"decimal":2556,"formats":2557,"3x3":2558,"matrix":2559,"randomly":2560,"sampled":2561,"uniform":2562,"distribution":2563,"pert_box":2564,"adds":2565,"identity":2566,"gives":2567,"actual":2568,"transformation":2569,"operation":2570,"doc_pert_atom":2571,"random":2572,"performed":2573,"adding":2574,"pert_atom":2575,"doc_md_nstep":2576,"steps":2577,"aimd":2578,"settings":2579,"md_incar":2580,"follow":2581,"doc_coll_ndata":2582,"maximal":2583,"collected":2584,"doc_type_map":2585,"init_bulk_jdata":2586,"super_cell":2587,"from_poscar_path":2588,"skip_relax":2589,"pert_numb":2590,"md_nstep":2591,"coll_ndata":2592,"sub_variants":2593,"doc_init_surf":2594,"doc_latt":2595,"constant":2596,"doc_layer_numb":2597,"layers":2598,"constructing":2599,"doc_z_min":2600,"thickness":2601,"without":2602,"layer_numb":2603,"z_min":2604,"ignored":2605,"doc_vacuum_max":2606,"doc_vacuum_min":2607,"minimal":2608,"times":2609,"radius":2610,"doc_vacuum_resol":2611,"interval":2612,"vacuum_resol":2613,"mid_point":2614,"doc_vacuum_numb":2615,"empty":2616,"doc_mid_point":2617,"mid":2618,"separating":2619,"head":2620,"region":2621,"tail":2622,"doc_head_ratio":2623,"nearby":2624,"denser":2625,"intervals":2626,"doc_millers":2627,"init_surf_jdata":2628,"vacuum_max":2629,"vacuum_min":2630,"vacuum_numb":2631,"head_ratio":2632,"millers":2633,"doc_init_reaction":2634,"reactive":2635,"gas":2636,"phase":2637,"molecules":2638,"nvt":2639,"trajectory":2640,"doc_reaxff":2641,"doc_data":2642,"doc_ff":2643,"field":2644,"potentials":2645,"doc_control":2646,"doc_temp":2647,"target":2648,"temperature":2649,"simulation":2650,"doc_dt":2651,"real":2652,"doc_tau_t":2653,"how":2654,"rapidly":2655,"doc_dump_frep":2656,"frequency":2657,"doc_nstep":2658,"doc_cutoff":2659,"cutoff":2660,"take":2661,"clusters":2662,"note":2663,"complete":2664,"molecule":2665,"radical":2666,"taken":2667,"doc_dataset_size":2668,"dataset":2669,"bond":2670,"doc_qmkeywords":2671,"gaussian":2672,"keywords":2673,"mn15":2674,"31g":2675,"geom":2676,"printinputorient":2677,"than":2678,"cluster":2679,"init_reaction_jdata":2680,"ff":2681,"dt":2682,"tau_t":2683,"dump_freq":2684,"nstep":2685,"dataset_size":2686,"qmkeywords":2687,"back":2688,"out_dir_name":2689,"class_cell_type":2690,"sp":2691,"poscar_ele":2692,"stru_ele":2693,"subprocess":2694,"tools":2695,"make_abacus_scf_kpt":2696,"make_abacus_scf_stru":2697,"make_supercell_abacus":2698,"check_api_version":2699,"symlink_user_forward_files":2700,"load_file":2701,"place":2702,"global_dirname_02":2703,"place_ele":2704,"global_dirname_03":2705,"scale_pert":2706,"global_dirname_04":2707,"poscar_name":2708,"cell_str":2709,"02d":2710,"ele_str":2711,"ct":2712,"supercell_stru":2713,"path_work":2714,"poscar_shuffle":2715,"shuffle_stru_data":2716,"poscar_scale_direct":2717,"poscar_scale_cartesian":2718,"ele_line":2719,"natom_line":2720,"iele":2721,"pp_file_names":2722,"orb_file_names":2723,"dpks_descriptor_name":2724,"stru_text":2725,"absolute_pp_file_path":2726,"absolute_orb_file_path":2727,"absolute_dpks_descriptor_path":2728,"ipp":2729,"out_lines":2730,"poscar_scale_abacus":2731,"make_unit_cell":2732,"make_unit_cell_abacus":2733,"make_super_cell":2734,"make_super_cell_abacus":2735,"atom_numb":2736,"new_coord":2737,"path_uc":2738,"poscar_unit":2739,"make_super_cell_poscar":2740,"make_super_cell_stru":2741,"make_combines":2742,"squeeze":2743,"path_sc":2744,"to_file":2745,"minor":2746,"bug":2747,"behind":2748,"from_struct":2749,"place_element":2750,"copied":2751,"copy2":2752,"natoms_str":2753,"natoms_list":2754,"comb_name":2755,"04d":2756,"fileexistserror":2757,"dim":2758,"place_element_abacus":2759,"make_vasp_relax":2760,"rest":2761,"tmp_combines":2762,"make_abacus_relax":2763,"make_scale":2764,"cumprod":2765,"path_pe":2766,"combines":2767,"any":2768,"path_pos_in":2769,"pos_in":2770,"pos_out":2771,"make_scale_abacus":2772,"pert_scaled":2773,"out_potcar":2774,"outfile":2775,"sys_list":2776,"ln_src":2777,"is_cvasp":2778,"cvasp":2779,"cvasp_file":2780,"strings":2781,"gamma_only":2782,"relax_kpt_path":2783,"gamma_param":2784,"ret_kpt":2785,"dpks_model":2786,"dpks_model_absolute_path":2787,"dpks_model_name":2788,"kpt_src":2789,"ksmd_src":2790,"extract":2791,"make_vasp_md":2792,"make_abacus_md":2793,"coll_vasp_md":2794,"init_path":2795,"init_sys":2796,"pos_src":2797,"scale_path":2798,"abacus_final_stru":2799,"nabacus":2800,"current":2801,"path_sp":2802,"sys_pe":2803,"construct":2804,"fp_style":2805,"python_exec":2806,"__file__":2807,"create_random_disturb":2808,"pert_cmd":2809,"executable":2810,"etmax":2811,"dev":2812,"check_call":2813,"shell":2814,"dir_out":2815,"handle":2816,"unperturbed":2817,"_vasp_check_fin":2818,"run_vasp_relax":2819,"path_ps":2820,"sys_ps":2821,"path_md":2822,"path_pos":2823,"init_pos":2824,"file_incar":2825,"file_potcar":2826,"md_kpt_path":2827,"orb_file_abspath":2828,"dpks_descriptor_abspath":2829,"dpks_model_abspath":2830,"iorb":2831,"orb_file":2832,"file_kpt":2833,"coll_abacus_md":2834,"run_abacus_relax":2835,"sys_md":2836,"outcars":2837,"valid_outcars":2838,"nforce":2839,"arg_cvt":2840,"valid":2841,"your":2842,"correctly":2843,"oo":2844,"_sys":2845,"all_sys":2846,"sub_system":2847,"to_deepmd_raw":2848,"to_deepmd_npy":2849,"content":2850,"elapse":2851,"run_vasp_md":2852,"machine_type":2853,"user_forward_files":2854,"_user_forward_files":2855,"_user_backward_files":2856,"relax_tasks":2857,"relax_run_tasks":2858,"run_abacus_md":2859,"running_md":2860,"final_etot_is":2861,"completed":2862,"normally":2863,"gen_init_bulk":2864,"md_tasks":2865,"md_run_tasks":2866,"md_work_dir":2867,"selecting":2868,"proper":2869,"disp":2870,"make_dispatcher":2871,"decide":2872,"verify":2873,"md_nstep_jdata":2874,"nsw_flag":2875,"nsw_steps":2876,"up":2877,"correct":2878,"temp_elements":2879,"iteration":2880,"stage_list":2881,"short":2882,"generating":2883,"yaml":2884,"reaction":2885,"link_reaxff":2886,"make_lmp":2887,"run_reaxff":2888,"reaxff_log":2889,"make_submission_compat":2890,"link_trj":2891,"run_build_dataset":2892,"link_fp_input":2893,"mddatasetbuilder":2894,"03":2895,"make_fp_task_name":2896,"normalize":2897,"reaxff_path":2898,"build_path":2899,"fp_path":2900,"data_path":2901,"trj_path":2902,"lammpstrj":2903,"ff_path":2904,"ffield":2905,"reax":2906,"data_init_path":2907,"control_path":2908,"lmp_control":2909,"lmp_path":2910,"dataset_name":2911,"dpgen_init":2912,"000":2913,"rdata":2914,"lmp_string":2915,"velocity":2916,"rand":2917,"qeq":2918,"0e":2919,"randrange":2920,"1000000":2921,"reaxff_command":2922,"reaxff_machine":2923,"reaxff_resources":2924,"build_log":2925,"run_fp":2926,"convert_data":2927,"gen_init_reaction":2928,"compatible":2929,"dpdispatcher":2930,"build_ntasks":2931,"build_resources":2932,"cpu_per_node":2933,"fp_ntasks":2934,"build_command":2935,"nprocjob":2936,"nproc":2937,"build_machine":2938,"dataset_":2939,"_gjf":2940,"all_input_file":2941,"gjf":2942,"dst_path":2943,"fp_tasks":2944,"fp_run_tasks":2945,"multisystems":2946,"avaiable":2947,"jdata_arginfo":2948,"iter_rec":2949,"numb_task":2950,"general_surface":2951,"pmg":2952,"super":2953,"1a":2954,"3a":2955,"max_layer_numb":2956,"poscar_elong":2957,"elong":2958,"shift_center":2959,"make_super_cell_pymatgen":2960,"works":2961,"sboxz":2962,"boxz":2963,"boxzl":2964,"elong_ratio":2965,"poscar_str":2966,"st":2967,"cart_coords":2968,"z_mean":2969,"mean":2970,"z_shift":2971,"nst":2972,"coords_are_cartesian":2973,"atomic_radius":2974,"all_millers":2975,"user_layer_numb":2976,"path_cur_surf":2977,"required":2978,"get_slabs":2979,"termination":2980,"vasp5":2981,"surf_list":2982,"path_surf":2983,"gen_init_surf":2984,"get_string":2985,"get_str":2986,"elongs":2987,"head_elongs":2988,"tolist":2989,"tail_elongs":2990,"unique":2991,"vacuum_num":2992,"vacum_max":2993,"separates":2994,"far":2995,"away":2996,"sparser":2997,"head_numb":2998,"tail_numb":2999,"path_scale":3000,"ll":3001,"path_elong":3002,"gen_box":3003,"eye":3004,"16f":3005,"cessp2force_lin":3006,"get_outcar_files":3007,"recursive":3008,"walk":3009,"recursively":3010,"uniq":3011,"seq":3012,"changing":3013,"stackoverflow":3014,"com":3015,"questions":3016,"480214":3017,"gzip":3018,"scan_outcar_file":3019,"process_outcar_file_v5_dev":3020,"python2":3021,"vasp2force":3022,"potfit":3023,"2014":3024,"institute":3025,"theoretical":3026,"applied":3027,"university":3028,"stuttgart":3029,"70550":3030,"germany":3031,"sourceforge":3032,"net":3033,"part":3034,"redistribute":3035,"under":3036,"terms":3037,"gnu":3038,"public":3039,"license":3040,"published":3041,"foundation":3042,"either":3043,"option":3044,"distributed":3045,"hope":3046,"warranty":3047,"even":3048,"implied":3049,"merchantability":3050,"fitness":3051,"particular":3052,"purpose":3053,"details":3054,"received":3055,"www":3056,"licenses":3057,"stderr":3058,"searching":3059,"listdir":3060,"startswith":3061,"subfolders":3062,"seen":3063,"seen_add":3064,"file_handle":3065,"scans":3066,"configs":3067,"vrhfin":3068,"max_types":3069,"windex":3070,"endswith":3071,"gz":3072,"writing":3073,"nconfs":3074,"box_x":3075,"box_y":3076,"box_z":3077,"atom_data":3078,"appears":3079,"electronic":3080,"config":3081,"8f":3082,"weight":3083,"7g":3084,"adata":3085,"basis":3086,"1602":3087,"ion":3088,"converts":3089,"nyi":3090,"scan":3091,"configs_range":3092,"plain":3093,"gzipped":3094,"sane":3095,"arguments":3096,"needs":3097,"duplicate":3098,"entries":3099,"table":3100,"metadata":3101,"nerror":3102,"many":3103,"enough":3104,"missing":3105,"extra":3106,"sign":3107,"invalid":3108,"sr0":3109,"sr1":3110,"test":3111,"create_disturbs_atomsk":3112,"nfile":3113,"dmax":3114,"removing":3115,"random_range":3116,"gen_random_disturb":3117,"dstyle":3118,"create_disturbs_ase":3119,"write_d":3120,"gen_random_emat":3121,"io_lammps":3122,"create_disturbs_ase_dev":3123,"create_disturbs_abacus_dev":3124,"create_random_alloys":3125,"flist":3126,"our":3127,"tests":3128,"always":3129,"creates":3130,"disturb":3131,"atomsk":3132,"wrap":3133,"ow":3134,"d0":3135,"dnorm":3136,"standard_normal":3137,"wanna":3138,"dr":3139,"get_global_number_of_atoms":3140,"pos0":3141,"get_positions":3142,"creat":3143,"fid":3144,"dpos":3145,"atoms_d":3146,"pos":3147,"set_positions":3148,"creating":3149,"lammps_data":3150,"my":3151,"personal":3152,"ase2lammpsdata":3153,"behavior":3154,"emat":3155,"randomdisturbparser":3156,"cell0":3157,"get_cell":3158,"flux":3159,"positions":3160,"volumes":3161,"set_cell":3162,"scale_atoms":3163,"fout_c":3164,"randomiziations":3165,"pre":3166,"converting":3167,"low":3168,"angular":3169,"cell_new":3170,"convert_cell":3171,"pos_new":3172,"convert_positions":3173,"stru_d":3174,"convert_mat":3175,"alloy_dist":3176,"ifmt":3177,"also":3178,"us":3179,"convinient":3180,"tool":3181,"atomic_symbols":3182,"atomic_ratios":3183,"renormalize":3184,"atomic_ratio":3185,"exactly":3186,"num_of_numbers":3187,"num_for_each":3188,"substituted":3189,"sequence":3190,"all_ids":3191,"permutation":3192,"ids_for_each":3193,"id_start":3194,"subsitute":3195,"them":3196,"replacing":3197,"symbols":3198,"new_chemical_symbols":3199,"get_chemical_symbols":3200,"itself":3201,"ids":3202,"chemical_symbols":3203,"set_chemical_symbols":3204,"_random":3205,"created":3206,"tensor":3207,"generations":3208,"diagonal":3209,"tensors":3210,"randomized":3211,"fileformat":3212,"wd":3213,"write_disp":3214,"program":3215,"dir2car":3216,"car2dir":3217,"ainv":3218,"stress9_to_stress6":3219,"s9":3220,"s6":3221,"stress6_to_stress9":3222,"is_upper_triangular":3223,"mat":3224,"near0":3225,"ase_cell":3226,"convert_forces":3227,"forces0":3228,"convert_stress":3229,"s6_0":3230,"get_atoms_ntypes":3231,"set_atoms_typeids":3232,"set_atoms_typeids_with_atomic_numbers":3233,"adapted":3234,"lammpsrun":3235,"rule":3236,"definition":3237,"within":3238,"00001":3239,"parallel":3240,"piped":3241,"forming":3242,"right":3243,"hand":3244,"accept":3245,"transposes":3246,"bases":3247,"column":3248,"transpose":3249,"rotate":3250,"tri_mat":3251,"ahat":3252,"axbhat":3253,"trans":3254,