{"sources":0,"dpdata":1,"__about__":2,"py":3,"from":4,"__future__":5,"import":6,"annotations":7,"__version__":8,"unknown":9,"__init__":10,"uses":11,"lammps":12,"md":13,"vasp":14,"bondordersystem":15,"labeledsystem":16,"multisystems":17,"system":18,"bond_order_system":19,"try":20,"_version":21,"version":22,"except":23,"importerror":24,"__all__":25,"__main__":26,"cli":27,"dpdata_cli":28,"__name__":29,"typing":30,"tuple":31,"union":32,"file":33,"generated":34,"setuptools":35,"scm":36,"don":37,"change":38,"track":39,"control":40,"__version_tuple__":41,"version_tuple":42,"__commit_id__":43,"commit_id":44,"type_checking":45,"false":46,"int":47,"str":48,"none":49,"else":50,"object":51,"g8b6a0a7ab":52,"abacus":53,"defines":54,"def":55,"get_path_out":56,"fname":57,"inlines":58,"function":59,"different":60,"same":61,"name":62,"scf":63,"returns":64,"out":65,"xxxx":66,"base":67,"directory":68,"get_coord_dump_freq":69,"get_coords_from_dump":70,"dumplines":71,"natoms":72,"os":73,"warnings":74,"np":75,"utils":76,"open_file":77,"bohr2ang":78,"get_geometry_in":79,"get_mag_force":80,"kbar2evperang3":81,"get_frame_from_stru":82,"before":83,"get_energy":84,"get_frame":85,"numpy":86,"stru":87,"read":88,"geometries":89,"trajectory":90,"atomic":91,"coordinates":92,"files":93,"energies":94,"forces":95,"important":96,"program":97,"defaultly":98,"takes":99,"input":100,"standard":101,"cell":102,"information":103,"therefore":104,"direct":105,"cartesan":106,"could":107,"ones":108,"output":109,"cif":110,"highly":111,"recommanded":112,"use":113,"orthoganal":114,"you":115,"wish":116,"get":117,"both":118,"path_out":119,"path":120,"join":121,"line":122,"len":123,"suffix":124,"split":125,"break":126,"return":127,"md_dumpfreq":128,"scope":129,"after":130,"nlines":131,"total_natoms":132,"sum":133,"virial":134,"force":135,"velocity":136,"controlled":137,"parameters":138,"dump_virial":139,"dump_force":140,"dump_vel":141,"respectively":142,"so":143,"search":144,"keywords":145,"can":146,"determine":147,"whether":148,"datas":149,"printed":150,"md_dump":151,"calc_stress":152,"calc_force":153,"check_line":154,"true":155,"10":156,"assert":157,"position":158,"cannot":159,"found":160,"6th":161,"please":162,"check":163,"nframes_dump":164,"13":165,"number":166,"lines":167,"atoms":168,"incomplete":169,"noqa":170,"up031":171,"cells":172,"zeros":173,"stresses":174,"coords":175,"iframe":176,"iline":177,"range":178,"mdstep":179,"lattice_constant":180,"v3":181,"unit":182,"angstrom":183,"added":184,"end":185,"bohr":186,"celldm":187,"float":188,"newversion":189,"transfer":190,"lattice_vectors":191,"ix":192,"array":193,"skipline":194,"11":195,"iat":196,"index":197,"label":198,"ev":199,"fs":200,"sn":201,"000000000000":202,"000000000001":203,"001244557166":204,"000346684288":205,"000768457739":206,"102800034079":207,"000186795145":208,"000453823768":209,"000550996187":210,"000886442775":211,"001579501983":212,"value":213,"real":214,"cartessian":215,"cal_force":216,"outlines":217,"ndump":218,"dump_freq":219,"nframe_dump":220,"frames":221,"does":222,"match":223,"energy":224,"nenergy":225,"line_idx":226,"enumerate":227,"final":228,"etot":229,"append":230,"elif":231,"convergence":232,"has":233,"been":234,"achieved":235,"nan":236,"total":237,"running_md":238,"log":239,"isinstance":240,"parameter":241,"only":242,"one":243,"string":244,"assumed":245,"containing":246,"path_in":247,"raise":248,"runtimeerror":249,"invalid":250,"fp":251,"geometry_path_in":252,"dir":253,"data":254,"atom_numbs":255,"should":256,"remove":257,"spins":258,"pop":259,"used":260,"popen":261,"ls":262,"grep":263,"md_pos_":264,"wc":265,"readlines":266,"dumped":267,"geometry":268,"get_coords_from_cif":269,"atom_names":270,"types":271,"stress":272,"shape":273,"unconv_stru":274,"iene":275,"isnan":276,"delete":277,"axis":278,"warn":279,"structure":280,"unconverged":281,"collected":282,"linalg":283,"det":284,"reshape":285,"abs":286,"1e":287,"magmom":288,"magforce":289,"idx":290,"virials":291,"ndarray":292,"del":293,"orig":294,"force_mags":295,"need":296,"expand":297,"move":298,"relax":299,"get_log_file":300,"get_coords_from_log":301,"loglines":302,"collect_force":303,"collect_stress":304,"runnning_relax":305,"calculation":306,"logf":307,"running_":308,"notice":309,"order":310,"coordinate":311,"changed":312,"converged":313,"setted":314,"abnormal":315,"ending":316,"set":317,"cal_stress":318,"natoms_log":319,"41":320,"atom":321,"type":322,"error":323,"detected":324,"while":325,"coord_direct":326,"18":327,"lattice":328,"constant":329,"a0":330,"direct_coord":331,"list":332,"map":333,"lambda":334,"cartesian":335,"unrecongnized":336,"56":337,"vectors":338,"a_0":339,"add":340,"previous":341,"structures":342,"current":343,"14":344,"whose":345,"last":346,"which":347,"keep":348,"have":349,"all":350,"coord":351,"minl":352,"min":353,"dot":354,"bohrium":355,"volume":356,"isfile":357,"find":358,"f1":359,"checkfile":360,"ifile":361,"get_force":362,"re":363,"lengthconversion":364,"pressureconversion":365,"get_stress":366,"kbar":367,"print":368,"stru_file":369,"atom_file":370,"running_scf":371,"reversed":372,"lts":373,"develop":374,"value_pattern":375,"compile":376,"ee":377,"first":378,"noforce":379,"stop":380,"warning":381,"ii":382,"nostress":383,"magnetic":384,"moments":385,"three":386,"dimensions":387,"ion_step":388,"magnetism":389,"ub":390,"fe":391,"0000000001":392,"0000000000":393,"0000000307":394,"0000001151":395,"2117698671":396,"2117928796":397,"mags":398,"magforces":399,"mag":400,"imag":401,"imagforce":402,"atom_types":403,"converge":404,"newaxis":405,"empty":406,"split_stru_block":407,"clean_comment":408,"parse_atomic_species_block":409,"parse_numerical_orbital_block":410,"parse_lattice_constant_block":411,"parse_lattice_vectors_block":412,"parse_pos_oneline":413,"pos_line":414,"get_atom_mag_cartesian":415,"get_cartesian_coords":416,"parse_pos":417,"blocks":418,"keyword":419,"args":420,"dict":421,"dictionary":422,"abacus_stru_keys":423,"atomic_species":424,"numerical_orbital":425,"atomic_positions":426,"numerical_descriptor":427,"paw_files":428,"strip":429,"key":430,"continue":431,"parse":432,"block":433,"masses":434,"pp_files":435,"pseudo":436,"potential":437,"required":438,"orbital":439,"parses":440,"content":441,"include":442,"word":443,"numbers":444,"controlling":445,"movement":446,"relaxation":447,"calculations":448,"vel":449,"components":450,"initial":451,"start":452,"magnetization":453,"each":454,"colinear":455,"non":456,"angle1":457,"case":458,"angle":459,"between":460,"spin":461,"degrees":462,"angle2":463,"projection":464,"ab":465,"plane":466,"cs":467,"constrain":468,"constraint":469,"pos":470,"values":471,"bool":472,"lambda1":473,"90":474,"180":475,"comments":476,"sline":477,"mag_list":478,"velocity_list":479,"move_list":480,"angle1_list":481,"angle2_list":482,"constrain_list":483,"lambda_list":484,"firstly":485,"sc":486,"setting":487,"moment":488,"atommag":489,"coord_type":490,"right_hand_rule":491,"transform":492,"support":493,"defining":494,"time":495,"xy":496,"defined":497,"directly":498,"norm":499,"direction":500,"a1":501,"a2":502,"mag_norm":503,"sin":504,"radians":505,"cos":506,"coordination":507,"either":508,"matmul":509,"coords_lines":510,"make_unlabeled_stru":511,"positions":512,"names":513,"multipy":514,"lambda_":515,"note":516,"we":517,"finnaly":518,"collinear":519,"do":520,"lower":521,"cartisan":522,"coordinations":523,"flag":524,"ntype":525,"starting":526,"element":527,"define_atom_mag":528,"atom_name":529,"equal":530,"expected":531,"atom_type_mag":532,"imove":533,"ivelocity":534,"imagmom":535,"iangle1":536,"iangle2":537,"iconstrain":538,"ilambda1":539,"calculate":540,"transformation":541,"dtype":542,"here":543,"when":544,"specified":545,"rotate":546,"make":547,"fit":548,"right":549,"hand":550,"rule":551,"rotated":552,"frame":553,"description":554,"https":555,"deepmodeling":556,"com":557,"en":558,"latest":559,"advanced":560,"input_files":561,"html":562,"parsed":563,"orb_files":564,"dpks_descriptor":565,"deepks":566,"descriptor":567,"below":568,"xxx":569,"moves":570,"flags":571,"some":572,"keys":573,"provided":574,"included":575,"designed":576,"delta":577,"write":578,"lmp":579,"format":580,"written":581,"valid":582,"job":583,"normal":584,"want":585,"dpgen":586,"run":587,"define":588,"filenotfounderror":589,"open":590,"frame_idx":591,"pp_file":592,"mass":593,"link_file":594,"dest_dir":595,"kwargs":596,"unlabeled":597,"dump":598,"atomnames":599,"optional":600,"numerical":601,"xyz":602,"floats":603,"noncollinear":604,"component":605,"bools":606,"link":607,"filename":608,"soft":609,"destination":610,"corresponding":611,"passed":612,"_link_file":613,"src_file":614,"ndarray2list":615,"process_file_input":616,"file_input":617,"input_name":618,"process":619,"abspath":620,"isdir":621,"makedirs":622,"dest_file":623,"basename":624,"samefile":625,"symlink":626,"tolist":627,"valueerror":628,"length":629,"keyerror":630,"contain":631,"making":632,"key_name":633,"locals":634,"items":635,"ppfiles":636,"iele":637,"3f":638,"ipp_file":639,"rstrip":640,"orbfiles":641,"iorb":642,"iy":643,"ret":644,"natom_tot":645,"loop":646,"also":647,"iatom":648,"iatomtype":649,"nonzero":650,"iout":651,"12f":652,"amber":653,"mask":654,"pick_by_amber_mask":655,"param":656,"maskstr":657,"load_param_file":658,"param_file":659,"parmed":660,"pass":661,"pick":662,"masks":663,"parm":664,"initialize_topology":665,"sele":666,"newmaskstr":667,"replace":668,"ambermask":669,"selected":670,"load_file":671,"unsupported":672,"read_amber_traj":673,"parm7_file":674,"nc_file":675,"mdfrc_file":676,"mden_file":677,"mdout_file":678,"use_element_symbols":679,"labeled":680,"energyconversion":681,"elements":682,"periodic_table":683,"kcalmol2ev":684,"kcal_mol":685,"symbols":686,"energy_convert":687,"force_convert":688,"includes":689,"nc":690,"netcdf":691,"stores":692,"mdfrc":693,"mden":694,"text":695,"mdout":696,"may":697,"store":698,"parm7":699,"filenames":700,"indexes":701,"instead":702,"example":703,"ligand":704,"h1":705,"hc":706,"considered":707,"scipy":708,"io":709,"netcdf_file":710,"flag_atom_type":711,"flag_atom_numb":712,"amber_types":713,"atomic_number":714,"startswith":715,"amber_atom_type":716,"fmt":717,"findall":718,"fmt0":719,"fmt1":720,"start_index":721,"end_index":722,"variables":723,"cell_lengths":724,"cell_angles":725,"89":726,"99":727,"01":728,"todo":729,"other":730,"angles":731,"load":732,"l6":733,"e_pot":734,"eptot":735,"provide":736,"unique":737,"return_inverse":738,"return_counts":739,"sqm":740,"parse_sqm_out":741,"filetype":742,"make_sqm_in":743,"kcal2ev":744,"read_charge":745,"read_coords_start":746,"read_coords":747,"read_forces":748,"charges":749,"ambertools":750,"atom_symbols":751,"mulliken":752,"charge":753,"qmmm":754,"qm":755,"ll":756,"atm":757,"60":758,"40":759,"20":760,"100":761,"nopbc":762,"float64":763,"atomic_numbers":764,"ss":765,"multiplicity":766,"mult":767,"supported":768,"maxcyc":769,"represents":770,"single":771,"point":772,"theory":773,"qm_theory":774,"dftb3":775,"semi":776,"emperical":777,"minimization":778,"qmcharge":779,"verbosity":780,"4s":781,"6s":782,"16s":783,"6f":784,"ase_calculator":785,"class":786,"dpdatacalculator":787,"calculator":788,"self":789,"driver":790,"properties":791,"system_changes":792,"all_changes":793,"ase":794,"calculators":795,"propertynotimplementederror":796,"tid253":797,"implementation":798,"deepmd":799,"based":800,"property":801,"implemented_properties":802,"free_energy":803,"default":804,"unused":805,"signature":806,"compatibility":807,"copy":808,"predict":809,"results":810,"see":811,"gitlab":812,"merge_requests":813,"2485":814,"convert":815,"get_pbc":816,"usual":817,"convention":818,"tensile":819,"positive":820,"get_volume":821,"voigt":822,"notation":823,"flat":824,"deepcopy":825,"rdkit":826,"sanitize":827,"sanitizer":828,"datatype":829,"bond":830,"mol2":831,"file_name":832,"auto":833,"type_map":834,"begin":835,"step":836,"rdkit_mol":837,"sanitize_level":838,"medium":839,"raise_errors":840,"verbose":841,"from_fmt_obj":842,"fmtobj":843,"chemical":844,"formal":845,"methane":846,"named":847,"d_example":848,"molecule":849,"bonds":850,"n_frames":851,"accessed":852,"size":853,"column":854,"second":855,"third":856,"columen":857,"double":858,"triple":859,"aromatic":860,"formal_charges":861,"dtypes":862,"nbonds":863,"constructor":864,"formats":865,"inferred":866,"extention":867,"mol":868,"sdf":869,"needed":870,"raw":871,"npy":872,"maps":873,"mapped":874,"assigned":875,"type_1":876,"type_2":877,"type_3":878,"beginning":879,"loading":880,"skipped":881,"chem":882,"rdchem":883,"must":884,"init":885,"level":886,"low":887,"high":888,"exception":889,"sanitization":890,"procedure":891,"fails":892,"additional":893,"arguments":894,"system_data_to_mol":895,"from_rdkit_mol":896,"from_fmt":897,"specify":898,"apply_type_map":899,"check_data":900,"from_bond_order_system":901,"hasattr":902,"post_func":903,"post_f":904,"ignore":905,"post_funcs":906,"get_plugin":907,"to_fmt_obj":908,"__str__":909,"get_nbonds":910,"get_charge":911,"get_mol":912,"get_bond_order":913,"begin_atom_idx":914,"end_atom_idx":915,"get_formal_charges":916,"__add__":917,"conformer":918,"removeallconformers":919,"get_nframes":920,"conf":921,"get_natoms":922,"setatomposition":923,"addconformer":924,"assignid":925,"to_bond_order_system":926,"brief":927,"summary":928,"nbondorder":929,"nframe":930,"natom":931,"nbond":932,"nelement":933,"get_atom_names":934,"get_atom_numbs":935,"moleclue":936,"given":937,"bond_dict":938,"new_mol":939,"__class__":940,"notimplementederror":941,"magic":942,"method":943,"implemented":944,"operation":945,"check_same_molecule":946,"two":947,"systems":948,"topology":949,"initialize":950,"mol_to_system_data":951,"dpdata_parser":952,"argparse":953,"argumentparser":954,"from_file":955,"from_format":956,"to_file":957,"to_format":958,"no_labeled":959,"multi":960,"command":961,"interface":962,"parser":963,"manipulating":964,"multiple":965,"simulation":966,"formatter_class":967,"argumentdefaultshelpformatter":968,"add_argument":969,"help":970,"action":971,"store_true":972,"labels":973,"aren":974,"contains":975,"directories":976,"nargs":977,"examples":978,"code":979,"bash":980,"iposcar":981,"poscar":982,"odeepmd":983,"parsed_args":984,"parse_args":985,"vars":986,"another":987,"cp2k":988,"cell_to_low_triangle":989,"alpha":990,"beta":991,"gamma":992,"triangle":993,"matrix":994,"radian":995,"vector":996,"form":997,"pi":998,"175":999,"greater":1000,"than":1001,"lx":1002,"xz":1003,"ly":1004,"yz":1005,"lz":1006,"sqrt":1007,"asarray":1008,"astype":1009,"float32":1010,"cp2ksystems":1011,"math":1012,"collections":1013,"ordereddict":1014,"forceconversion":1015,"get_frames":1016,"au_to_ang":1017,"au_to_ev":1018,"hartree":1019,"au_to_ev_every_ang":1020,"delimiter_patterns":1021,"delimiter_p1":1022,"go":1023,"delimiter_p2":1024,"avail_patterns":1025,"ensemble":1026,"log_file_name":1027,"xyz_file_name":1028,"restart":1029,"__del__":1030,"__iter__":1031,"__next__":1032,"get_log_block_generator":1033,"deal":1034,"outputfile":1035,"log_file_object":1036,"xyz_file_object":1037,"log_block_generator":1038,"xyz_block_generator":1039,"get_xyz_block_generator":1040,"restart_flag":1041,"print_level":1042,"atomic_kinds":1043,"handle_single_log_frame":1044,"next":1045,"close":1046,"info_dict":1047,"log_info_dict":1048,"xyz_info_dict":1049,"handle_single_xyz_frame":1050,"eq1":1051,"v1":1052,"v2":1053,"zip":1054,"eq2":1055,"eq3":1056,"errors":1057,"task":1058,"isclose":1059,"abs_tol":1060,"0e":1061,"update":1062,"delimiter_flag":1063,"yield_flag":1064,"readline":1065,"any":1066,"yield":1067,"stopiteration":1068,"delimiter":1069,"patterns":1070,"matched":1071,"lacks":1072,"p3":1073,"atom_num":1074,"group":1075,"lack":1076,"energy_pattern_1":1077,"conserved":1078,"quantity":1079,"279168013085e":1080,"04":1081,"energy_pattern_2":1082,"cell_length_pattern":1083,"lnths":1084,"cell_angle_pattern":1085,"angls":1086,"deg":1087,"cell_a":1088,"cell_b":1089,"cell_c":1090,"cell_alpha":1091,"cell_beta":1092,"cell_gamma":1093,"cell_a_pattern":1094,"ax":1095,"ay":1096,"az":1097,"cell_b_pattern":1098,"bx":1099,"bz":1100,"cell_c_pattern":1101,"cx":1102,"cy":1103,"cz":1104,"force_start_pattern":1105,"force_flag":1106,"force_end_pattern":1107,"force_lines":1108,"cell_flag":1109,"print_level_pattern":1110,"global":1111,"print_level_flag":1112,"atomic_kinds_pattern":1113,"kind":1114,"akind":1115,"stress_sign":1116,"stress_flag":1117,"groupdict":1118,"1to":1119,"deg2rad":1120,"cell_ax":1121,"cell_ay":1122,"cell_az":1123,"cell_bx":1124,"cell_by":1125,"cell_bz":1126,"cell_cx":1127,"cell_cy":1128,"cell_cz":1129,"higher":1130,"least":1131,"element_index":1132,"element_dict":1133,"atom_types_idx_list":1134,"forces_list":1135,"line_list":1136,"gpa":1137,"conversion":1138,"squeeze":1139,"data_format_line":1140,"prop_pattern":1141,"prop":1142,"prop_dict":1143,"atom_types_list":1144,"coords_list":1145,"coord_flag":1146,"atom_symbol_idx_list":1147,"atom_symbol_list":1148,"sys":1149,"count":1150,"duplicated":1151,"header":1152,"seek":1153,"header_idx":1154,"multiplication":1155,"skip":1156,"force_idx":1157,"reading":1158,"tensor":1159,"stress_idx":1160,"conver":1161,"extra":1162,"dimension":1163,"nframes":1164,"necessary":1165,"tmp_names":1166,"symbol_idx":1167,"return_index":1168,"preserve":1169,"sort":1170,"stable":1171,"jj":1172,"data_type":1173,"enum":1174,"anyint":1175,"__eq__":1176,"dataerror":1177,"deepmd_name":1178,"__repr__":1179,"real_shape":1180,"plugin":1181,"register_data_type":1182,"get_data_types":1183,"ntypes":1184,"equals":1185,"integer":1186,"correct":1187,"like":1188,"etc":1189,"kit":1190,"instances":1191,"compare":1192,"otherwise":1193,"representation":1194,"get_ntypes":1195,"checked":1196,"raises":1197,"exists":1198,"allow":1199,"checking":1200,"__system_data_type_plugin":1201,"__labeled_system_data_type_plugin":1202,"register":1203,"registered":1204,"plugins":1205,"comp":1206,"_cond_load_data":1207,"_load_set":1208,"folder":1209,"to_system_data":1210,"glob":1211,"shutil":1212,"load_type":1213,"tmp":1214,"box":1215,"sets":1216,"sorted":1217,"all_cells":1218,"all_coords":1219,"concatenate":1220,"custom":1221,"real_atom_names":1222,"specific":1223,"rules":1224,"converted":1225,"xx":1226,"all_data":1227,"set_size":1228,"5000":1229,"comp_prec":1230,"remove_sets":1231,"exist_ok":1232,"rmtree":1233,"clean":1234,"compress":1235,"savetxt":1236,"bondorder":1237,"begin_atom":1238,"end_atom":1239,"bond_order":1240,"prec":1241,"nsets":1242,"set_stt":1243,"set_end":1244,"set_folder":1245,"03d":1246,"oserror":1247,"fw_nopbc":1248,"ddata":1249,"issubdtype":1250,"floating":1251,"save":1252,"hdf5":1253,"h5py":1254,"wcmatch":1255,"globfilter":1256,"groups":1257,"max":1258,"count_nonzero":1259,"my_type_map":1260,"char":1261,"decode":1262,"arg":1263,"artificial":1264,"type_":1265,"data_types":1266,"real_atom_types":1267,"fn":1268,"dt":1269,"dd":1270,"precision":1271,"root":1272,"create_group":1273,"fact":1274,"create_dataset":1275,"reshaped_data":1276,"mixed":1277,"comp_dump":1278,"comp_to_system_data":1279,"mix_system":1280,"split_system":1281,"old_type_map":1282,"missing_type":1283,"missing":1284,"index_map":1285,"all_real_atom_types_concat":1286,"all_cells_concat":1287,"all_coords_concat":1288,"handle":1289,"reserved":1290,"extra_data":1291,"data_list":1292,"temp_atom_numbs":1293,"temp_formula":1294,"formula":1295,"temp_idx":1296,"arange":1297,"rest_idx":1298,"temp_data":1299,"all_dtype_concat":1300,"2000":1301,"split_num":1302,"10000":1303,"original":1304,"temp_sys":1305,"convert_to_mixed_type":1306,"mix":1307,"mixed_type":1308,"according":1309,"unified":1310,"mixed_systems":1311,"temp_systems":1312,"atom_numbs_frame_index":1313,"cur":1314,"tmp_sys":1315,"sys_name":1316,"rest":1317,"split_sys":1318,"sub_system":1319,"rest_sys":1320,"loadtxt":1321,"ndmin":1322,"dftbplus":1323,"read_dftb_plus":1324,"fn_1":1325,"fn_2":1326,"dftb":1327,"components_num":1328,"12":1329,"abc":1330,"callable":1331,"get_driver":1332,"get_drivers":1333,"abstractmethod":1334,"hybriddriver":1335,"minimizer":1336,"pure":1337,"generate":1338,"dpdriver":1339,"__driverplugin":1340,"staticmethod":1341,"decorators":1342,"decorator":1343,"some_driver":1344,"somedriver":1345,"requested":1346,"plugisn":1347,"setup":1348,"new":1349,"notimplemented":1350,"drivers":1351,"hybrid":1352,"others":1353,"typeerror":1354,"dp":1355,"frozen_model":1356,"pb":1357,"those":1358,"labeled_data":1359,"lb_data":1360,"get_minimizer":1361,"get_minimizers":1362,"minimize":1363,"__minimizerplugin":1364,"some_minimizer":1365,"someminimizer":1366,"minimized":1367,"fhi_aims":1368,"get_info":1369,"type_idx_zero":1370,"get_fhi_aims_block":1371,"analyze_block":1372,"latt_patt":1373,"pos_patt_first":1374,"pos_patt_other":1375,"force_patt":1376,"eng_patt":1377,"uncorrected":1378,"atom_numb_patt":1379,"debug":1380,"_atom_names":1381,"contents":1382,"_tmp":1383,"vect":1384,"kk":1385,"ln":1386,"v_str":1387,"ion":1388,"info":1389,"aims":1390,"blk":1391,"consistency":1392,"initialization":1393,"convergence_check":1394,"first_blk":1395,"ntot":1396,"all_energies":1397,"all_forces":1398,"all_virials":1399,"cc":1400,"rec_failed":1401,"_cell":1402,"is_converge":1403,"prt":1404,"still":1405,"due":1406,"requirement":1407,"ignoring":1408,"checks":1409,"following":1410,"were":1411,"slice":1412,"cycle":1413,"_eng_patt":1414,"argv":1415,"implement":1416,"register_from":1417,"register_to":1418,"get_formats":1419,"get_from_methods":1420,"get_to_methods":1421,"abstract":1422,"create":1423,"inherited":1424,"several":1425,"methods":1426,"meth":1427,"from_system":1428,"documentation":1429,"docstring":1430,"insider":1431,"outside":1432,"package":1433,"__formatplugin":1434,"__fromplugin":1435,"__toplugin":1436,"well":1437,"from_":1438,"to_":1439,"explicitly":1440,"executed":1441,"mod":1442,"imported":1443,"module":1444,"automatically":1445,"submodule":1446,"entry":1447,"test":1448,"test2":1449,"testformat":1450,"target":1451,"from_test_haha":1452,"although":1453,"to_test_haha":1454,"post":1455,"func_name":1456,"to_system":1457,"from_labeled_system":1458,"to_labeled_system":1459,"called":1460,"remove_pbc":1461,"converts":1462,"argument":1463,"doesn":1464,"fallback":1465,"multimodes":1466,"from_multi_systems":1467,"to_multi_systems":1468,"formulas":1469,"mode":1470,"modes":1471,"every":1472,"under":1473,"top":1474,"multimode":1475,"follows":1476,"listdir":1477,"ff":1478,"gaussian":1479,"fchk":1480,"create_full_hessian":1481,"hessian_raw":1482,"has_forces":1483,"has_hessian":1484,"hessianconversion":1485,"length_convert":1486,"hessian_convert":1487,"reconstructs":1488,"full":1489,"symmetric":1490,"hessian":1491,"1d":1492,"its":1493,"triangular":1494,"including":1495,"diagonal":1496,"hessian_block":1497,"dim":1498,"validate":1499,"expected_length":1500,"zero":1501,"fill":1502,"hessian_full":1503,"lower_triangle_indices":1504,"tril_indices":1505,"done":1506,"copying":1507,"upper":1508,"m_full":1509,"m_lower":1510,"diag":1511,"gradient":1512,"taking":1513,"negative":1514,"sign":1515,"atom_numbers":1516,"coords_t":1517,"energy_t":1518,"forces_t":1519,"hessian_t":1520,"bytes":1521,"next_line":1522,"coords_raw":1523,"forces_raw":1524,"constants":1525,"align":1526,"assemble":1527,"eye":1528,"gjf":1529,"_crd2frag":1530,"crds":1531,"detect_multiplicity":1532,"itertools":1533,"uuid":1534,"sparse":1535,"csr_matrix":1536,"csgraph":1537,"make_gaussian_input":1538,"read_gaussian_input":1539,"github":1540,"blob":1541,"0767dce7cad29367edb2e4a55fd0d8724dbda642":1542,"generator":1543,"lib":1544,"l1":1545,"l190":1546,"lgpl":1547,"license":1548,"detect":1549,"fragments":1550,"virtual":1551,"frag_numb":1552,"frag_index":1553,"frament":1554,"belongs":1555,"notes":1556,"babel":1557,"connectivity":1558,"threshold":1559,"covalent":1560,"radii":1561,"slight":1562,"tolerance":1563,"45":1564,"pbc":1565,"removed":1566,"installed":1567,"connected_components":1568,"openbabel":1569,"atomnumber":1570,"connect":1571,"obmol":1572,"beginmodify":1573,"symbol":1574,"num":1575,"newatom":1576,"setatomicnum":1577,"setvector":1578,"connectthedots":1579,"perceivebondorders":1580,"endmodify":1581,"numbonds":1582,"getbond":1583,"getbeginatom":1584,"getid":1585,"getendatom":1586,"bo":1587,"getbondorder":1588,"extend":1589,"graph":1590,"minimal":1591,"molecules":1592,"currently":1593,"oxygen":1594,"calculates":1595,"electrons":1596,"assumes":1597,"paired":1598,"much":1599,"possible":1600,"n_total":1601,"sys_data":1602,"fragment_guesses":1603,"basis_set":1604,"keywords_high_multiplicity":1605,"nproc":1606,"b3lyp":1607,"31g":1608,"steps":1609,"state":1610,"radical":1611,"guess":1612,"fragment":1613,"guesses":1614,"basis":1615,"points":1616,"raicals":1617,"cpus":1618,"atom_type":1619,"assume":1620,"use_fragment_guesses":1621,"mult_auto":1622,"illegal":1623,"feature":1624,"16":1625,"mult_frags":1626,"chargekeywords_frag":1627,"mult_frag":1628,"multi_frags":1629,"radicals":1630,"buff":1631,"inp":1632,"chkkeywords":1633,"chk":1634,"uuid1":1635,"nprockeywords":1636,"title":1637,"titlekeywords":1638,"numb":1639,"chargekeywords":1640,"condition":1641,"tv":1642,"kw":1643,"islice":1644,"link1":1645,"sub":1646,"orientation":1647,"cells_t":1648,"center":1649,"hartrees":1650,"using":1651,"geom":1652,"printinputorient":1653,"always":1654,"more":1655,"details":1656,"23":1657,"38":1658,"53":1659,"68":1660,"gromacs":1661,"gro":1662,"_format_atom_name":1663,"_get_line":1664,"fmt_atom_name":1665,"_get_cell":1666,"file_to_system_data":1667,"format_atom_name":1668,"from_system_data":1669,"usr":1670,"bin":1671,"env":1672,"python3":1673,"nm2ang":1674,"nm":1675,"ang2nm":1676,"cell_idx_gmx2dp":1677,"patt":1678,"za":1679,"fmt_name":1680,"capitalize":1681,"15":1682,"atom_idx":1683,"posis":1684,"44":1685,"lengths":1686,"wrong":1687,"idxs":1688,"f_idx":1689,"resname":1690,"shift":1691,"n_atoms":1692,"5d":1693,"5s":1694,"flatten":1695,"unwrapwarning":1696,"userwarning":1697,"_get_block":1698,"get_atype":1699,"get_natomtypes":1700,"get_natoms_vec":1701,"get_coordtype_and_scalefactor":1702,"scaling":1703,"factor":1704,"safe_get_posi":1705,"get_dumpbox":1706,"dumpbox2box":1707,"lib_path":1708,"dirname":1709,"realpath":1710,"__file__":1711,"simplefilter":1712,"once":1713,"item":1714,"idx_s":1715,"idx_e":1716,"head":1717,"id_idx":1718,"id":1719,"tidx":1720,"atype":1721,"natoms_vec":1722,"natomtypes":1723,"key_pc":1724,"plain":1725,"sf":1726,"key_uc":1727,"xu":1728,"yu":1729,"zu":1730,"unwraped":1731,"key_s":1732,"xs":1733,"ys":1734,"zs":1735,"scaled":1736,"key_su":1737,"xsu":1738,"ysu":1739,"zsu":1740,"unfolded":1741,"lmp_coor_type":1742,"uw":1743,"unwrap":1744,"bounds":1745,"tilt":1746,"box2dumpbox":1747,"get_spin_keys":1748,"get_spin":1749,"system_data":1750,"coord_tp_and_sf":1751,"coordtype":1752,"xidx":1753,"yidx":1754,"zidx":1755,"words":1756,"inv":1757,"unscaled":1758,"back":1759,"cartesien":1760,"periodic":1761,"boundaries":1762,"message":1763,"your":1764,"unwrapped":1765,"did":1766,"unwrapping":1767,"wrapping":1768,"category":1769,"wraping":1770,"boundary":1771,"conditions":1772,"load_tilt":1773,"xlo":1774,"xhi":1775,"ylo":1776,"yhi":1777,"zlo":1778,"zhi":1779,"lmpbox2box":1780,"lohi":1781,"box2lmpbox":1782,"timestep":1783,"inputfile":1784,"spin_keys":1785,"split_traj":1786,"compute":1787,"sp":1788,"spx":1789,"spy":1790,"spz":1791,"compute_name":1792,"c_":1793,"stored":1794,"00141160":1795,"64868599":1796,"01005602":1797,"54706291":1798,"00000000":1799,"40772100":1800,"03739417":1801,"1522":1802,"64797384":1803,"00397809":1804,"00190426":1805,"00743976":1806,"heads":1807,"idx_id":1808,"idx_sp":1809,"idx_spx":1810,"idx_spy":1811,"idx_spz":1812,"vec":1813,"atom_ids":1814,"indexerror":1815,"processing":1816,"input_file":1817,"dump_lines":1818,"array_lines":1819,"has_spin":1820,"argsort":1821,"marks":1822,"block_size":1823,"basic":1824,"pp":1825,"10f":1826,"atom_id":1827,"indexing":1828,"hti":1829,"posi":1830,"get_posi":1831,"dbox1":1832,"tilt1":1833,"dbox":1834,"conf_unfold":1835,"al":1836,"detect_atom_style":1837,"get_atoms":1838,"ptr_float_fmt":1839,"ptr_int_fmt":1840,"6d":1841,"ptr_key_fmt":1842,"15s":1843,"mapping":1844,"styles":1845,"layouts":1846,"atom_id_col":1847,"atom_type_col":1848,"x_col":1849,"y_col":1850,"z_col":1851,"has_molecule_id":1852,"has_charge":1853,"charge_col":1854,"atom_style_columns":1855,"molecular":1856,"dipole":1857,"sphere":1858,"style":1859,"look":1860,"section":1861,"atom_lines":1862,"comment":1863,"comment_part":1864,"explicit":1865,"infer":1866,"first_line":1867,"num_cols":1868,"columns":1869,"heuristic":1870,"approach":1871,"looks":1872,"val":1873,"small":1874,"likely":1875,"now":1876,"enough":1877,"unable":1878,"lens":1879,"yy":1880,"zz":1881,"_atom_info_mol":1882,"_atom_info_atom":1883,"_atom_info_style":1884,"atom_style":1885,"get_charges":1886,"mole_type":1887,"molecule_id":1888,"present":1889,"result":1890,"get_spins":1891,"get_lmpbox":1892,"rotate_to_lower_triangle":1893,"alines":1894,"atom_info":1895,"supports":1896,"spins_ori":1897,"spins_norm":1898,"iis":1899,"box_info":1900,"them":1901,"attempts":1902,"attempt":1903,"automatic":1904,"detection":1905,"detected_style":1906,"ensure":1907,"adjusted":1908,"qr":1909,"rot":1910,"coord_fmt":1911,"water":1912,"spce":1913,"bonds1":1914,"msd":1915,"_msd":1916,"pbc_shift":1917,"_msd_win":1918,"window":1919,"sel":1920,"system_pbc_shift":1921,"prev_coord":1922,"msds":1923,"curr_coord":1924,"diff_coord":1925,"ncoords":1926,"tile":1927,"sel_idx":1928,"nsel":1929,"posi_diff":1930,"r0":1931,"r1":1932,"posi_shift":1933,"dir_coord":1934,"apply_pbc":1935,"system_coords":1936,"system_cells":1937,"rbox":1938,"p0":1939,"p1":1940,"dr":1941,"prev_ncoord":1942,"shifts":1943,"curr_shift":1944,"half":1945,"curr_ncoord":1946,"diff_ncoord":1947,"ncoord":1948,"rdf":1949,"sel_type":1950,"max_r":1951,"nbins":1952,"compute_rdf":1953,"neighborlist":1954,"_compute_rdf_1frame":1955,"specifies":1956,"ints":1957,"maximal":1958,"bins":1959,"up":1960,"all_rdf":1961,"all_cod":1962,"cod":1963,"average":1964,"all_types":1965,"nlist":1966,"self_interaction":1967,"bothways":1968,"primitive":1969,"newprimitiveneighborlist":1970,"stat":1971,"stat_acc":1972,"hh":1973,"indices":1974,"offsets":1975,"get_neighbors":1976,"posi_jj":1977,"get_cell":1978,"diff":1979,"diff_1":1980,"si":1981,"atom1":1982,"c0":1983,"c1":1984,"rho1":1985,"vol":1986,"rho":1987,"res":1988,"compute_bonds":1989,"oh_sel":1990,"max_roh":1991,"uniq_hbond":1992,"compute_bonds_ase":1993,"compute_bonds_naive":1994,"find_ions":1995,"pbc_coords":1996,"naivly":1997,"scales":1998,"o_type":1999,"h_type":2000,"nn":2001,"orig_bonds":2002,"min_bd":2003,"1e10":2004,"min_idx":2005,"drr":2006,"ions_count":2007,"noh":2008,"noh2":2009,"noh3":2010,"nh":2011,"ret_h2o":2012,"unknow":2013,"bonded":2014,"new_coords":2015,"hs":2016,"openmx":2017,"omx":2018,"load_atom":2019,"load_cells":2020,"load_coords":2021,"ry2ev":2022,"rydberg":2023,"iterout":2024,"soure":2025,"physical":2026,"quantities":2027,"net":2028,"electron":2029,"mub":2030,"scf_convergence_flag":2031,"declaration":2032,"dft":2033,"openmx_common":2034,"where":2035,"recompile":2036,"atom_names_mode":2037,"speciesandcoordinates":2038,"parts":2039,"atom_names_original":2040,"fromkeys":2041,"python":2042,"ordering":2043,"species":2044,"atom_types_mode":2045,"mdname":2046,"load_data":2047,"load_energy":2048,"load_force":2049,"to_system_label":2050,"cell_vectors":2051,"21":2052,"nvt_nh":2053,"17":2054,"19":2055,"opt":2056,"dat_file":2057,"md_file":2058,"cnt":2059,"for_line":2060,"determination":2061,"ene_line":2062,"field":2063,"fields":2064,"cdia":2065,"dat":2066,"orca":2067,"read_orca_sp_output":2068,"angstroem":2069,"from_z":2070,"cls":2071,"radius":2072,"calculated_radius":2073,"json":2074,"pathlib":2075,"fpdt":2076,"absolute":2077,"parent":2078,"_pdt":2079,"he":2080,"li":2081,"ne":2082,"na":2083,"mg":2084,"cl":2085,"ar":2086,"ca":2087,"ti":2088,"cr":2089,"mn":2090,"co":2091,"ni":2092,"cu":2093,"zn":2094,"ga":2095,"ge":2096,"se":2097,"br":2098,"kr":2099,"rb":2100,"sr":2101,"zr":2102,"nb":2103,"mo":2104,"tc":2105,"ru":2106,"rh":2107,"pd":2108,"ag":2109,"cd":2110,"sb":2111,"te":2112,"xe":2113,"ba":2114,"la":2115,"ce":2116,"pr":2117,"nd":2118,"pm":2119,"sm":2120,"eu":2121,"gd":2122,"tb":2123,"dy":2124,"ho":2125,"er":2126,"tm":2127,"yb":2128,"lu":2129,"hf":2130,"ta":2131,"ir":2132,"pt":2133,"au":2134,"hg":2135,"tl":2136,"bi":2137,"po":2138,"rn":2139,"fr":2140,"ra":2141,"ac":2142,"th":2143,"pa":2144,"pu":2145,"am":2146,"cm":2147,"bk":2148,"cf":2149,"es":2150,"fm":2151,"lr":2152,"rf":2153,"db":2154,"sg":2155,"bh":2156,"mt":2157,"ds":2158,"rg":2159,"cn":2160,"fl":2161,"mc":2162,"lv":2163,"ts":2164,"og":2165,"_z":2166,"atomic_no":2167,"_name":2168,"_x":2169,"_mass":2170,"atomic_mass":2171,"_r":2172,"_cr":2173,"classmethod":2174,"example_plugin":2175,"3dmol":2176,"py3dmolformat":2177,"300":2178,"stick":2179,"coord_to_xyz":2180,"py3dmol":2181,"advance":2182,"show":2183,"3d":2184,"jupyter":2185,"width":2186,"height":2187,"widget":2188,"to_3dmol":2189,"viewer":2190,"view":2191,"addmodel":2192,"setstyle":2193,"zoomto":2194,"importlib":2195,"metadata":2196,"importlib_metadata":2197,"package_base":2198,"not_loadable":2199,"module_file":2200,"module_name":2201,"stem":2202,"import_module":2203,"readthedocs":2204,"userguide":2205,"entry_point":2206,"eps":2207,"entry_points":2208,"ep":2209,"abacusstruformat":2210,"register_mag_data":2211,"register_move_data":2212,"abacusscfformat":2213,"rot_lower_triangular":2214,"abacusmdformat":2215,"abacusrelaxformat":2216,"stru_string":2217,"force_mag":2218,"pw":2219,"lcao":2220,"ambermdformat":2221,"prefix":2222,"spefic":2223,"sqmoutformat":2224,"sqminformat":2225,"tempfile":2226,"sqmdriver":2227,"sqmminimizer":2228,"subprocess":2229,"software":2230,"options":2231,"am1":2232,"rm1":2233,"mndo":2234,"pm3":2235,"pddg":2236,"carb1":2237,"pm6":2238,"dftb2":2239,"units":2240,"maximum":2241,"cycles":2242,"allowed":2243,"sqm_exec":2244,"1000":2245,"labeled_system":2246,"41111246":2247,"ori_system":2248,"temporarydirectory":2249,"inp_fn":2250,"out_fn":2251,"check_output":2252,"calledprocesserror":2253,"failed":2254,"maximun":2255,"asestructureformat":2256,"asetrajformat":2257,"asedriver":2258,"aseminimizer":2259,"optimize":2260,"optimizer":2261,"environment":2262,"wiki":2263,"fysik":2264,"dtu":2265,"dk":2266,"parsing":2267,"few":2268,"dozen":2269,"described":2270,"ihttps":2271,"many":2272,"determined":2273,"ase_fmt":2274,"supply":2275,"get_chemical_symbols":2276,"get_positions":2277,"calculated":2278,"get_potential_energy":2279,"force_consistent":2280,"get_forces":2281,"finally":2282,"about":2283,"yields":2284,"obj":2285,"tt":2286,"singlepoint":2287,"singlepointcalculator":2288,"v_pref":2289,"1e4":2290,"602176621e6":2291,"stress33":2292,"calc":2293,"traj":2294,"sequence":2295,"dict_frames":2296,"sub_traj":2297,"arrays":2298,"confs":2299,"labeled_confs":2300,"list_atoms":2301,"fmax":2302,"5e":2303,"max_steps":2304,"optimizer_kwargs":2305,"calculato":2306,"to_ase_structure":2307,"criterion":2308,"lbfgs":2309,"logfile":2310,"dyn":2311,"cp2kaimdoutputformat":2312,"cp2koutputformat":2313,"string_warning":2314,"hi":2315,"got":2316,"cp2kdata":2317,"refer":2318,"robinzyb":2319,"aimd_output":2320,"xyz_file":2321,"log_file":2322,"raised":2323,"pattern":2324,"pendingdeprecationwarning":2325,"tmp_virial":2326,"future":2327,"exact":2328,"just":2329,"placeholder":2330,"register_spin":2331,"deepmdrawformat":2332,"deepmdcompformat":2333,"deepmdmixedformat":2334,"deepmdhdf5format":2335,"compressed":2336,"binary":2337,"seperated":2338,"subfolders":2339,"000":2340,"001":2341,"less":2342,"from_system_mix":2343,"from_labeled_system_mix":2344,"put":2345,"together":2346,"larger":2347,"especially":2348,"helps":2349,"mixture":2350,"model":2351,"training":2352,"embedding":2353,"network":2354,"to_deepmd_npy_mixed":2355,"mixed_dir":2356,"load_systems_from_file":2357,"already":2358,"sys_dir":2359,"dirs":2360,"walk":2361,"_from_system":2362,"from_deepmd_npy":2363,"to_deepmd_hdf5":2364,"switch":2365,"hashtag":2366,"deeppot":2367,"modulenotfounderror":2368,"enable_auto_batch_size":2369,"auto_batch_size":2370,"__code__":2371,"co_varnames":2372,"get_type_map":2373,"ori_sys":2374,"from_dict":2375,"ori_sys_copy":2376,"sort_atom_names":2377,"labeled_sys":2378,"eval":2379,"this_sys":2380,"since":2381,"batch":2382,"dftbplusformat":2383,"file_paths":2384,"handles":2385,"provides":2386,"various":2387,"official":2388,"url":2389,"org":2390,"attributes":2391,"reads":2392,"paths":2393,"file_in":2394,"file_out":2395,"last_occurrence":2396,"fhimdformat":2397,"fhiscfformat":2398,"register_hessian_data":2399,"gaussianlogformat":2400,"gaussianfchkformat":2401,"gaussianmdformat":2402,"gaussiagjfformat":2403,"gaussiandriver":2404,"assertionerror":2405,"gaussian_exec":2406,"g16":2407,"large":2408,"1102":2409,"714590995794":2410,"gromacsgroformat":2411,"strs":2412,"gro_str":2413,"register_charge":2414,"lammpslmpformat":2415,"lammpsdumpformat":2416,"shift_orig_zero":2417,"extraction":2418,"maintains":2419,"backward":2420,"molecule_ids":2421,"ids":2422,"access":2423,"extracted":2424,"mux":2425,"muy":2426,"muz":2427,"diameter":2428,"density":2429,"w_str":2430,"listformat":2431,"usefull":2432,"collection":2433,"n2p2":2434,"match_indices":2435,"atype1":2436,"atype2":2437,"efficient":2438,"operations":2439,"n2p2format":2440,"matched_indices":2441,"duplicates":2442,"used_indices":2443,"iterate":2444,"over":2445,"mark":2446,"compphysvienna":2447,"topics":2448,"cfg_file":2449,"atypes":2450,"natom0":2451,"natoms0":2452,"atom_types0":2453,"leading":2454,"trailing":2455,"whitespace":2456,"current_section":2457,"consistent":2458,"across":2459,"unique_dict":2460,"unique_atypes":2461,"unique_atypes_list":2462,"atom_order":2463,"reset":2464,"inside":2465,"line_contents":2466,"6e":2467,"openmxformat":2468,"www":2469,"square":2470,"source":2471,"material":2472,"explorer":2473,"nano":2474,"scale":2475,"conserving":2476,"pseudopotentials":2477,"localized":2478,"functions":2479,"orcaspoutformat":2480,"spout":2481,"psi4":2482,"psi4outformat":2483,"psi4inputformat":2484,"write_psi4_input":2485,"read_psi4_output":2486,"computational":2487,"psicode":2488,"psi4manual":2489,"master":2490,"basissets_tables":2491,"fout":2492,"pwmat":2493,"pwmatoutputformat":2494,"pwmatatomconfigformat":2495,"atomconfig":2496,"mlmd":2497,"tmp_force":2498,"1e3":2499,"config":2500,"pymatgen":2501,"pymatgenstructureformat":2502,"pymatgenmoleculeformat":2503,"core":2504,"pymatgencseformat":2505,"coords_are_cartesian":2506,"f401":2507,"computedstructureentry":2508,"to_pymatgen_computedstructureentry":2509,"pymagen":2510,"entries":2511,"computed_entries":2512,"csedata":2513,"qe":2514,"qecptrajformat":2515,"qecppwscfformat":2516,"cp":2517,"molformat":2518,"sdfformat":2519,"mol_file":2520,"molfrommolfile":2521,"removehs":2522,"getnumconformers":2523,"moltomolfile":2524,"confid":2525,"sdf_file":2526,"requires":2527,"mols":2528,"sdmolsupplier":2529,"combine_molecules":2530,"sdf_writer":2531,"sdwriter":2532,"siesta":2533,"siestaoutputformat":2534,"siestaaimdoutputformat":2535,"_e":2536,"_f":2537,"_v":2538,"obtain_frame":2539,"from_siesta_aimd_output":2540,"get_aimd_frame":2541,"vaspposcarformat":2542,"vaspstringformat":2543,"outcar":2544,"xml":2545,"vaspoutcarformat":2546,"vaspxmlformat":2547,"uniq_atom_names":2548,"contcar":2549,"ml":2550,"analyze":2551,"apply":2552,"xyzformat":2553,"quipgapxyzformat":2554,"quip_gap_xyz":2555,"quipgapxyzsystems":2556,"format_single_frame":2557,"xyz_to_coord":2558,"foramt":2559,"quip":2560,"gap":2561,"extxyz":2562,"gpumd":2563,"nequip":2564,"mace":2565,"handler":2566,"frame_lines":2567,"iobase":2568,"endswith":2569,"truncate":2570,"handlers":2571,"angston":2572,"template":2573,"gradient_write":2574,"wfn":2575,"wb97m":2576,"d3bj":2577,"return_wfn":2578,"print_out":2579,"9f":2580,"length_unit":2581,"_to_system_data_lower":2582,"gg":2583,"tmpv":2584,"tmpn":2585,"skip_zeros":2586,"16e":2587,"atype_idx":2588,"sort_idx":2589,"mergesort":2590,"lexsort":2591,"symbal":2592,"posi_list":2593,"system_info":2594,"get_movement_block":2595,"nelm":2596,"iteration":2597,"nonperiodic_position":2598,"all_atomic_energy":2599,"atomic_energy":2600,"sc_index":2601,"ek":2602,"npt":2603,"tmp_v":2604,"tmp_l":2605,"160":2606,"de":2607,"lacking":2608,"minus":2609,"protect_layer":2610,"counter":2611,"elem_mol":2612,"site":2613,"sites":2614,"elem_counter":2615,"tmpcoord":2616,"cart_coords":2617,"h_cell_size":2618,"center_of_mass":2619,"datadict":2620,"specie":2621,"symbol_set":2622,"partial":2623,"get_block":2624,"get_coords":2625,"_qe_block_keywords":2626,"k_points":2627,"additional_k_points":2628,"cell_parameters":2629,"constraints":2630,"occupations":2631,"atomic_velocities":2632,"atomic_forces":2633,"solvents":2634,"hubbard":2635,"blk_idx":2636,"ibrav":2637,"yet":2638,"crystal":2639,"acting":2640,"outname":2641,"inname":2642,"load_key":2643,"load_block":2644,"convert_celldm":2645,"load_cell_parameters":2646,"load_atom_names":2647,"load_celldm":2648,"load_atom_types":2649,"_load_pos_block":2650,"gpa2evperbohr":2651,"cel":2652,"convertion":2653,"nat":2654,"ntyp":2655,"newline":2656,"load_pos":2657,"nw":2658,"csteps":2659,"tmp_steps":2660,"transpose":2661,"int_id":2662,"step_id":2663,"difference":2664,"locates":2665,"stress_fname":2666,"vsteps":2667,"revert":2668,"volumes":2669,"nf":2670,"esteps":2671,"evp":2672,"fsteps":2673,"nacl":2674,"get_explicit_valence":2675,"regularize_formal_charges":2676,"assign_formal_charge_for_atom":2677,"print_bonds":2678,"print_atoms":2679,"is_terminal_oxygen":2680,"get_terminal_oxygens":2681,"is_terminal_nr2":2682,"exp_val_calculated_from_bonds":2683,"getbondtypeasdouble":2684,"getbonds":2685,"exp_val":2686,"getexplicitvalence":2687,"valence":2688,"inconsistent":2689,"getsymbol":2690,"getidx":2691,"regularize":2692,"getatoms":2693,"sanitizemol":2694,"assigen":2695,"setformalcharge":2696,"debugger":2697,"getbondtype":2698,"getformalcharge":2699,"o_atom":2700,"n_atom":2701,"get_terminal_nr2s":2702,"sanitize_phosphate_patom":2703,"p_atom":2704,"sanitize_phosphate":2705,"sanitize_sulfate_satom":2706,"s_atom":2707,"sanitize_sulfate":2708,"sanitize_carboxyl_catom":2709,"sanitize_carboxyl":2710,"sanitize_guanidine_catom":2711,"getneighbors":2712,"terminal_oxygens":2713,"nei":2714,"terminal_nr2s":2715,"getowningmol":2716,"phospate":2717,"sanitizing":2718,"bond1":2719,"getbondbetweenatoms":2720,"setbondtype":2721,"bondtype":2722,"sulfate":2723,"c_atom":2724,"sanitize_guanidine":2725,"sanitize_nitro_natom":2726,"sanitize_nitro":2727,"is_terminal_nitrogen":2728,"sanitize_nitrine_natom":2729,"contain_hetero_aromatic":2730,"regularize_carbon_bond_order":2731,"carbonxyl":2732,"bond2":2733,"guanidyl":2734,"bond3":2735,"nitro":2736,"regularize_nitrogen_bond_order":2737,"sanitize_mol":2738,"mol_edit_log":2739,"kekulize_aromatic_heterocycles":2740,"convert_by_obabel":2741,"nei1":2742,"nei2":2743,"n_terminal":2744,"n_non_terminal":2745,"detecting":2746,"nitrine":2747,"fixing":2748,"getisaromatic":2749,"carbon":2750,"double_bond_idx":2751,"nitrogen":2752,"o_atoms":2753,"feprep":2754,"mol_in":2755,"assign_formal_charge":2756,"search_and_assign_ring":2757,"ring":2758,"hetero":2759,"forward":2760,"start_switch":2761,"print_bondtypes":2762,"rings":2763,"hetero_priority":2764,"super_sanitize_mol":2765,"hasprop":2766,"edit":2767,"setprop":2768,"d_":2769,"edited":2770,"getprop":2771,"rwmol":2772,"rdmolops":2773,"getsymmsssr":2774,"lring":2775,"n_edit":2776,"n_double":2777,"btype":2778,"getatomwithidx":2779,"sym":2780,"car":2781,"har":2782,"ballar":2783,"ballc":2784,"hetrerocycles":2785,"heterocycles":2786,"cring":2787,"hasdouble":2788,"fusecar":2789,"fusedouble":2790,"atom_bonds":2791,"n_targetdouble":2792,"n_targetedit":2793,"hetero_prior":2794,"d1":2795,"e1":2796,"d2":2797,"e2":2798,"forward_btype":2799,"backward_btype":2800,"cache_dir":2801,"getcwd":2802,"cache":2803,"obabel_path":2804,"obabel":2805,"sanitizeerror":2806,"manual":2807,"kekulization":2808,"replaceatom":2809,"mol_edited":2810,"getmol":2811,"assignment":2812,"mkdir":2813,"mol_file_in":2814,"mol_file_out":2815,"_obabel":2816,"kekulize":2817,"obconversion":2818,"setinandoutformats":2819,"readfile":2820,"writefile":2821,"mol_obabel":2822,"stage":2823,"hermite":2824,"our":2825,"mol_copy":2826,"success":2827,"maybe":2828,"_check_level":2829,"_handle_exception":2830,"error_info":2831,"assign":2832,"rightness":2833,"phosphate":2834,"guanidine":2835,"pyridine":2836,"oxide":2837,"call":2838,"pre":2839,"strict":2840,"occurs":2841,"check_same_atom":2842,"check_molecule_list":2843,"num_confs":2844,"getpositions":2845,"getconformers":2846,"getbeginatomidx":2847,"getendatomidx":2848,"int32":2849,"conformers":2850,"mol_ed":2851,"addatom":2852,"bond_info":2853,"addbond":2854,"atom_1":2855,"atom_2":2856,"mol_1":2857,"mol_2":2858,"bond_1":2859,"bond_2":2860,"begin_atom_1":2861,"end_atom_1":2862,"begin_atom_2":2863,"end_atom_2":2864,"get_single_line_tail":2865,"fin":2866,"extract_keyword":2867,"down_line_num":2868,"begin_column":2869,"read_column_num":2870,"is_repeated_read":2871,"column_num":2872,"obtain_nframe":2873,"get_atom_types":2874,"atomnums":2875,"get_atom_name":2876,"atomtypes":2877,"get_virial":2878,"covert_dimension":2879,"ev2ev":2880,"ang2ang":2881,"part_res":2882,"temp":2883,"atomnum":2884,"row":2885,"nxet":2886,"part_ret":2887,"extr_frame":2888,"aimd":2889,"isalpha":2890,"static":2891,"ang":2892,"pressure":2893,"covert_type":2894,"outcoor":2895,"atomtype":2896,"arr":2897,"viri":2898,"vols":2899,"1ev":2900,"60217":2901,"8pa":2902,"602176621e3":2903,"numberofspecies":2904,"redata":2905,"tot_natoms":2906,"outcell":2907,"e_ks":2908,"compatible":2909,"b4":2910,"calucate":2911,"mae":2912,"rmse":2913,"errorsbase":2914,"metaclass":2915,"abcmeta":2916,"system_1":2917,"system_type":2918,"system_2":2919,"e_errors":2920,"f_errors":2921,"e_mae":2922,"e_rmse":2923,"f_mae":2924,"f_rmse":2925,"functools":2926,"lru_cache":2927,"multierrors":2928,"mean":2929,"squared":2930,"deviations":2931,"labeledsystems":2932,"referenced":2933,"predicted":2934,"4f":2935,"ravel":2936,"ss1":2937,"ss2":2938,"load_format":2939,"hashlib":2940,"get_cell_perturb_matrix":2941,"get_atom_perturb_vector":2942,"iterable":2943,"literal":2944,"overload":2945,"loaded":2946,"add_atom_names":2947,"elements_index_map":2948,"utf8len":2949,"concept":2950,"produced":2951,"among":2952,"noted":2953,"restrictions":2954,"infered":2955,"extension":2956,"quantum":2957,"espresso":2958,"denotes":2959,"obtained":2960,"replacing":2961,"being":2962,"boolean":2963,"request":2964,"__getitem__":2965,"cases":2966,"customized":2967,"__len__":2968,"nunlabeled":2969,"proerty":2970,"indent":2971,"map_atom_types":2972,"as_dict":2973,"self_copy":2974,"other_copy":2975,"ii_copy":2976,"unspported":2977,"yaml":2978,"monty":2979,"serialization":2980,"dumpfn":2981,"map_dict":2982,"new_atom_types":2983,"_set1":2984,"_set2":2985,"issubset":2986,"rebuild":2987,"loadfn":2988,"construct":2989,"instance":2990,"montydecoder":2991,"decoded":2992,"process_decoded":2993,"__module__":2994,"subsystem":2995,"array_like":2996,"integral":2997,"axis_nframes":2998,"new_shape":2999,"check_type_map":3000,"uniq_formula":3001,"prevent":3002,"modified":3003,"sort_atom_types":3004,"eq":3005,"exist":3006,"concat":3007,"appended":3008,"cancel":3009,"short_formula":3010,"mixed_token":3011,"type_index":3012,"reorder":3013,"accoarding":3014,"alphabetical":3015,"customize":3016,"maintain":3017,"recommended":3018,"complexsystems":3019,"applied":3020,"axis_natoms":3021,"formula_hash":3022,"short_name":3023,"affine_map":3024,"trans":3025,"c3h5o2":3026,"short":3027,"hash":3028,"sha256":3029,"encode":3030,"utf":3031,"hexdigest":3032,"255":3033,"system1":3034,"system2":3035,"system3":3036,"definition":3037,"revises":3038,"cubic":3039,"ensures":3040,"translates":3041,"protect":3042,"layer":3043,"_shift_orig_zero":3044,"rot_frame_lower_triangular":3045,"replicate":3046,"ncopy":3047,"qq":3048,"rr":3049,"become":3050,"supercell":3051,"copys":3052,"replication":3053,"prod":3054,"initial_atom_type":3055,"end_atom_type":3056,"replace_num":3057,"perturb":3058,"pert_num":3059,"cell_pert_fraction":3060,"atom_pert_distance":3061,"atom_pert_style":3062,"atom_pert_prob":3063,"shuffle":3064,"initial_atom_index":3065,"max_replace_num":3066,"available":3067,"may_replace_indices":3068,"to_replace_indices":3069,"random":3070,"choice":3071,"end_atom_index":3072,"randomly":3073,"deformed":3074,"displaced":3075,"distance":3076,"copies":3077,"perturbed":3078,"means":3079,"returned":3080,"frame_num":3081,"fraction":3082,"determines":3083,"how":3084,"relatively":3085,"deform":3086,"identity":3087,"perturbation":3088,"part":3089,"subject":3090,"uniform":3091,"distribution":3092,"off":3093,"far":3094,"avaliable":3095,"chi":3096,"freedom":3097,"normalization":3098,"atom_pert_fraction":3099,"side_length":3100,"uniformly":3101,"balls":3102,"treated":3103,"obviously":3104,"const":3105,"proportion":3106,"perturbed_system":3107,"tmp_system":3108,"cell_perturb_matrix":3109,"pert_natoms":3110,"pert_atom_id":3111,"atom_perturb_vector":3112,"pick_atom_idx":3113,"setter":3114,"permutation":3115,"passing":3116,"frozen_model_compressed":3117,"boolen":3118,"new_sys":3119,"recalculate":3120,"bincount":3121,"minlength":3122,"remove_atom_names":3123,"pass_coords":3124,"tip4p":3125,"ew":3126,"removed_atom_idx":3127,"picked_atom_idx":3128,"bool_":3129,"let":3130,"rearrange":3131,"new_atom_names":3132,"multisystem":3133,"independent":3134,"ms":3135,"sub_s":3136,"computed":3137,"pararrel":3138,"regiestered":3139,"all_dtypes":3140,"dtypes_dict":3141,"twice":3142,"definitions":3143,"newly":3144,"get_cls_name":3145,"add_format_methods":3146,"e0":3147,"rand":3148,"cell_pert_matrix":3149,"random_vector":3150,"randn":3151,"random_unit_vector":3152,"v0":3153,"power":3154,"logs":3155,"initio":3156,"dynamics":3157,"restarted":3158,"atom_pref":3159,"has_virial":3160,"affine_map_fv":3161,"correction":3162,"remove_outlier":3163,"nlabeled":3164,"status":3165,"yes":3166,"nincluding":3167,"hl_sys":3168,"kept":3169,"replaced":3170,"user":3171,"sure":3172,"itself":3173,"corrected_sys":3174,"corrected":3175,"high_sys":3176,