{"auto":0,"test":1,"md":2,"sections":3,"autotest":4,"overview":5,"deep":6,"generator":7,"relaxation":8,"suppose":9,"we":10,"have":11,"potential":12,"can":13,"dft":14,"dp":15,"meam":16,"helps":17,"us":18,"automatically":19,"calculate":20,"properties":21,"configurations":22,"folder":23,"where":24,"runs":25,"called":26,"working":27,"directory":28,"different":29,"potentials":30,"should":31,"tested":32,"directories":33,"property":34,"three":35,"steps":36,"make":37,"run":38,"post":39,"prepares":40,"all":41,"computational":42,"tasks":43,"needed":44,"example":45,"eos":46,"series":47,"each":48,"which":49,"has":50,"scaled":51,"configuration":52,"certain":53,"volume":54,"necessary":55,"input":56,"files":57,"starting":58,"vasp":59,"abacus":60,"lammps":61,"calculations":62,"sends":63,"remote":64,"resources":65,"defined":66,"machine":67,"file":68,"like":69,"json":70,"collects":71,"results":72,"when":73,"finish":74,"calculates":75,"desired":76,"from":77,"collected":78,"structure":79,"carried":80,"out":81,"before":82,"calculating":83,"other":84,"bash":85,"dpgen":86,"relax":87,"some":88,"reasons":89,"main":90,"program":91,"terminated":92,"stage":93,"one":94,"easily":95,"restart":96,"same":97,"command":98,"parameter":99,"deepmd":100,"given":101,"structures":102,"confs":103,"mp":104,"interaction":105,"type":106,"model":107,"frozen_model":108,"pb":109,"type_map":110,"al":111,"mg":112,"key":113,"provides":114,"provided":115,"options":116,"task":117,"now":118,"six":119,"types":120,"implemented":121,"package":122,"eam_fs":123,"eam_alloy":124,"inter":125,"format":126,"containing":127,"parameters":128,"written":129,"after":130,"give":131,"examples":132,"part":133,"below":134,"default":135,"potcar_prefix":136,"incar":137,"vasp_input":138,"potcars":139,"potcar":140,"path":141,"orb_files":142,"deepks_desc":143,"deepks_model":144,"abacus_input":145,"pseudo_potential":146,"numerical_orb":147,"atom_masses":148,"26":149,"9815":150,"24":151,"305":152,"jle":153,"orb":154,"ptg":155,"only":156,"used":157,"please":158,"sure":159,"user":160,"meamc":161,"https":162,"sandia":163,"gov":164,"doc":165,"packages_details":166,"html":167,"pkg":168,"already":169,"been":170,"installed":171,"lib":172,"almg":173,"manybody":174,"eam":175,"fs":176,"alloy":177,"supported":178,"elastic":179,"vacancy":180,"interstitial":181,"surface":182,"gamma":183,"tests":184,"done":185,"first":186,"present":187,"corresponding":188,"relax_task":189,"named":190,"step":191,"multiple":192,"performed":193,"simultaneously":194,"operations":195,"namely":196,"here":197,"take":198,"poscar":199,"conf":200,"lmp":201,"interatomic":202,"generated":203,"eos_00":204,"jobs":205,"would":206,"dispatched":207,"according":208,"calculation":209,"sent":210,"back":211,"process":212,"result":213,"txt":214,"also":215,"get":216,"started":217,"equation":218,"state":219,"energies":220,"most":221,"stable":222,"function":223,"users":224,"refer":225,"figure":226,"cpc":227,"paper":228,"www":229,"sciencedirect":230,"com":231,"science":232,"article":233,"pii":234,"s001046552030045x":235,"via":236,"3dihub":237,"more":238,"information":239,"std":240,"vol_start":241,"vol_end":242,"vol_step":243,"01":244,"relative":245,"equilibrium":246,"increment":247,"biggest":248,"smaller":249,"than":250,"contcar":251,"must":252,"previous":253,"section":254,"do":255,"40":256,"000000":257,"000001":258,"000039":259,"suffix":260,"00":261,"possible":262,"refine":263,"later":264,"empty":265,"old":266,"including":267,"deleted":268,"orig":269,"link":270,"scale":271,"calculated":272,"vol_current":273,"vol_equi":274,"per":275,"atom":276,"current":277,"poscar_scale":278,"auto_test":279,"module":280,"help":281,"generate":282,"every":283,"processing":284,"go":285,"let":286,"100":287,"reading":288,"determined":289,"energy":290,"force":291,"further":292,"obtained":293,"appending":294,"dict":295,"list":296,"e1":297,"fx1":298,"fy1":299,"fz1":300,"e2":301,"fx2":302,"fy2":303,"fz2":304,"e40":305,"fx40":306,"fy40":307,"fz40":308,"id":309,"above":310,"finally":311,"14":312,"808453313267595":313,"7194474":314,"972991683415014":315,"7242038":316,"17":317,"934682346068534":318,"7087655":319,"onf_dir":320,"root":321,"auto_test_example":322,"fcc":323,"vpa":324,"epa":325,"ev":326,"808":327,"7194":328,"973":329,"7242":330,"935":331,"7088":332,"work":333,"form":334,"dispatch":335,"through":336,"individual":337,"submit":338,"mechanical":339,"include":340,"constants":341,"c11":342,"c66":343,"bulk":344,"modulus":345,"bv":346,"shear":347,"gv":348,"youngs":349,"poission":350,"ratio":351,"uv":352,"crystal":353,"norm_deform":354,"shear_deform":355,"values":356,"1e":357,"respectively":358,"norm_strains":359,"shear_strains":360,"norm_def":361,"shear_def":362,"deformedstructureset":363,"pymatgen":364,"analysis":365,"elasticity":366,"strain":367,"org":368,"set":369,"independently":370,"deformed":371,"equi":372,"stress":373,"record":374,"elastic_00":375,"init_from_suffix":376,"output_suffix":377,"follows":378,"else":379,"doing":380,"isif":381,"following":382,"units":383,"metal":384,"dimension":385,"boundary":386,"atom_style":387,"atomic":388,"box":389,"tilt":390,"large":391,"read_data":392,"mass":393,"neigh_modify":394,"delay":395,"check":396,"pair_style":397,"pair_coeff":398,"compute":399,"mype":400,"pe":401,"thermo":402,"thermo_style":403,"custom":404,"pxx":405,"pyy":406,"pzz":407,"pxy":408,"pxz":409,"pyz":410,"lx":411,"ly":412,"lz":413,"vol":414,"c_mype":415,"dump":416,"xs":417,"ys":418,"zs":419,"fx":420,"fy":421,"fz":422,"min_style":423,"cg":424,"minimize":425,"000000e":426,"10":427,"5000":428,"500000":429,"variable":430,"equal":431,"count":432,"print":433,"total":434,"number":435,"atoms":436,"final":437,"xx":438,"yy":439,"zz":440,"xy":441,"xz":442,"yz":443,"elastictensor":444,"tensor":445,"output":446,"elastic_tensor":447,"134":448,"90955999999997":449,"54":450,"329958699999985":451,"51":452,"802386099999985":453,"5745279599999993":454,"3886325999999648e":455,"05":456,"9638233999999486e":457,"55840299999999":458,"59654699999996":459,"7972336":460,"53972684":461,"839568799999963e":462,"756799399999951e":463,"91324859999999":464,"913292199999994":465,"137":466,"01763799999998":467,"090339399999969e":468,"99251629999996e":469,"736478699999946e":470,"8780564440000007":471,"770445632":472,"2766205999999956":473,"35":474,"41343199999999":475,"2479590800000023e":476,"3837692000000172e":477,"06":478,"959999999495933e":479,"5800000003918792e":480,"4800000030874965e":481,"9000000008417968e":482,"375960199999994":483,"8608356":484,"02554856":485,"38":486,"375018399999995":487,"80":488,"3153630222222":489,"40582656":490,"99":491,"37716395728943":492,"2937771799031088":493,"order":494,"c12":495,"c16":496,"c21":497,"c22":498,"c26":499,"unit":500,"gpa":501,"91":502,"33":503,"57":504,"56":505,"60":506,"02":507,"88":508,"77":509,"28":510,"41":511,"86":512,"03":513,"32":514,"29":515,"very":516,"similar":517,"operation":518,"except":519,"difference":520,"adding":521,"need":522,"supercell":523,"value":524,"insert_ele":525,"element":526,"added":527,"conf_filters":528,"min_dist":529,"cal_setting":530,"input_prop":531,"lammps_input":532,"lammps_high":533,"add":534,"eliminate":535,"undesirable":536,"render":537,"rather":538,"difficult":539,"convergence":540,"means":541,"smallest":542,"distance":543,"less":544,"angstrom":545,"eliminated":546,"interstitialgenerator":547,"defects":548,"generators":549,"appended":550,"meet":551,"requirements":552,"true":553,"reprod":554,"opt":555,"false":556,"reproduce":557,"interstitial_00":558,"removing":559,"change_box":560,"between":561,"without":562,"022952000000004":563,"84773":564,"104":565,"870682":566,"7829520000000088":567,"102":568,"08773":569,"struct":570,"inter_e":571,"equi_e":572,"023":573,"848":574,"871":575,"783":576,"088":577,"start_confs_path":578,"min_slab_size":579,"min_vacuum_size":580,"11":581,"max_miller":582,"cal_type":583,"static":584,"lattice_type":585,"miller_index":586,"displace_direction":587,"supercell_size":588,"add_fix":589,"n_steps":590,"20":591,"universal":592,"words":593,"data":594,"description":595,"string":596,"skip":597,"boolean":598,"whether":599,"start":600,"commands":601,"overwrite_interaction":602,"overwrite":603,"apply":604,"float":605,"related":606,"vol_abs":607,"treat":608,"absolute":609,"deformation":610,"directions":611,"int":612,"constructed":613,"inserted":614,"filter":615,"bcc_self":616,"self":617,"bcc":618,"minimum":619,"size":620,"slab":621,"thickness":622,"vacuum":623,"width":624,"pert_xz":625,"perturbation":626,"direction":627,"maximum":628,"miller":629,"index":630,"slip":631,"plane":632,"line":633,"fix":634,"standard":635,"method":636,"points":637,"000019":638,"records":639,"000023":640,"vacancy_00":641,"surface_00":642,"tmp":643,"000008":644,"use":645,"nohup":646,"ali":647,"log":648,"outlog":649,"sometimes":650,"want":651,"higher":652,"criteria":653,"ediff":654,"ediffg":655,"new":656,"scratch":657,"vacancy_01":658,"based":659,"using":660,"tree":661,"established":662,"links":663,"name":664,"taken":665,"either":666,"two":667,"relax_pos":668,"relax_shape":669,"relax_vol":670,"encut":671,"650":672,"kspacing":673,"kgamma":674,"see":675,"prefix":676,"setting":677,"position":678,"shape":679,"in_lammps":680,"etol":681,"ftol":682,"maxiter":683,"maximal":684,"starts":685,"others":686,"stopping":687,"tolerance":688,"max":689,"iterations":690,"minimizer":691,"maxeval":692,"evaluations":693,"changes":694,"addition":695,"storing":696,"single":697,"system":698,"doesn":699,"exist":700,"hcp":701,"dhcp":702,"diamond":703,"sc":704,"conditions":705,"multi":706,"component":707,"terminate":708,"error":709,"kpoints":710,"dictionary":711,"fix_box_relax":712,"clear":713,"982":714,"iso":715,"aniso":716,"tmplx":717,"tmply":718,"aa":719,"base":720,"area":721,"jr":722,"stores":723,"cell":724,"coordinates":725,"virial":726,"frame":727,"trajectory":728,"dpdata":729,"class":730,"labeledsystem":731,"atom_numbs":732,"atom_names":733,"atom_types":734,"numpy":735,"array":736,"dtype":737,"int64":738,"cells":739,"float64":740,"8637824638":741,"4318912319":742,"4801083646":743,"8267027882":744,"3382685902":745,"8549207998018438":746,"4274603999009239":747,"472433938457684":748,"4274603999009212":749,"8241446461525599":750,"331033071844216":751,"854920788303194":752,"427460394144466":753,"472433928487206":754,"427460394154763":755,"8241446428350139":756,"331033062460779":757,"coords":758,"709841595683707e":759,"25":760,"3367974740910857e":761,"19":762,"673606219968035e":763,"673619637565944e":764,"673610853102186e":765,"745029":766,"7453815":767,"forces":768,"93889e":769,"18":770,"46945e":771,"38778e":772,"73472e":773,"51028e":774,"virials":775,"07534992071654338":776,"2156615579052586e":777,"3904892126132796e":778,"61571024026576e":779,"12":780,"978994290457664e":781,"08":782,"396452753975288e":783,"15":784,"785831629151552e":785,"16":786,"991375413666671e":787,"4790751628409565e":788,"973497959053003e":789,"506940521266962e":790,"1152016233536118e":791,"231900529157644e":792,"517665029355618e":793,"33706710415926e":794,"0011471096530724e":795,"2692250000000005":796,"1727839e":797,"3414452e":798,"4529093000000003e":799,"71695e":800,"3072633e":801,"13":802,"5551193e":803,"729006000000001e":804,"3351969e":805,"711598e":806,"4673689e":807,"09":808,"0859169e":809,"0157343e":810,"3465139e":811,"1706584e":812,"8698191e":813,"applied":814,"eg":815,"gpu":816,"cpu":817,"submitted":818,"make_dispatcher":819,"github":820,"deepmodeling":821,"blob":822,"master":823,"dispatcher":824,"py":825,"initial":826,"cross":827,"validation":828,"version":829,"accomplish":830,"successfully":831,"init_data_path":832,"reprod_last_frame":833,"denotes":834,"reproduced":835,"case":836,"stored":837,"interstitial_reprod":838,"last":839,"000038":840,"singe":841,"split":842,"initial_path":843,"init_e":844,"reprod_e":845,"020":846,"240":847,"220":848,"539":849,"541":850,"002":851,"582":852,"001":853,"581":854,"594":855,"593":856,"598":857,"597":858,"600":859,"601":860,"602":861,"603":862,"345":863,"372":864,"027":865,"546":866,"556":867,"009":868,"587":869,"007":870,"599":871,"006":872,"606":873,"624":874,"631":875,"634":876,"640":877,"637":878,"644":879,"638":880,"645":881,"639":882,"646":883,"comparison":884,"well":885,"recorded":886,"nframes":887,"0009738182472213228":888,"21":889,"0006417039154057605":890,"disregarded":891,"frames":892,"considered":893,"perturbations":894,"around":895,"bug":896,"generate_all_slabs":897,"core":898,"otherwise":899,"divided":900,"8051037974207992":901,"6035018":902,"9913881928811771":903,"5781115999999997":904,"000002":905,"9457333586026173":906,"5529366000000002":907,"000003":908,"9868013100872397":909,"5590607142857142":910,"000004":911,"0138239046484236":912,"563035875":913,"000005":914,"0661817319108005":915,"5432459166666668":916,"000006":917,"034003253044026":918,"550884125":919,"000007":920,"9569958287615818":921,"5685403333333334":922,"9432935501134583":923,"5774615714285716":924,"miller_indices":925,"surf_e":926,"equi_epa":927,"805":928,"604":929,"745":930,"991":931,"578":932,"946":933,"553":934,"987":935,"559":936,"014":937,"563":938,"066":939,"543":940,"034":941,"551":942,"957":943,"569":944,"943":945,"577":946,"vacancygenerator":947,"evoked":948,"7352769999999964":949,"96":950,"644642":951,"97":952,"379919":953,"vac_e":954,"735":955,"380":956,"black":957,"blank":958,"sphinx":959,"build":960,"cli":961,"interface":962,"code":963,"look":964,"home":965,"page":966,"gen":967,"citation":968,"cff":969,"conda":970,"dist":971,"egg":972,"info":973,"license":974,"readme":975,"setup":976,"unittest":977,"tools":978,"developers":979,"templates":980,"param":981,"software":982,"versions":983,"details":984,"you":985,"chapters":986,"document":987,"confused":988,"about":989,"how":990,"up":991,"dpgui":992,"mobile":993,"functions":994,"open":995,"arginfo":996,"collect":997,"database":998,"_date":999,"__init__":1000,"__pycache__":1001,"simplify":1002,"util":1003,"_version":1004,"corresponds":1005,"undertaking":1006,"materials":1007,"init_bulk":1008,"init_surf":1009,"init_reaction":1010,"preparing":1011,"surf":1012,"systems":1013,"source":1014,"collecting":1015,"submiting":1016,"scripts":1017,"maintaining":1018,"job":1019,"queues":1020,"notice":1021,"hase":1022,"integrated":1023,"dpdispatcher":1024,"ch4":1025,"find":1026,"make_train":1027,"run_train":1028,"post_fp":1029,"common":1030,"errors":1031,"found":1032,"xxx":1033,"dargs":1034,"argumentkeyerror":1035,"location":1036,"undefined":1037,"allowed":1038,"strict":1039,"mode":1040,"argumenttypeerror":1041,"gets":1042,"wrong":1043,"requires":1044,"filenotfounderror":1045,"errno":1046,"model_devi":1047,"graph":1048,"decoder":1049,"jsondecodeerror":1050,"oserror":1051,"cannot":1052,"valid":1053,"your":1054,"runtimeerror":1055,"xxxxxxx":1056,"failed":1057,"times":1058,"too":1059,"many":1060,"unsuccessfully":1061,"sorted":1062,"alphabetically":1063,"environment":1064,"unavailable":1065,"may":1066,"because":1067,"activated":1068,"chosen":1069,"image":1070,"since":1071,"avoid":1072,"misleading":1073,"older":1074,"keys":1075,"ignored":1076,"absorbed":1077,"settings":1078,"expected":1079,"differs":1080,"those":1081,"occur":1082,"finds":1083,"fashion":1084,"try":1085,"deleting":1086,"annotating":1087,"correspondingly":1088,"modulate":1089,"newest":1090,"could":1091,"docs":1092,"projects":1093,"en":1094,"latest":1095,"maybe":1096,"youhave":1097,"superfluous":1098,"parentheses":1099,"occurs":1100,"incorrect":1101,"mistake":1102,"syntax":1103,"missing":1104,"comma":1105,"dataset":1106,"correctly":1107,"note":1108,"init_data_sys":1109,"while":1110,"sys_configs":1111,"dimensional":1112,"sys_idx":1113,"second":1114,"level":1115,"poscars":1116,"under":1117,"group":1118,"sample":1119,"dp2":1120,"param_ch4_deepmd":1121,"kit":1122,"handle":1123,"unexpected":1124,"submission":1125,"debug":1126,"remote_root":1127,"xxxxxx":1128,"submission_hash":1129,"dirs":1130,"mentioned":1131,"he":1132,"she":1133,"advised":1134,"server":1135,"shows":1136,"shown":1137,"reason":1138,"train":1139,"tell":1140,"manually":1141,"sub":1142,"script":1143,"whose":1144,"time":1145,"hash":1146,"collide":1147,"fixed":1148,"something":1149,"causes":1150,"fail":1151,"larger":1152,"ratio_failure":1153,"high":1154,"valueerror":1155,"load":1156,"picked":1157,"allow_picked":1158,"warnings":1159,"warn":1160,"gromacs":1161,"were":1162,"ensure":1163,"write":1164,"correct":1165,"excess":1166,"ignore":1167,"warning":1168,"don":1169,"just":1170,"show":1171,"contributing":1172,"guide":1173,"contribute":1174,"way":1175,"contributions":1176,"making":1177,"pull":1178,"requests":1179,"pr":1180,"short":1181,"merged":1182,"div":1183,"align":1184,"center":1185,"href":1186,"sm":1187,"ms":1188,"qt1mwofybqzkgjc":1189,"target":1190,"_blank":1191,"img":1192,"src":1193,"s2":1194,"loli":1195,"net":1196,"2022":1197,"png":1198,"firstly":1199,"fork":1200,"repository":1201,"clone":1202,"branch":1203,"request":1204,"______________________________________________________________________":1205,"welcome":1206,"adopts":1207,"convention":1208,"community":1209,"developer":1210,"development":1211,"coding":1212,"conventions":1213,"read":1214,"collaborating":1215,"proposing":1216,"creating":1217,"idea":1218,"problem":1219,"website":1220,"git":1221,"desktop":1222,"video":1223,"demo":1224,"publishing":1225,"bilitube":1226,"youtube":1227,"dpapc1_ens8":1228,"bvid":1229,"bv1zt411c7wp":1230,"loading":1231,"unpkg":1232,"min":1233,"js":1234,"defer":1235,"never":1236,"remember":1237,"ssh":1238,"configure":1239,"public":1240,"username":1241,"password":1242,"token":1243,"explanation":1244,"blog":1245,"authentication":1246,"2020":1247,"discussion":1248,"staskoverflow":1249,"stackoverflow":1250,"questions":1251,"68775869":1252,"message":1253,"support":1254,"removed":1255,"personal":1256,"solve":1257,"tutorials":1258,"documents":1259,"recommended":1260,"branches":1261,"visually":1262,"shdqxosarm51jqv":1263,"pc":1264,"nmapyxjaqs4dgez":1265,"create":1266,"3eqm162oq8lcg9p":1267,"secondly":1268,"local":1269,"its":1270,"43":1271,"filename":1272,"thirdly":1273,"select":1274,"what":1275,"push":1276,"commit":1277,"press":1278,"publish":1279,"origin":1280,"3dyqakpltnr2tx6":1281,"compare":1282,"uj9m6zgtxrh1l3a":1283,"documentation":1284,"toy":1285,"simply":1286,"put":1287,"toymodels":1288,"category":1289,"instructions":1290,"rst":1291,"preparations":1292,"writing":1293,"tips":1294,"devel":1295,"writingtips":1296,"zepkuj3tdahi57b":1297,"pulls":1298,"modify":1299,"dependencies":1300,"update":1301,"758":1302,"844":1303,"simple":1304,"beginner":1305,"t4zb8uidxgeyyvc":1306,"q3ikvzq8ormfvlt":1307,"modification":1308,"works":1309,"strongly":1310,"visual":1311,"studio":1312,"search":1313,"looking":1314,"procedure":1315,"course":1316,"relevant":1317,"special":1318,"personalized":1319,"modifications":1320,"think":1321,"benefit":1322,"does":1323,"conflict":1324,"optimization":1325,"monitoring":1326,"recovery":1327,"encounter":1328,"judge":1329,"comes":1330,"traceback":1331,"noticed":1332,"folders":1333,"intend":1334,"export":1335,"sync":1336,"finishing":1337,"briefly":1338,"describe":1339,"conclude":1340,"change":1341,"maintainer":1342,"feel":1343,"directly":1344,"checkout":1345,"switching":1346,"bring":1347,"next":1348,"reported":1349,"pushing":1350,"commits":1351,"hint":1352,"python3":1353,"watch":1354,"review":1355,"due":1356,"circumstance":1357,"modified":1358,"submitting":1359,"long":1360,"green":1361,"mark":1362,"title":1363,"webpage":1364,"passed":1365,"pay":1366,"attention":1367,"comments":1368,"conflicts":1369,"them":1370,"everything":1371,"congratulations":1372,"become":1373,"contributor":1374,"credits":1375,"authors":1376,"updated":1377,"api":1378,"changed":1379,"argument":1380,"api_version":1381,"run_mdata":1382,"maintained":1383,"separate":1384,"repo":1385,"readthedocs":1386,"io":1387,"specified":1388,"gurantees":1389,"still":1390,"iteration":1391,"composed":1392,"exploration":1393,"labeling":1394,"training":1395,"accordingly":1396,"parts":1397,"fp":1398,"dicts":1399,"independent":1400,"perform":1401,"workstation":1402,"slurm":1403,"cluster":1404,"pbs":1405,"execute":1406,"specifies":1407,"cloud":1408,"specify":1409,"groups":1410,"nodes":1411,"enable":1412,"virtual":1413,"performing":1414,"batch_type":1415,"shell":1416,"context_type":1417,"local_root":1418,"user1234":1419,"work_path":1420,"number_node":1421,"cpu_per_node":1422,"gpu_per_node":1423,"group_size":1424,"source_list":1425,"env":1426,"scheduling":1427,"transfer":1428,"copying":1429,"moving":1430,"storage":1431,"cp":1432,"mv":1433,"etc":1434,"paths":1435,"located":1436,"therefore":1437,"always":1438,"so":1439,"exists":1440,"cpus":1441,"gpus":1442,"required":1443,"needs":1444,"highlighted":1445,"packed":1446,"models":1447,"trained":1448,"variables":1449,"executed":1450,"queue_name":1451,"queuegpu":1452,"custom_flags":1453,"sbatch":1454,"mem":1455,"32g":1456,"changing":1457,"queue":1458,"additional":1459,"lines":1460,"frequently":1461,"usually":1462,"pack":1463,"accessed":1464,"mpirun":1465,"vasp_std":1466,"sshcontext":1467,"remote_profile":1468,"hostname":1469,"39":1470,"queuecpu":1471,"mpi":1472,"parallel":1473,"computing":1474,"threads":1475,"worth":1476,"noting":1477,"accessible":1478,"connect":1479,"port":1480,"cost":1481,"effective":1482,"explicit":1483,"descriptions":1484,"basics":1485,"taking":1486,"gas":1487,"phase":1488,"methane":1489,"molecule":1490,"v2":1491,"codes":1492,"mass_map":1493,"basic":1494,"run_jdata":1495,"gives":1496,"weights":1497,"init_data_prefix":1498,"init":1499,"01x01x01":1500,"sys":1501,"0004":1502,"0001":1503,"sys_configs_prefix":1504,"scale_pert":1505,"00000":1506,"00001":1507,"numb_models":1508,"default_training_param":1509,"detailed":1510,"model_devi_dt":1511,"model_devi_skip":1512,"model_devi_f_trust_lo":1513,"model_devi_f_trust_hi":1514,"model_devi_clean_traj":1515,"model_devi_jobs":1516,"temps":1517,"trj_freq":1518,"nsteps":1519,"300":1520,"ensemble":1521,"nvt":1522,"_idx":1523,"3000":1524,"model_devi_engine":1525,"timestep":1526,"simulation":1527,"skipped":1528,"saving":1529,"lower":1530,"upper":1531,"bound":1532,"selection":1533,"clean":1534,"traj":1535,"denote":1536,"temperature":1537,"pressure":1538,"bar":1539,"frequency":1540,"saved":1541,"running":1542,"simulations":1543,"integrator":1544,"choose":1545,"save":1546,"30":1547,"max_devi_f":1548,"falls":1549,"candidate":1550,"recent":1551,"integer":1552,"fp_style":1553,"shuffle_poscar":1554,"fp_task_max":1555,"fp_task_min":1556,"fp_pp_path":1557,"fp_pp_files":1558,"fp_incar":1559,"incar_methane":1560,"principles":1561,"psuedo":1562,"labeled":1563,"elements":1564,"correspond":1565,"explained":1566,"detail":1567,"discussions":1568,"issue":1569,"dvrycuwflm4pqni":1570,"everyone":1571,"participate":1572,"ask":1573,"share":1574,"anything":1575,"discuss":1576,"raise":1577,"question":1578,"tutorial":1579,"faqs":1580,"history":1581,"solutions":1582,"tu1drx2l6zo5yfq":1583,"report":1584,"features":1585,"fajxcmwbbjo34y1":1586,"proper":1587,"assign":1588,"yourself":1589,"contribution":1590,"issues":1591,"prepare":1592,"specific":1593,"template":1594,"enhance_sampling":1595,"learn":1596,"jdata":1597,"mdata":1598,"optional":1599,"basically":1600,"four":1601,"denoted":1602,"stages":1603,"place_ele":1604,"perturb":1605,"aimd":1606,"generating":1607,"supercells":1608,"point":1609,"none":1610,"intervention":1611,"involved":1612,"generates":1613,"typical":1614,"cell_type":1615,"latt":1616,"479":1617,"super_cell":1618,"relax_incar":1619,"incar_metal_rlx":1620,"md_incar":1621,"incar_metal_md":1622,"skip_relax":1623,"pert_numb":1624,"md_nstep":1625,"pert_box":1626,"pert_atom":1627,"coll_ndata":1628,"_comment":1629,"from_poscar":1630,"from_poscar_path":1631,"c_mp":1632,"47_conventional":1633,"supports":1634,"both":1635,"principle":1636,"specifying":1637,"init_fp_style":1638,"init_bulk_jdata":1639,"relax_kpt":1640,"md_kpt":1641,"kpt":1642,"omitted":1643,"bohr":1644,"gamma_only":1645,"reaction":1646,"workflow":1647,"initilize":1648,"reactive":1649,"small":1650,"molecules":1651,"introduced":1652,"initialization":1653,"fuels":1654,"2021":1655,"762":1656,"769":1657,"1021":1658,"acs":1659,"energyfuels":1660,"0c03211":1661,"packages":1662,"exploring":1663,"sampling":1664,"mddatasetbuilder":1665,"tongzhugroup":1666,"gaussian":1667,"uses":1668,"reaxff":1669,"pair_reaxff":1670,"reaxmd":1671,"molecular":1672,"clusters":1673,"clustering":1674,"algorithm":1675,"remove":1676,"redundancy":1677,"described":1678,"nature":1679,"communications":1680,"5713":1681,"doi":1682,"1038":1683,"s41467":1684,"19497":1685,"literalinclude":1686,"language":1687,"linenos":1688,"parametes":1689,"genereated":1690,"continue":1691,"concurrent":1692,"learning":1693,"say":1694,"wants":1695,"init_surf_jdata":1696,"pertub":1697,"generally":1698,"lot":1699,"compared":1700,"twice":1701,"once":1702,"rounds":1703,"enough":1704,"lattice":1705,"constant":1706,"made":1707,"prepared":1708,"candidates":1709,"layers":1710,"pert_scaled":1711,"8dea29ef125f66be9641afe5ac4970433a9c9ce1":1712,"l484":1713,"separations":1714,"layer":1715,"periodic":1716,"ways":1717,"interval":1718,"intervals":1719,"layer_numb":1720,"z_min":1721,"vacuum_":1722,"vacuum_min":1723,"vacuum_max":1724,"controlled":1725,"vacuum_resol":1726,"even":1727,"whole":1728,"range":1729,"nearby":1730,"region":1731,"denser":1732,"head":1733,"far":1734,"away":1735,"sparser":1736,"tail":1737,"mid_point":1738,"decide":1739,"vacuum_num":1740,"head_ratio":1741,"vacuum_numb":1742,"attach":1743,"forward_files":1744,"upload":1745,"besides":1746,"vdw_kernal":1747,"bindat":1748,"millers":1749,"incar_metal_rlx_low":1750,"another":1751,"contains":1752,"successive":1753,"undertaken":1754,"heating":1755,"temperatures":1756,"several":1757,"random":1758,"seed":1759,"neural":1760,"network":1761,"represent":1762,"deviation":1763,"dynamics":1764,"accuracy":1765,"criterion":1766,"few":1767,"selected":1768,"accurate":1769,"methods":1770,"obtain":1771,"together":1772,"enter":1773,"resource":1774,"generation":1775,"query":1776,"collection":1777,"expect":1778,"keywords":1779,"general":1780,"sh":1781,"created":1782,"upgraded":1783,"iter":1784,"00000x":1785,"includes":1786,"completed":1787,"ls":1788,"00x":1789,"converted":1790,"000":1791,"concerned":1792,"labels":1793,"serves":1794,"selecting":1795,"shuffle":1796,"condition":1797,"randomly":1798,"rest_accurate":1799,"our":1800,"any":1801,"rest_failed":1802,"shuffled":1803,"inaccurate":1804,"identifies":1805,"numbers":1806,"ranging":1807,"currently":1808,"eachiteration":1809,"post_train":1810,"make_model_devi":1811,"run_model_devi":1812,"post_model_devi":1813,"make_fp":1814,"run_fp":1815,"follow":1816,"rules":1817,"stops":1818,"recover":1819,"purpose":1820,"recovering":1821,"checkpoint":1822,"re":1823,"download":1824,"install":1825,"release":1826,"shields":1827,"svg":1828,"maxage":1829,"86400":1830,"releases":1831,"1016":1832,"107206":1833,"badge":1834,"2fj":1835,"blue":1836,"citations":1837,"njzjz":1838,"win":1839,"dn":1840,"forge":1841,"label":1842,"20install":1843,"anaconda":1844,"pip":1845,"pypi":1846,"dm":1847,"project":1848,"python":1849,"delicately":1850,"designed":1851,"field":1852,"dependent":1853,"highly":1854,"scalable":1855,"softwares":1856,"capable":1857,"maintain":1858,"hpc":1859,"machines":1860,"performance":1861,"analyze":1862,"publication":1863,"cite":1864,"yuzhi":1865,"zhang":1866,"haidi":1867,"wang":1868,"weijie":1869,"chen":1870,"jinzhe":1871,"zeng":1872,"linfeng":1873,"han":1874,"weinan":1875,"platform":1876,"reliable":1877,"computer":1878,"physics":1879,"efficient":1880,"tens":1881,"million":1882,"uniformly":1883,"friendly":1884,"automatic":1885,"succusefully":1886,"hpcs":1887,"thus":1888,"effort":1889,"modularized":1890,"extend":1891,"lsf":1892,"http":1893,"ab":1894,"initio":1895,"pwscf":1896,"cp2k":1897,"siesta":1898,"pwmat":1899,"sincerely":1900,"embraced":1901,"possibilities":1902,"cases":1903,"installation":1904,"successful":1905,"studies":1906,"quick":1907,"handson":1908,"learndoc":1909,"gen_handson":1910,"practical":1911,"guidelines":1912,"casestudies":1913,"suggest":1914,"people":1915,"especially":1916,"who":1917,"newbies":1918,"context":1919,"insights":1920,"kinds":1921,"risks":1922,"difficulties":1923,"advance":1924,"smoothly":1925,"quality":1926,"reliability":1927,"feasibility":1928,"combustion":1929,"introduce":1930,"y_alloy":1931,"configurational":1932,"space":1933,"metallic":1934,"binary":1935,"during":1936,"implement":1937,"pes":1938,"licensed":1939,"gnu":1940,"lgplv3":1941,"lots":1942,"repeated":1943,"deviations":1944,"rest":1945,"confirmed":1946,"pick":1947,"qm7":1948,"011":1949,"008":1950,"999":1951,"065":1952,"pick_data":1953,"jz748":1954,"sys_batch_size":1955,"descriptor":1956,"se_a":1957,"sel":1958,"rcut_smth":1959,"rcut":1960,"neuron":1961,"50":1962,"resnet_dt":1963,"axis_neuron":1964,"fitting_net":1965,"learning_rate":1966,"exp":1967,"start_lr":1968,"stop_lr":1969,"5e":1970,"decay_rate":1971,"loss":1972,"start_pref_e":1973,"limit_pref_e":1974,"start_pref_f":1975,"1000":1976,"limit_pref_f":1977,"start_pref_v":1978,"limit_pref_v":1979,"start_pref_pf":1980,"limit_pref_pf":1981,"numb_steps":1982,"10000":1983,"disp_file":1984,"lcurve":1985,"disp_freq":1986,"numb_test":1987,"save_freq":1988,"disp_training":1989,"time_training":1990,"profiling":1991,"profiling_file":1992,"timeline":1993,"jzzeng":1994,"fp_params":1995,"mn15":1996,"31g":1997,"nosymm":1998,"scf":1999,"maxcyc":2000,"512":2001,"nproc":2002,"multiplicity":2003,"init_pick_number":2004,"iter_pick_number":2005,"45":2006,"simplify_jdata":2007,"recursively":2008,"detects":2009,"npy":2010,"mean":2011,"various":2012,"mlp":2013,"engines":2014,"amber":2015,"interfaces":2016,"integration":2017,"formats":2018,"specifications":2019,"mlp_engine":2020,"modeling":2021,"foundation":2022,"inference":2023,"massively":2024,"simulator":2025,"classical":2026,"focused":2027,"primary":2028,"engine":2029,"integrates":2030,"enables":2031,"restarted":2032,"providing":2033,"robust":2034,"handling":2035,"easy":2036,"building":2037,"executable":2038,"ambermd":2039,"suite":2040,"biomolecular":2041,"programs":2042,"primarily":2043,"biological":2044,"enhanced":2045,"particularly":2046,"useful":2047,"complex":2048,"requiring":2049,"precision":2050,"ambertools":2051,"sander":2052,"calypso":2053,"cn":2054,"prediction":2055,"particle":2056,"swarm":2057,"algorithms":2058,"automates":2059,"discovery":2060,"workflows":2061,"efficiently":2062,"properly":2063,"compatibility":2064,"evaluation":2065,"versatile":2066,"popular":2067,"biochemical":2068,"techniques":2069,"optimized":2070,"standards":2071,"complete":2072,"vienna":2073,"performs":2074,"quantum":2075,"density":2076,"functional":2077,"theory":2078,"widely":2079,"seamlessly":2080,"automated":2081,"parsing":2082,"preparation":2083,"pseudopotential":2084,"custodian":2085,"enabled":2086,"chemistry":2087,"electronic":2088,"flexible":2089,"solution":2090,"g16":2091,"execution":2092,"appropriately":2093,"solid":2094,"atomistic":2095,"mixed":2096,"wave":2097,"basis":2098,"sets":2099,"linear":2100,"scaling":2101,"combined":2102,"qm":2103,"mm":2104,"carefully":2105,"espresso":2106,"cpmd":2107,"extended":2108,"localized":2109,"orbital":2110,"reduced":2111,"involving":2112,"thousands":2113,"exchange":2114,"correlation":2115,"functionals":2116,"suitable":2117,"good":2118,"ustc":2119,"edu":2120,"computation":2121,"excellent":2122,"efficiency":2123,"offers":2124,"flexibility":2125,"appropriate":2126,"nanoscale":2127,"consistent":2128,"extensive":2129,"libraries":2130,"alternative":2131,"proprietary":2132,"provide":2133,"troubleshooting":2134,"cpx":2135,"car":2136,"parrinello":2137,"specifically":2138,"suited":2139,"utilizes":2140,"pseudopotentials":2141,"configured":2142,"electron":2143,"ground":2144,"achieved":2145,"hundred":2146,"minimization":2147,"cautious":2148,"iprint":2149,"nstep":2150,"relaxed":2151,"atomic_positions":2152,"cell_parameters":2153,"cards":2154,"contain":2155,"keyword":2156,"positions":2157,"place":2158,"actual":2159,"vectors":2160,"dprc":2161,"advanced":2162,"acceleration":2163,"capabilities":2164,"implementation":2165,"predictions":2166,"significant":2167,"available":2168,"significantly":2169,"reduce":2170,"diff":2171,"specialized":2172,"within":2173,"structural":2174,"being":2175,"dpamber":2176,"allows":2177,"integrate":2178,"own":2179,"extensible":2180,"framework":2181,"integrating":2182,"research":2183,"prototype":2184,"testing":2185,"definitions":2186,"forward":2187,"backward":2188,"init_batch_size":2189,"sel_a":2190,"verify":2191,"isn":2192,"happen":2193,"batch_size":2194,"happens":2195,"adds":2196,"behaves":2197,"differently":2198,"":2199}