{"pymatgen":0,"alchemy":1,"__init__":2,"py":3,"package":4,"provides":5,"modules":6,"performing":7,"large":8,"scale":9,"transformations":10,"number":11,"structures":12,"filters":13,"defines":14,"class":15,"abstractstructurefilter":16,"msonable":17,"abc":18,"def":19,"test":20,"self":21,"structure":22,"istructure":23,"uses":24,"math":25,"collections":26,"defaultdict":27,"typing":28,"type_checking":29,"monty":30,"json":31,"analysis":32,"structure_matcher":33,"elementcomparator":34,"before":35,"containsspeciefilter":36,"specieproximityfilter":37,"removeduplicatesfilter":38,"module":39,"transmuter":40,"object":41,"from":42,"__future__":43,"import":44,"annotations":45,"structurematcher":46,"core":47,"get_el_sp":48,"symmetry":49,"analyzer":50,"spacegroupanalyzer":51,"typing_extensions":52,"util":53,"specieslike":54,"return":55,"true":56,"when":57,"passed":58,"method":59,"retained":60,"during":61,"transmutation":62,"those":63,"false":64,"removed":65,"abstractmethod":66,"kept":67,"filtering":68,"args":69,"input":70,"returns":71,"bool":72,"passes":73,"filter":74,"scope":75,"species":76,"strict_compare":77,"exclude":78,"__repr__":79,"as_dict":80,"dict":81,"from_dict":82,"cls":83,"dct":84,"after":85,"removeexistingfilter":86,"containing":87,"certain":88,"elements":89,"default":90,"compares":91,"atomic":92,"list":93,"look":94,"whether":95,"all":96,"must":97,"present":98,"pass":99,"fail":100,"objects":101,"specie":102,"element":103,"any":104,"excludes":105,"them":106,"_species":107,"map":108,"type":109,"ignore":110,"arg":111,"_strict":112,"_and":113,"_exclude":114,"does":115,"contain":116,"specified":117,"set":118,"up":119,"lists":120,"compare":121,"filter_set":122,"sp":123,"structure_set":124,"else":125,"we":126,"aren":127,"excluding":128,"since":129,"one":130,"otherwise":131,"join":132,"parameters":133,"get":134,"__module__":135,"__name__":136,"init_args":137,"str":138,"classmethod":139,"representation":140,"specie_and_min_dist_dict":141,"chargebalancefilter":142,"removes":143,"have":144,"too":145,"close":146,"together":147,"string":148,"float":149,"mapping":150,"example":151,"na":152,"means":153,"ions":154,"least":155,"angstrom":156,"away":157,"each":158,"other":159,"multiple":160,"criteria":161,"can":162,"applied":163,"note":164,"testing":165,"done":166,"based":167,"actual":168,"you":169,"use":170,"instead":171,"specie_and_min_dist":172,"items":173,"within":174,"distances":175,"all_species":176,"site":177,"sp_to_test":178,"intersection":179,"max_r":180,"max":181,"neighbors":182,"get_neighbors":183,"nn_site":184,"dist":185,"none":186,"symprec":187,"get_spg_num":188,"struct":189,"int":190,"speciesmaxdistfilter":191,"exact":192,"duplicate":193,"remove":194,"matcher":195,"given":196,"optional":197,"used":198,"comparison":199,"precision":200,"finder":201,"algorithm":202,"value":203,"check":204,"performed":205,"only":206,"recommended":207,"1e":208,"structure_list":209,"isinstance":210,"raise":211,"typeerror":212,"comparator":213,"hash_comp":214,"_comparator":215,"get_hash":216,"composition":217,"append":218,"get_space_group_number":219,"fit":220,"existing_structures":221,"get_sg":222,"existing":223,"charge":224,"balanced":225,"works":226,"oxidation":227,"state":228,"decorated":229,"elemental":230,"sites":231,"automatically":232,"assumed":233,"net":234,"required":235,"neutral":236,"isclose":237,"sp1":238,"sp2":239,"max_dist":240,"do":241,"two":242,"particular":243,"nearest":244,"predefined":245,"instance":246,"analyzing":247,"li":248,"battery":249,"materials":250,"would":251,"expect":252,"neighbor":253,"lower":254,"transition":255,"metal":256,"electrostatic":257,"reasons":258,"first":259,"second":260,"maximum":261,"distance":262,"between":263,"contains":264,"greater":265,"than":266,"sp1_indices":267,"idx":268,"enumerate":269,"sp2_indices":270,"frac_coords1":271,"frac_coords":272,"frac_coords2":273,"lattice":274,"dists":275,"get_all_distances":276,"row":277,"transformedstructure":278,"re":279,"warnings":280,"datetime":281,"timezone":282,"orjson":283,"various":284,"representations":285,"transformed":286,"has":287,"been":288,"modified":289,"undergoing":290,"series":291,"jsanitize":292,"io":293,"cif":294,"cifparser":295,"vasp":296,"inputs":297,"poscar":298,"sets":299,"mprelaxset":300,"vaspinputset":301,"transformation_abc":302,"abstracttransformation":303,"provenance":304,"structurenl":305,"sequence":306,"history":307,"other_parameters":308,"undo_last_change":309,"redo_next_change":310,"__getattr__":311,"name":312,"don":313,"getattr":314,"final_structure":315,"here":316,"avoid":317,"infinite":318,"recursion":319,"__len__":320,"container":321,"new":322,"include":323,"made":324,"associated":325,"transformation":326,"initialize":327,"apply":328,"previous":329,"additional":330,"added":331,"_undone":332,"tuple":333,"trafo":334,"append_transformation":335,"undo":336,"last":337,"change":338,"raises":339,"indexerror":340,"already":341,"oldest":342,"len":343,"more":344,"changes":345,"input_structure":346,"latest":347,"pop":348,"index":349,"redo":350,"undone":351,"hist":352,"__getattribute__":353,"return_alternatives":354,"clear_redo":355,"append_filter":356,"structure_filter":357,"extend_transformations":358,"get_vasp_input":359,"write_vasp_input":360,"alternative":361,"transformedstructures":362,"many":363,"which":364,"stipulates":365,"total":366,"boolean":367,"indicating":368,"clear":369,"meaning":370,"appends":371,"clears":372,"undoing":373,"however":374,"using":375,"should":376,"cleared":377,"allow":378,"redos":379,"is_one_to_many":380,"ranked_list":381,"apply_transformation":382,"return_ranked_list":383,"alts":384,"actual_transformation":385,"h_dict":386,"output_parameters":387,"add":388,"structurefilter":389,"implementing":390,"api":391,"tells":392,"what":393,"retain":394,"vasp_input_set":395,"kwargs":396,"output_dir":397,"create_directory":398,"__str__":399,"set_parameter":400,"key":401,"was_modified":402,"from_cif_str":403,"from_poscar_str":404,"extend":405,"create":406,"files":407,"keyword":408,"supported":409,"get_input_set":410,"dumps":411,"decode":412,"write":413,"like":414,"creates":415,"directory":416,"output":417,"defaults":418,"write_input":419,"make_dir_if_not_present":420,"open":421,"mode":422,"encoding":423,"utf":424,"file":425,"dump":426,"current":427,"nhistory":428,"nother":429,"parameter":430,"property":431,"describing":432,"alterations":433,"case":434,"substitution":435,"replace":436,"isn":437,"cif_string":438,"primitive":439,"occupancy_tolerance":440,"poscar_string":441,"copy":442,"stored":443,"every":444,"single":445,"h_structs":446,"generate":447,"cifs":448,"please":449,"ciftransmuter":450,"option":451,"cell":452,"extracted":453,"instances":454,"where":455,"might":456,"want":457,"non":458,"trying":459,"possible":460,"orderings":461,"partial":462,"removals":463,"order":464,"disordered":465,"occupancy":466,"occupancies":467,"scaled":468,"down":469,"parser":470,"from_str":471,"raw_str":472,"sub":473,"cif_dict":474,"cif_keys":475,"parse_structures":476,"partial_cif":477,"_database_code_icsd":478,"source":479,"icsd":480,"uploaded":481,"source_info":482,"now":483,"tz":484,"utc":485,"original_file":486,"cif_data":487,"true_names":488,"valueerror":489,"created":490,"strings":491,"proper":492,"vasp5":493,"symbols":494,"to_snl":495,"authors":496,"from_snl":497,"snl":498,"last_modified":499,"contributing":500,"generated":501,"warn":502,"data":503,"discarded":504,"conversion":505,"stacklevel":506,"snl_metadata":507,"_snl":508,"url":509,"http":510,"pypi":511,"python":512,"org":513,"description":514,"starting":515,"transmuters":516,"standardtransmuter":517,"os":518,"multiprocessing":519,"pool":520,"poscartransmuter":521,"batch_write_vasp_input":522,"implements":523,"classes":524,"essentially":525,"sources":526,"enable":527,"high":528,"throughput":529,"generation":530,"also":531,"includes":532,"helper":533,"function":534,"entire":535,"running":536,"callable":537,"__author__":538,"shyue":539,"ping":540,"ong":541,"richards":542,"__copyright__":543,"copyright":544,"2012":545,"project":546,"__version__":547,"__maintainer__":548,"__email__":549,"shyuep":550,"gmail":551,"com":552,"__date__":553,"mar":554,"transformed_structures":555,"extend_collection":556,"ncores":557,"__getitem__":558,"performs":559,"attributes":560,"initial":561,"determines":562,"branching":563,"cores":564,"applying":565,"implies":566,"serial":567,"trans":568,"ts":569,"apply_filter":570,"add_tags":571,"append_transformed_structures":572,"item":573,"altered":574,"corresponding":575,"use_multiprocessing":576,"need":577,"condense":578,"arguments":579,"trafo_new_structs":580,"_apply_transformation":581,"new_structures":582,"checks":583,"lambda":584,"batch":585,"following":586,"format":587,"formula":588,"tags":589,"trafo_structs_or_transmuter":590,"from_structures":591,"my":592,"awesome":593,"overloaded":594,"accept":595,"either":596,"__class__":597,"some":598,"incorrect":599,"constructor":600,"rather":601,"t_struct":602,"from_filenames":603,"filenames":604,"possibly":605,"lines":606,"split":607,"structure_data":608,"read_data":609,"line":610,"match":611,"super":612,"transformedstructurecollection":613,"paths":614,"same":615,"cif_files":616,"filename":617,"read":618,"poscar_filenames":619,"poscars":620,"convenient":621,"generates":622,"trafo_structs":623,"subfolder":624,"include_cif":625,"group":626,"subdirectory":627,"transformed_structure":628,"tag":629,"well":630,"generally":631,"better":632,"visualization":633,"programs":634,"subdir":635,"dirname":636,"cifwriter":637,"writer":638,"write_file":639,"path":640,"so":641,"pickled":642,"collection":643,"plus":644,"out":645,"adsorption":646,"adsorbatesitefinder":647,"slab":648,"selective_dynamics":649,"height":650,"mi_vec":651,"arraylike":652,"itertools":653,"np":654,"serialization":655,"loadfn":656,"scipy":657,"spatial":658,"delaunay":659,"get_mi_vec":660,"get_rot":661,"put_coord_inside":662,"surface":663,"find":664,"slabs":665,"numpy":666,"vis":667,"local_env":668,"voronoinn":669,"molecule":670,"operations":671,"symmop":672,"generate_all_slabs":673,"coord":674,"in_coord_list_pbc":675,"matplotlib":676,"pyplot":677,"plt":678,"joseph":679,"montoya":680,"2016":681,"__credits__":682,"richard":683,"tran":684,"montoyjh":685,"lbl":686,"gov":687,"__status__":688,"development":689,"december":690,"2015":691,"finds":692,"adsorbate":693,"according":694,"user":695,"defined":696,"finding":697,"follows":698,"determine":699,"threshold":700,"along":701,"miller":702,"highest":703,"network":704,"triangulation":705,"assign":706,"top":707,"bridge":708,"hollow":709,"nodes":710,"edges":711,"face":712,"centers":713,"del":714,"positioned":715,"flag":716,"fixed":717,"selective":718,"dynamics":719,"selection":720,"array":721,"vector":722,"concurrent":723,"enables":724,"reoriented":725,"supplied":726,"manually":727,"normal":728,"mvec":729,"assign_site_properties":730,"assign_selective_dynamics":731,"from_bulk_and_miller":732,"miller_index":733,"min_slab_size":734,"min_vacuum_size":735,"10":736,"max_normal_search":737,"center_slab":738,"undercoord_threshold":739,"09":740,"construct":741,"bulk":742,"allows":743,"determined":744,"difference":745,"coordination":746,"opposed":747,"asf":748,"constructed":749,"min":750,"size":751,"vacuum":752,"search":753,"center":754,"undercoordation":755,"assignment":756,"designated":757,"less":758,"coordinated":759,"counterpart":760,"todo":761,"reason":762,"poorly":763,"cells":764,"may":765,"switch":766,"eventually":767,"vnn_bulk":768,"tol":769,"05":770,"bulk_coords":771,"get_nn":772,"range":773,"site_properties":774,"bulk_coordinations":775,"max_index":776,"slab_dict":777,"this_slab":778,"vnn_surface":779,"allow_pathological":780,"surf_props":781,"under_coords":782,"this_mi_vec":783,"mi_mags":784,"dot":785,"coords":786,"average_mi_mag":787,"mean":788,"bulk_coord":789,"slab_coord":790,"mi_mag":791,"under_coord":792,"subsurface":793,"new_site_properties":794,"surface_properties":795,"undercoords":796,"new_slab":797,"find_surface_sites_by_height":798,"xy_tol":799,"get_extended_surface_mesh":800,"repeat":801,"surface_sites":802,"subsurface_sites":803,"find_adsorption_sites":804,"put_inside":805,"symm_reduce":806,"near_reduce":807,"positions":808,"ontop":809,"no_obtuse_hollow":810,"ensemble_center":811,"determining":812,"topmost":813,"angstroms":814,"determination":815,"plane":816,"selected":817,"projection":818,"coordinates":819,"m_projs":820,"mask":821,"window":822,"amax":823,"surf_sites":824,"sort":825,"zip":826,"strict":827,"reverse":828,"unique_sites":829,"unique_perp_fracs":830,"this_perp":831,"this_perp_frac":832,"get_fractional_coords":833,"properties":834,"extended":835,"mesh":836,"constructing":837,"supercell":838,"getting":839,"surf_str":840,"from_sites":841,"make_supercell":842,"convenience":843,"above":844,"cartesian":845,"coordinating":846,"ensemble":847,"atoms":848,"itself":849,"put":850,"inside":851,"symm":852,"reduction":853,"near":854,"faces":855,"projected":856,"indicate":857,"obtuse":858,"triangular":859,"ensembles":860,"ads_sites":861,"ref":862,"argmax":863,"cart_coords":864,"diff":865,"subs":866,"ss_sites":867,"symm_op":868,"dt":869,"operate":870,"refactor":871,"below":872,"properly":873,"account":874,"fold":875,"simplices":876,"dots":877,"i_corner":878,"i_opp":879,"corner":880,"opp":881,"vecs":882,"vec":883,"linalg":884,"norm":885,"midpoints":886,"tri":887,"prevent":888,"addition":889,"triangles":890,"pare":891,"off":892,"outer":893,"ads_site":894,"frac_coord":895,"get_cartesian_coords":896,"asarray":897,"sublist":898,"values":899,"coords_set":900,"site_list":901,"indices":902,"add_adsorbate":903,"generate_adsorption_structures":904,"reduce":905,"removing":906,"symmetrically":907,"equivalent":908,"duplicates":909,"coordinate":910,"tolerance":911,"equivalence":912,"dupl":913,"checking":914,"surf_sg":915,"symm_ops":916,"get_symmetry_operations":917,"unique_coords":918,"convert":919,"fractional":920,"in_coord":921,"op":922,"atol":923,"break":924,"back":925,"prune":926,"nx3":927,"select":928,"average":929,"axis":930,"ads_coord":931,"translate":932,"reorient":933,"adsorb_both_surfaces":934,"generate_substitution_structures":935,"represented":936,"translated":937,"relative":938,"representing":939,"position":940,"making":941,"prior":942,"placing":943,"its":944,"origin":945,"adding":946,"mass":947,"most":948,"negative":949,"front_atoms":950,"_sites":951,"s1":952,"s2":953,"center_of_mass":954,"translate_sites":955,"m_index":956,"apply_operation":957,"inverse":958,"add_site_property":959,"coords_are_cartesian":960,"sd_list":961,"new_sp":962,"min_lw":963,"find_args":964,"molecular":965,"take":966,"argument":967,"minimum":968,"length":969,"width":970,"precursor":971,"dictionary":972,"call":973,"xrep":974,"ceil":975,"matrix":976,"yrep":977,"both":978,"surfaces":979,"useful":980,"calculating":981,"energy":982,"calculate":983,"nonpolar":984,"systems":985,"adsorbed":986,"ad_slabs":987,"new_ad_slabs":988,"ad_slab":989,"adsorbates":990,"start":991,"clean":992,"remove_sites":993,"side":994,"p2":995,"get_symmetric_site":996,"atom":997,"target_species":998,"sub_both_sides":999,"range_tol":1000,"dist_from_surf":1001,"substitute":1002,"perform":1003,"doping":1004,"configurations":1005,"dopant":1006,"substituted":1007,"per":1008,"substitutional":1009,"specific":1010,"viable":1011,"symmetrized":1012,"sides":1013,"sym_slab":1014,"get_symmetrized_structure":1015,"define":1016,"substituting":1017,"props":1018,"eq_indices":1019,"next":1020,"equivalent_indices":1021,"ii":1022,"6f":1023,"substituted_slabs":1024,"bottom":1025,"sorted_sites":1026,"sorted":1027,"species_string":1028,"group_structures":1029,"cart_coordinate":1030,"reorient_z":1031,"plot_slab":1032,"ax":1033,"axes":1034,"draw_unit_cell":1035,"decay":1036,"adsorption_sites":1037,"unit":1038,"aligned":1039,"cross":1040,"rotate":1041,"new_z":1042,"_b":1043,"_c":1044,"new_x":1045,"new_y":1046,"eye":1047,"rot_matrix":1048,"el":1049,"product":1050,"reshape":1051,"from_rotation_and_translation":1052,"transpose":1053,"fc":1054,"floor":1055,"color":1056,"colors":1057,"__file__":1058,"elementcolorschemes":1059,"yaml":1060,"color_dict":1061,"256":1062,"001":1063,"jmol":1064,"help":1065,"visualize":1066,"plot":1067,"viewing":1068,"visualized":1069,"radius":1070,"scaling":1071,"repeating":1072,"setting":1073,"limits":1074,"fraction":1075,"draw":1076,"how":1077,"alpha":1078,"decays":1079,"invert":1080,"opposite":1081,"expensive":1082,"pr4128":1083,"patches":1084,"orig_slab":1085,"orig_cell":1086,"alphas":1087,"clip":1088,"vertices":1089,"lattice_sum":1090,"show":1091,"reversed":1092,"circles":1093,"stack":1094,"accordingly":1095,"atomic_radius":1096,"add_patch":1097,"circle":1098,"zorder":1099,"symbol":1100,"facecolor":1101,"edgecolor":1102,"lw":1103,"inverse_slab":1104,"tolist":1105,"marker":1106,"markersize":1107,"mew":1108,"linestyle":1109,"10000":1110,"insert":1111,"codes":1112,"moveto":1113,"lineto":1114,"closepoly":1115,"vert":1116,"patch":1117,"pathpatch":1118,"set_aspect":1119,"equal":1120,"extent":1121,"lim_array":1122,"x_lim":1123,"ele":1124,"y_lim":1125,"xlim":1126,"ylim":1127,"bond_dissociation":1128,"bonddissociationenergies":1129,"molecule_entry":1130,"fragment_entries":1131,"allow_additional_charge_separation":1132,"multibreak":1133,"logging":1134,"cast":1135,"nx":1136,"fragmenter":1137,"open_ring":1138,"graphs":1139,"networkx":1140,"moleculegraph":1141,"molgraphspliterror":1142,"openbabelnn":1143,"babel":1144,"babelmoladaptor":1145,"samuel":1146,"blau":1147,"2018":1148,"samblau1":1149,"26":1150,"18":1151,"logger":1152,"getlogger":1153,"standard":1154,"bond":1155,"dissociation":1156,"energies":1157,"bonds":1158,"principle":1159,"looped":1160,"through":1161,"calculated":1162,"resulting":1163,"fragments":1164,"ring":1165,"obtained":1166,"breaking":1167,"opening":1168,"called":1169,"optimized":1170,"relevant":1171,"quantum":1172,"chemistry":1173,"elsewhere":1174,"written":1175,"provide":1176,"atomate":1177,"fragmentation":1178,"workflow":1179,"fragment_and_process":1180,"search_fragment_entries":1181,"filter_fragment_entries":1182,"provided":1183,"entries":1184,"keys":1185,"formula_pretty":1186,"initial_molecule":1187,"final_molecule":1188,"pcm":1189,"pcm_dielectric":1190,"entry":1191,"mentioned":1192,"fragment":1193,"consider":1194,"larger":1195,"separation":1196,"among":1197,"see":1198,"definition":1199,"expected_charges":1200,"information":1201,"additionally":1202,"attempt":1203,"pairs":1204,"info":1205,"filtered_entries":1206,"filtered":1207,"bond_dissociation_energies":1208,"done_frag_pairs":1209,"done_ro_frags":1210,"ring_bonds":1211,"required_keys":1212,"runtimeerror":1213,"exiting":1214,"expected":1215,"charges":1216,"final_mol":1217,"final_charge":1218,"elif":1219,"build":1220,"graph":1221,"mol_graph":1222,"from_local_env_strategy":1223,"loop":1224,"aka":1225,"process":1226,"build_new_entry":1227,"warning":1228,"much":1229,"likely":1230,"reliable":1231,"bad":1232,"idea":1233,"bond_pairs":1234,"jj":1235,"bond_pair":1236,"try":1237,"split_molecule_subgraphs":1238,"allow_reverse":1239,"frag_success":1240,"except":1241,"unsuccessful":1242,"encountered":1243,"make":1244,"sure":1245,"haven":1246,"identically":1247,"opened":1248,"ro_frag":1249,"1000":1250,"frag_done":1251,"done_ro_frag":1252,"isomorphic_to":1253,"save":1254,"record":1255,"opened_entries":1256,"good_entries":1257,"looking":1258,"frag":1259,"structural":1260,"still":1261,"yields":1262,"noqa":1263,"perf401":1264,"didn":1265,"good":1266,"let":1267,"exhibit":1268,"yes":1269,"something":1270,"gone":1271,"wrong":1272,"calculations":1273,"bb":1274,"from_molecule_graph":1275,"pb_mol":1276,"pybel_mol":1277,"smiles":1278,"smi":1279,"get_node_attributes":1280,"missing":1281,"breakage":1282,"yield":1283,"shouldn":1284,"ever":1285,"encounter":1286,"valid":1287,"once":1288,"did":1289,"successfully":1290,"dealing":1291,"begin":1292,"identical":1293,"pair":1294,"frags_done":1295,"frag_pair":1296,"n_entries_for_this_frag_pair":1297,"frag1_entries":1298,"frag2_entries":1299,"frag1_charges_found":1300,"frag2_charges_found":1301,"our":1302,"frag1":1303,"frag2":1304,"tell":1305,"right":1306,"found":1307,"expand":1308,"isomorphic":1309,"distinguish":1310,"final":1311,"moleculegraphs":1312,"vs":1313,"initial_entries":1314,"final_entries":1315,"initial_molgraph":1316,"final_molgraph":1317,"dielectric":1318,"consistent":1319,"err_msg":1320,"placeholder":1321,"details":1322,"different":1323,"molgraphs":1324,"classify":1325,"potential":1326,"occurred":1327,"optimization":1328,"structure_change":1329,"no_change":1330,"initial_graph":1331,"final_graph":1332,"is_connected":1333,"to_undirected":1334,"unconnected_fragments":1335,"number_of_edges":1336,"fewer_bonds":1337,"more_bonds":1338,"bond_change":1339,"found_similar_entry":1340,"uniqueness":1341,"filtered_entry":1342,"similarity":1343,"final_energy":1344,"choose":1345,"singlet":1346,"triplet":1347,"assuming":1348,"frags":1349,"returned":1350,"involved":1351,"broken":1352,"formatted":1353,"new_entry":1354,"spin_multiplicity":1355,"bond_valence":1356,"calculate_bv_sum":1357,"nn_list":1358,"scale_factor":1359,"functools":1360,"operator":1361,"calculate_bv_sum_unordered":1362,"bvanalyzer":1363,"get_z_ordered_elmap":1364,"valence":1365,"analyses":1366,"electronegative":1367,"keefe":1368,"brese":1369,"jacs":1370,"1991":1371,"113":1372,"3226":1373,"3229":1374,"doi":1375,"1021":1376,"ja00009a002":1377,"electroneg":1378,"sym":1379,"si":1380,"sb":1381,"se":1382,"te":1383,"cl":1384,"br":1385,"module_dir":1386,"abspath":1387,"bv":1388,"bv_params":1389,"val":1390,"bvparam_1991":1391,"mined":1392,"all_data":1393,"icsd_bv":1394,"icsd_bv_data":1395,"bvsum":1396,"prior_prob":1397,"occurrence":1398,"sum":1399,"periodicsite":1400,"central":1401,"namedtuple":1402,"having":1403,"factor":1404,"esp":1405,"calculation":1406,"relaxed":1407,"tend":1408,"under":1409,"gga":1410,"over":1411,"bind":1412,"lda":1413,"el1":1414,"bv_sum":1415,"nn":1416,"el2":1417,"r1":1418,"r2":1419,"c1":1420,"c2":1421,"sqrt":1422,"vij":1423,"exp":1424,"nn_distance":1425,"31":1426,"add_oxidation_state_by_site_fraction":1427,"unordered":1428,"occupations":1429,"f_":1430,"_0":1431,"_1":1432,"_n":1433,"x_":1434,"nn_i":1435,"n_":1436,"sum_":1437,"sum_j":1438,"sum_k":1439,"_j":1440,"_k":1441,"vij_full":1442,"fully":1443,"occupied":1444,"specie1":1445,"occu1":1446,"specie2":1447,"occu2":1448,"symm_tol":1449,"max_radius":1450,"max_permutations":1451,"100_000":1452,"distance_scale_factor":1453,"015":1454,"charge_neutrality_tolerance":1455,"forbidden_species":1456,"posteriori":1457,"estimation":1458,"states":1459,"distinct":1460,"posterior":1461,"probabilities":1462,"oxi_state":1463,"constant":1464,"gaussian":1465,"std":1466,"deviation":1467,"frequency":1468,"ranked":1469,"decreasing":1470,"probability":1471,"combination":1472,"result":1473,"000_01":1474,"turn":1475,"permutations":1476,"experimental":1477,"neutrality":1478,"stake":1479,"forbidden":1480,"cannot":1481,"someone":1482,"knows":1483,"occur":1484,"dist_scale_factor":1485,"_calc_site_probabilities":1486,"_calc_site_probabilities_unordered":1487,"get_valences":1488,"get_oxi_state_decorated_structure":1489,"prob":1490,"sigma":1491,"factors":1492,"ignored":1493,"effect":1494,"results":1495,"normalize":1496,"zerodivisionerror":1497,"fromkeys":1498,"valences":1499,"analyze":1500,"ordered":1501,"els":1502,"grouped":1503,"symm_structure":1504,"equi_sites":1505,"equivalent_sites":1506,"electronegativity":1507,"average_electroneg":1508,"all_prob":1509,"is_ordered":1510,"test_site":1511,"100":1512,"01":1513,"full_all_prob":1514,"vals":1515,"elem":1516,"variables":1517,"needed":1518,"attrib":1519,"evaluate_assignment":1520,"v_set":1521,"_recurse":1522,"assigned":1523,"recurses":1524,"n_sites":1525,"valence_min":1526,"valence_max":1527,"_best_score":1528,"_best_vset":1529,"el_oxi":1530,"max_diff":1531,"score":1532,"mul":1533,"lowest":1534,"new_assigned":1535,"tmp":1536,"n_site":1537,"new_n_sites":1538,"fractions":1539,"occu":1540,"new_valences":1541,"iv":1542,"vv":1543,"new_best_vset":1544,"ival":1545,"frac_site":1546,"comp":1547,"oxidation_states":1548,"currently":1549,"decorations":1550,"add_oxidation_state_by_site":1551,"arbitrary":1552,"tuples":1553,"element_or_specie":1554,"occupation":1555,"smallest":1556,"ni3":1557,"ni4":1558,"cr3":1559,"15":1560,"zn2":1561,"34":1562,"cr4":1563,"11":1564,"chemenv":1565,"chemical":1566,"environments":1567,"connectivity":1568,"connected_components":1569,"fancyarrowpatch":1570,"draw_network":1571,"make_supergraph":1572,"connectedcomponent":1573,"connected":1574,"components":1575,"algorithms":1576,"traversal":1577,"bfs_tree":1578,"environment_nodes":1579,"environmentnode":1580,"utils":1581,"chemenv_errors":1582,"chemenverror":1583,"graph_utils":1584,"get_delta":1585,"math_utils":1586,"get_linearly_independent_vectors":1587,"env_graph":1588,"pos":1589,"sg":1590,"periodicity_vectors":1591,"multiplicity":1592,"figure":1593,"2d":1594,"drawn":1595,"drawing":1596,"supergraphs":1597,"periodicity":1598,"vectors":1599,"02":1600,"node":1601,"_x":1602,"_y":1603,"annotate":1604,"ha":1605,"va":1606,"xycoords":1607,"seen":1608,"n1":1609,"n2":1610,"rad":1611,"sign":1612,"periodic_color":1613,"delta":1614,"get_center_of_arc":1615,"n1center":1616,"n2center":1617,"midpoint":1618,"power":1619,"n1c_to_n2c":1620,"mid_arc":1621,"xy_text_offset":1622,"patcha":1623,"patchb":1624,"arrowstyle":1625,"connectionstyle":1626,"arc3":1627,"mutation_scale":1628,"dashed":1629,"ecolor":1630,"allclose":1631,"zeros":1632,"xytext":1633,"textcoords":1634,"offset":1635,"points":1636,"multigraph":1637,"super_graph":1638,"mult":1639,"node_indices":1640,"indices_nodes":1641,"connecting_edges":1642,"other_edges":1643,"new_data":1644,"end":1645,"nor":1646,"ok":1647,"imult":1648,"add_edge":1649,"attr_dict":1650,"mod":1651,"notimplementederror":1652,"yet":1653,"implemented":1654,"periodic":1655,"links":1656,"environments_data":1657,"links_data":1658,"coordination_sequence":1659,"source_node":1660,"path_size":1661,"include_source":1662,"describe":1663,"terms":1664,"component":1665,"environment":1666,"_periodicity_vectors":1667,"_primitive_reduced_connected_subgraph":1668,"_projected":1669,"_connected_subgraph":1670,"add_nodes_from":1671,"env":1672,"add_node":1673,"edge":1674,"env_node1":1675,"env_node2":1676,"has_node":1677,"unexistent":1678,"edge_data":1679,"few":1680,"requirements":1681,"compute_periodicity":1682,"compute_periodicity_all_simple_paths_algorithm":1683,"computed":1684,"corresponds":1685,"reachable":1686,"sizes":1687,"dictionaries":1688,"nth":1689,"layer":1690,"examples":1691,"sharing":1692,"octahedral":1693,"framework":1694,"perovskites":1695,"38":1696,"66":1697,"102":1698,"146":1699,"considering":1700,"octahedrons":1701,"cuboctahedrons":1702,"typical":1703,"batio3":1704,"perovskite":1705,"ti":1706,"octahedron":1707,"ba":1708,"cuboctahedron":1709,"12":1710,"48":1711,"90":1712,"128":1713,"194":1714,"248":1715,"338":1716,"408":1717,"522":1718,"608":1719,"74":1720,"170":1721,"306":1722,"482":1723,"698":1724,"included":1725,"shown":1726,"dimensions":1727,"consisting":1728,"stacking":1729,"quotient":1730,"__":1731,"16":1732,"all_simple_paths":1733,"compute_periodicity_cycle_basis":1734,"show_graph":1735,"current_delta":1736,"current_ends":1737,"visited":1738,"isite":1739,"path_len":1740,"cseq":1741,"coordination_environment":1742,"while":1743,"new_ends":1744,"current_node_end":1745,"current_delta_end":1746,"nb":1747,"edata":1748,"new_delta":1749,"handle":1750,"loops":1751,"envs":1752,"count":1753,"compute":1754,"cycle_basis":1755,"allowed":1756,"_order_periodicity_vectors":1757,"self_loop_nodes":1758,"nodes_with_selfloops":1759,"all_nodes_independent_cell_image_vectors":1760,"simple_graph":1761,"test_node":1762,"go":1763,"this_node_cell_img_vectors":1764,"image":1765,"d1":1766,"d2":1767,"combinations":1768,"adopt":1769,"cutoff":1770,"contrary":1771,"because":1772,"target":1773,"probably":1774,"just":1775,"dfs":1776,"bfs":1777,"taking":1778,"simple":1779,"test_node_neighbors":1780,"break_node_loop":1781,"test_node_neighbor":1782,"special":1783,"this_path_deltas":1784,"node_node_neighbor_edges_data":1785,"edge1_data":1786,"edge2_data":1787,"delta1":1788,"delta2":1789,"path_indices":1790,"node_path":1791,"continue":1792,"appears":1793,"twice":1794,"cycles":1795,"considered":1796,"node1":1797,"node2":1798,"inode1":1799,"this_path_deltas_new":1800,"independent_cell_img_vectors":1801,"3d":1802,"stop":1803,"is_periodic":1804,"all_deltas":1805,"cyc":1806,"this_cycle_deltas":1807,"this_cycle_deltas_new":1808,"parallel":1809,"iedge1":1810,"iedge2":1811,"e1data":1812,"e2data":1813,"save_file":1814,"drawing_type":1815,"internal":1816,"is_0d":1817,"is_1d":1818,"is_2d":1819,"is_3d":1820,"_order_vectors":1821,"displays":1822,"display":1823,"saved":1824,"external":1825,"shown_graph":1826,"spring_layout":1827,"shell_layout":1828,"gca":1829,"autoscale":1830,"savefig":1831,"draw_graphviz":1832,"nx_pydot":1833,"graphviz_layout":1834,"draw_random":1835,"about":1836,"dimensional":1837,"elastic_centered_graph":1838,"start_node":1839,"staticmethod":1840,"orders":1841,"zero":1842,"dimension":1843,"positive":1844,"third":1845,"ipv":1846,"pv":1847,"non_zeros":1848,"nonzero":1849,"pp":1850,"elastic":1851,"centering":1852,"centered":1853,"subgraph":1854,"start_nodes":1855,"sometimes":1856,"elastically":1857,"taken":1858,"n_test_nodes":1859,"iter":1860,"centered_connected_subgraph":1861,"add_edges_from":1862,"tree":1863,"current_nodes":1864,"nodes_traversed":1865,"inode":1866,"levels":1867,"tree_level":1868,"_edge_key_to_edge_dict_key":1869,"_edgedictkey_to_edgekey":1870,"_retuplify_edgedata":1871,"debug":1872,"level":1873,"new_current_nodes":1874,"node_neighbors":1875,"node_edges":1876,"nbunch":1877,"inode_neighbor":1878,"node_neighbor":1879,"already_inside":1880,"ddeltas":1881,"_key":1882,"thisdelta":1883,"dd":1884,"ddd":1885,"000":1886,"continuing":1887,"outside":1888,"d_delta":1889,"node_neighbor_edges":1890,"duhh":1891,"indeed":1892,"whose":1893,"check_centered_connected_subgraph":1894,"could":1895,"dicts":1896,"private":1897,"applicable":1898,"startindex":1899,"endindex":1900,"deltax":1901,"deltay":1902,"deltaz":1903,"ligands":1904,"ligand_1_index":1905,"deltax_start_lig_1":1906,"deltay_start_lig_1":1907,"deltaz_start_lig_1":1908,"deltax_end_lig_1":1909,"deltay_end_lig_1":1910,"deltaz_end_lig_1":1911,"ligand_2_index":1912,"serializing":1913,"bson":1914,"transforms":1915,"lig":1916,"serializable":1917,"node2stringindex":1918,"strindex":1919,"dict_of_dicts":1920,"to_dict_of_dicts":1921,"new_dict_of_dicts":1922,"n2dict":1923,"in1":1924,"edges_dict":1925,"in2":1926,"ie":1927,"ied":1928,"from_graph":1929,"full":1930,"reconstructs":1931,"nodes_map":1932,"inode_str":1933,"nodedict":1934,"nodedata":1935,"nodes_data":1936,"nested_dict":1937,"e1":1938,"e1dict":1939,"e2":1940,"e2dict":1941,"from_dict_of_dicts":1942,"create_using":1943,"multigraph_input":1944,"set_node_attributes":1945,"relabel_nodes":1946,"short":1947,"en":1948,"en_neighbs":1949,"en_neighb":1950,"iedge":1951,"connectivity_finder":1952,"structure_connectivity":1953,"structureconnectivity":1954,"connectivityfinder":1955,"david":1956,"waroquiers":1957,"geoffroy":1958,"hautier":1959,"june":1960,"25":1961,"2019":1962,"multiple_environments_choice":1963,"get_structure_connectivity":1964,"light_structure_environments":1965,"setup_parameters":1966,"main":1967,"procedure":1968,"described":1969,"mix":1970,"lightstructureenvironments":1971,"setup":1972,"add_sites":1973,"site_idx":1974,"_site":1975,"site_neighbors_sets":1976,"neighbors_sets":1977,"local":1978,"nothing":1979,"asked":1980,"take_highest_fraction":1981,"idx_max":1982,"ee":1983,"ce_fraction":1984,"coordination_environments":1985,"imax":1986,"site_neighbors_set":1987,"add_bonds":1988,"abstractenvironmentnode":1989,"get_environment_node":1990,"central_site":1991,"i_central_site":1992,"__hash__":1993,"__eq__":1994,"__lt__":1995,"strictly":1996,"actually":1997,"real":1998,"everything_equal":1999,"ce":2000,"mp_symbol":2001,"abstract":2002,"number_of_neighboring_coordination_environments":2003,"number_of_neighboring_ces":2004,"neighboring_coordination_environments":2005,"neighboring_ces":2006,"number_of_ligands_for_each_neighboring_coordination_environment":2007,"number_of_ligands_for_each_neighboring_ce":2008,"ligands_arrangement":2009,"neighbors_ligands_arrangement":2010,"ce_nnbces_nbces_ligands":2011,"default_extensions":2012,"subclass":2013,"hash":2014,"notimplemented":2015,"relabelling":2016,"place":2017,"comparing":2018,"relabelled":2019,"equality":2020,"respect":2021,"another":2022,"ce_symbol":2023,"atom_symbol":2024,"identified":2025,"_ce_symbol":2026,"keep":2027,"come":2028,"handy":2029,"later":2030,"decide":2031,"implement":2032,"descriptors":2033,"octahedralenvironmentnode":2034,"cg":2035,"allcoordinationgeometries":2036,"get_geometry_from_mp_symbol":2037,"tetrahedralenvironmentnode":2038,"allowed_environment_nodes":2039,"get_delta_image":2040,"isite1":2041,"isite2":2042,"data1":2043,"data2":2044,"structure_environments":2045,"ligand":2046,"images":2047,"light_structure_environment":2048,"connectivity_graph":2049,"environment_subgraphs":2050,"environment_subgraph":2051,"environments_symbols":2052,"only_atoms":2053,"reconstructed":2054,"subgraphs":2055,"_graph":2056,"setup_environment_subgraph":2057,"_environment_subgraph":2058,"attributeerror":2059,"all_envs":2060,"environments_identified":2061,"setup_connectivity_description":2062,"get_connected_components":2063,"setup_atom_environment_subgraph":2064,"existing_edges":2065,"nb_index_and_image":2066,"neighb_indices_and_images":2067,"nb_index_unitcell":2068,"nb_image_cell":2069,"image_cell":2070,"exists":2071,"ineighb1":2072,"site_idx1":2073,"happen":2074,"optionally":2075,"iterable":2076,"envs_str":2077,"directly":2078,"subset":2079,"ce_this_site_all":2080,"ce_this_site":2081,"env_node":2082,"possibility":2083,"constraint":2084,"percentage":2085,"this_site_elements":2086,"species_and_occu":2087,"elem_symbol":2088,"connections":2089,"links_node1":2090,"links_node2":2091,"common":2092,"site1":2093,"site2":2094,"connections_site1_site2":2095,"ilig_site1":2096,"ilig_site2":2097,"delta_image":2098,"tuple_delta_image":2099,"double":2100,"remove_deltas":2101,"alldeltas":2102,"alldeltas2":2103,"opp_current_delta":2104,"remove_delta":2105,"conn":2106,"atom_environment":2107,"setup_environments_subgraph":2108,"setup_atom_environments_subgraph":2109,"atoms_environments":2110,"print_links":2111,"env_subgraph":2112,"component_nodes":2113,"print":2114,"env_key":2115,"integer":2116,"replaces":2117,"connect_graph":2118,"relabel":2119,"casting":2120,"maps":2121,"multi":2122,"adds":2123,"new_edges":2124,"remove_edges_from":2125,"deserialize":2126,"chemenv_strategies":2127,"strategyoption":2128,"stats":2129,"gmean":2130,"coordination_geometries":2131,"distancecutofffloat":2132,"anglecutofffloat":2133,"csmfloat":2134,"strategies":2135,"favour":2136,"smaller":2137,"uniquely":2138,"identifies":2139,"others":2140,"identify":2141,"several":2142,"choice":2143,"strategy":2144,"depends":2145,"purpose":2146,"voronoi":2147,"detailedvoronoicontainer":2148,"equivalentsitesearcherror":2149,"coordination_geometry_utils":2150,"get_lower_and_upper_f":2151,"defs_utils":2152,"additionalconditions":2153,"func_utils":2154,"csmfiniteratiofunction":2155,"csminfiniteratiofunction":2156,"deltacsmratiofunction":2157,"ratiofunction":2158,"classvar":2159,"feb":2160,"20":2161,"mpsymbol_to_cn":2162,"get_symbol_cn_mapping":2163,"allcg":2164,"options":2165,"allowed_values":2166,"__new__":2167,"additionalconditionint":2168,"abstractchemenvstrategy":2169,"simplestchemenvstrategy":2170,"infinity":2171,"flt":2172,"angle":2173,"got":2174,"continuous":2175,"measure":2176,"csm":2177,"simpleabundancechemenvstrategy":2178,"targetedpenaltiedabundancechemenvstrategy":2179,"condition":2180,"amongst":2181,"condition_description":2182,"conditions":2183,"symmetry_measure_type":2184,"default_symmetry_measure_type":2185,"set_structure_environments":2186,"prepare_symmetries":2187,"equivalent_site_index_and_transform":2188,"psite":2189,"base":2190,"structureenvironments":2191,"ac":2192,"strategy_options":2193,"strategy_description":2194,"strategy_info_fields":2195,"csm_wcs_ctwcc":2196,"_symmetry_measure_type":2197,"prepare":2198,"symmetries":2199,"contained":2200,"spg_analyzer":2201,"symops":2202,"exception":2203,"get_site_neighbors":2204,"uniquely_determines_coordination_environments":2205,"get_site_coordination_environment":2206,"translation":2207,"translations":2208,"replica":2209,"uc_psite":2210,"to_unit_cell":2211,"site_idx2":2212,"is_periodic_image":2213,"this_site":2214,"dist_this_site":2215,"equiv_site":2216,"sites_map":2217,"equivsite":2218,"dist_equiv_site":2219,"applies":2220,"gets":2221,"iii":2222,"tolerances":2223,"refined":2224,"d_this_site2":2225,"sym_trafo":2226,"sym_op":2227,"new_site":2228,"_lattice":2229,"sym_ops":2230,"equivalent_site_map":2231,"get_site_coordination_environments":2232,"get_site_coordination_environments_fractions":2233,"dequivsite":2234,"dthissite":2235,"mysym":2236,"min_fraction":2237,"return_maps":2238,"return_strategy_dict_info":2239,"get_site_ce_fractions_and_neighbors":2240,"set_option":2241,"setup_options":2242,"looked":2243,"complex":2244,"solutions":2245,"leads":2246,"unique":2247,"full_ce_info":2248,"strategy_info":2249,"option_name":2250,"option_value":2251,"all_options_dict":2252,"geometry_info":2253,"sought":2254,"geoms_and_maps_list":2255,"site_nbs_sets":2256,"ce_and_neighbors":2257,"fractions_dict":2258,"ce_map":2259,"ce_nb_set":2260,"nb_site_and_index":2261,"neighb_sites_and_indices":2262,"setattr":2263,"compared":2264,"19":2265,"13":2266,"nbsetweight":2267,"distance_cutoff":2268,"default_distance_cutoff":2269,"angle_cutoff":2270,"default_angle_cutoff":2271,"additional_condition":2272,"default_additional_condition":2273,"continuous_symmetry_measure_cutoff":2274,"default_continuous_symmetry_measure_cutoff":2275,"simplest":2276,"chemenvstrategy":2277,"approach":2278,"cutoffs":2279,"only_acb":2280,"_distance_cutoff":2281,"_angle_cutoff":2282,"_additional_condition":2283,"_continuous_symmetry_measure_cutoff":2284,"setter":2285,"_ce":2286,"cn_map":2287,"return_map":2288,"nb_set":2289,"eq_site_ps":2290,"neighb_sites":2291,"coordinated_neighbors":2292,"ps":2293,"ps_site":2294,"add_strategy_visualization_to_subplot":2295,"neighborsset":2296,"neighbors_normalized_distances":2297,"neighbors_normalized_angles":2298,"i_dist":2299,"iwd":2300,"wd":2301,"i_ang":2302,"iwa":2303,"wa":2304,"my_cn":2305,"my_inb_set":2306,"cn":2307,"nb_sets":2308,"inb_set":2309,"src":2310,"dist_ang_ac_voronoi":2311,"idp":2312,"iap":2313,"ce_list":2314,"coord_geoms":2315,"minimum_geometry":2316,"cn_maps":2317,"site_nb_sets":2318,"ce_and_map":2319,"ce_dict":2320,"unknown":2321,"subplot":2322,"visualization_options":2323,"plot_type":2324,"visual":2325,"onto":2326,"markeredgecolor":2327,"markerfacecolor":2328,"linewidth":2329,"anglenbsetweight":2330,"abundant":2331,"grid":2332,"default_max_dist":2333,"surface_calculation_type":2334,"abundance":2335,"_get_map":2336,"eqsite_ps":2337,"unique_coordinated_neighbors":2338,"_get_maps_surfaces":2339,"maps_and_surfaces":2340,"surface_max":2341,"map_and_surface":2342,"all_additional_conditions":2343,"parameters_indices":2344,"distance_parameter":2345,"initial_normalized":2346,"angle_parameter":2347,"truncate_dist_ang":2348,"max_nabundant":2349,"target_environments":2350,"default_target_environments":2351,"target_penalty_type":2352,"max_csm":2353,"normalizedangledistancenbsetweight":2354,"bias":2355,"chemical_environments":2356,"current_map":2357,"current_target_env_csm":2358,"argsort":2359,"target_cgs":2360,"target_cns":2361,"coordination_number":2362,"my_map_and_surface":2363,"my_map":2364,"all_conditions":2365,"params":2366,"cgdict":2367,"symmetry_measure":2368,"weight":2369,"additional_info":2370,"aa":2371,"angle_sum":2372,"angle_sumn":2373,"get_effective_csm":2374,"set_info":2375,"selfcsmnbsetweight":2376,"estimations":2377,"estimate":2378,"short_name":2379,"angleweight":2380,"estimator":2381,"exponent":2382,"aw":2383,"angles":2384,"solid":2385,"pi":2386,"hasattr":2387,"average_type":2388,"invdist":2389,"invndist":2390,"ang":2391,"angn":2392,"anginvdist":2393,"normalized":2394,"normangledistweight":2395,"geometric":2396,"eval":2397,"gweight":2398,"arithmetic":2399,"aweight":2400,"fda":2401,"exponents":2402,"anginvndist":2403,"angninvdist":2404,"angninvndist":2405,"needed_attrs":2406,"attr":2407,"normalized_distances":2408,"weights":2409,"normalized_angles":2410,"nangles":2411,"fda_list":2412,"max_effective_csm":2413,"effective_csm_estimator_ratio_function":2414,"field":2415,"deltacsmnbsetweight":2416,"cnbiasnbsetweight":2417,"distanceangleareanbsetweight":2418,"effective":2419,"ratio":2420,"effective_csm":2421,"effective_csms":2422,"keyerror":2423,"site_ce_list":2424,"site_chemenv":2425,"mingeoms":2426,"minimum_geometries":2427,"csms":2428,"other_symmetry_measures":2429,"mean_estimator":2430,"effective_csm_estimator":2431,"default_effective_csm_estimator":2432,"weight_estimator":2433,"default_weight_estimator":2434,"selfcsmweight":2435,"power2_inverse_decreasing":2436,"power2_decreasing_exp":2437,"effective_csm_estimator_rf":2438,"weight_estimator_rf":2439,"evaluate":2440,"self_csms_weights":2441,"delta_cn_weight_estimators":2442,"differences":2443,"deltacsmweight":2444,"smootherstep":2445,"delta_csm_min":2446,"delta_csm_max":2447,"estimators":2448,"delta_cn_weight_estimators_rfs":2449,"delta_cn":2450,"dcn_w_estimator":2451,"delta_cn_specifics":2452,"effcsm":2453,"delta_csm":2454,"delta_csm_cn_map2":2455,"nb_set_weight":2456,"cn2":2457,"inb_set2":2458,"nb_set2":2459,"effcsm2":2460,"this_delta_csm":2461,"delta_csms":2462,"delta_csms_weights":2463,"delta_csms_cn_map2":2464,"dcn":2465,"this_delta_csm_weight":2466,"delta_csm_mins":2467,"delta_csm_maxs":2468,"minimums":2469,"maximums":2470,"dcn_estimator":2471,"cn_weights":2472,"initialization_options":2473,"linearly_equidistant":2474,"weight_cn1":2475,"weight_cn13":2476,"distanceplateaunbsetweight":2477,"angleplateaunbsetweight":2478,"biases":2479,"towards":2480,"numbers":2481,"cnbiasweight":2482,"initialization":2483,"cnw":2484,"linearly":2485,"equidistant":2486,"dw":2487,"14":2488,"geometrically_equidistant":2489,"explicit":2490,"from_description":2491,"distancenbsetweight":2492,"geometrically":2493,"arge":2494,"explicitly":2495,"weight_type":2496,"has_intersection":2497,"surface_definition":2498,"default_surface_definition":2499,"nb_sets_from_hints":2500,"fallback_to_source":2501,"other_nb_sets":2502,"0_weight":2503,"smoothstep_distance":2504,"smoothstep_angle":2505,"area":2506,"space":2507,"distangleareaweight":2508,"standard_elliptic":2509,"distance_bounds":2510,"upper":2511,"angle_bounds":2512,"deal":2513,"hints":2514,"smoothstep":2515,"area_weight":2516,"w_area_has_intersection":2517,"has_intersection_smoothstep":2518,"w_area_intersection_specific":2519,"w_area_intersection_nbsfh_fbs_onb0":2520,"fallback":2521,"lower_and_upper_functions":2522,"surface_calculation_options":2523,"dmin":2524,"dmax":2525,"amin":2526,"f_lower":2527,"f_upper":2528,"rectangle_crosses_area":2529,"dist_ang_sources":2530,"dp_dict":2531,"a1":2532,"ap_dict":2533,"a2":2534,"from_hints_sources":2535,"nb_set_hints":2536,"cn_map_src":2537,"cn_map_source":2538,"nb_set_src":2539,"rectangle":2540,"crosses":2541,"curves":2542,"ld2":2543,"ld1":2544,"ud1":2545,"ud2":2546,"reach":2547,"point":2548,"distance_function":2549,"weight_function":2550,"deltadistancenbsetweight":2551,"distanceplateauweight":2552,"normalized_distance":2553,"inverse_smootherstep":2554,"weight_rf":2555,"distance_plateau":2556,"angle_function":2557,"weightednbsetchemenvstrategy":2558,"angleplateauweight":2559,"normalized_angle":2560,"angle_plateau":2561,"nbs_source":2562,"multiweightschemenvstrategy":2563,"voronoi_list2":2564,"all_nbs_voro_indices":2565,"update":2566,"site_voronoi_indices":2567,"all_nbs_indices_except_nb_set":2568,"inb":2569,"nb_set_max_normalized_distance":2570,"nb_set_weights":2571,"ce_estimator":2572,"default_ce_estimator":2573,"return_all":2574,"power2_inverse_power2_decreasing":2575,"ordered_weights":2576,"ce_estimator_ratio_function":2577,"ce_estimator_fractions":2578,"weights_additional_info":2579,"wdict":2580,"cn_maps_new":2581,"weight_name":2582,"w_nb_set":2583,"prod":2584,"w_nb_sets":2585,"w_nb_sets_total":2586,"nb_sets_fractions":2587,"nbsetfraction":2588,"ce_symbols":2589,"ce_dicts":2590,"ce_fractions":2591,"ce_dict_fractions":2592,"ce_maps":2593,"nb_set_fraction":2594,"site_ce_nb_set":2595,"unclear":2596,"all_weights":2597,"dict_fractions":2598,"cefraction":2599,"ifraction":2600,"fractions_info_list":2601,"ifinfo":2602,"cn_map_surface_fraction":2603,"cn_map_surface_weight":2604,"cn_map_mean_csm":2605,"cn_map_csm_weight":2606,"cn_map_delta_csm":2607,"cn_map_delta_csms_cn_map2":2608,"cn_map_delta_csm_weight":2609,"cn_map_cn_weight":2610,"cn_map_fraction":2611,"cn_map_ce_fraction":2612,"dist_ang_area_weight":2613,"self_csm_weight":2614,"delta_csm_weight":2615,"cn_bias_weight":2616,"angle_weight":2617,"normalized_angle_distance_weight":2618,"stats_article_weights_parameters":2619,"nb_sets_weights":2620,"distangarea":2621,"selfcsm":2622,"deltacsm":2623,"cnbias":2624,"normalizedangdist":2625,"statistics":2626,"article":2627,"75":2628,"da_area_weight":2629,"delta_weight":2630,"bias_weight":2631,"nad_weight":2632,"multipleabundancechemenvstrategy":2633,"nad_w":2634,"abstractchemenvalgorithm":2635,"algorithm_type":2636,"montydecoder":2637,"explicitpermutationsalgorithm":2638,"separationplane":2639,"coordinationgeometry":2640,"geometries":2641,"exist":2642,"model":2643,"articles":2644,"pure":2645,"appl":2646,"chem":2647,"vol":2648,"79":2649,"1779":2650,"1799":2651,"2007":2652,"acta":2653,"cryst":2654,"46":2655,"1990":2656,"part":2657,"identification":2658,"factorial":2659,"unknown_environment_symbol":2660,"unclear_environment_symbol":2661,"explicit_permutations":2662,"separation_plane":2663,"correct":2664,"permutation":2665,"computation":2666,"chemenvalgorithm":2667,"_algorithm_type":2668,"plane_points":2669,"mirror_plane":2670,"ordered_plane":2671,"point_groups":2672,"ordered_point_groups":2673,"include_inverted_plane":2674,"do_inverse_pt_gp_permutations":2675,"plane_type":2676,"mirror":2677,"minimum_number_of_points":2678,"explicit_optimized_permutations":2679,"other_plane_points":2680,"doing":2681,"perfect":2682,"geometry":2683,"_permutations":2684,"reconstruct":2685,"planes":2686,"ref_separation_perm":2687,"argsorted_ref_separation_perm":2688,"defective":2689,"correspondence":2690,"point_group":2691,"groups":2692,"separated":2693,"ones":2694,"_hash":2695,"_safe_permutations":2696,"maximum_number_of_points":2697,"_ref_separation_perm":2698,"safe_separation_permutations":2699,"_argsorted_ref_separation_perm":2700,"add_opposite":2701,"safe":2702,"meant":2703,"production":2704,"configuration":2705,"s0":2706,"plane_perms":2707,"inv_plane":2708,"s0_perms":2709,"inv_s0":2710,"s1_perms":2711,"inv_s1":2712,"perm_side1":2713,"perm_sep_plane":2714,"perm_side2":2715,"perm":2716,"neighborssetshints":2717,"eperm":2718,"eoperm":2719,"eop":2720,"eo_perm":2721,"reference":2722,"store":2723,"ideal":2724,"beyond":2725,"further":2726,"csm_skip_separation_plane_algo":2727,"hints_type":2728,"hints_info":2729,"single_cap_hints":2730,"capped":2731,"polyhedron":2732,"allowed_hints_types":2733,"single_cap":2734,"double_cap":2735,"triple_cap":2736,"hint":2737,"triple":2738,"cap":2739,"hinting":2740,"constitute":2741,"hinted":2742,"csm_max":2743,"_hints":2744,"cap_index_perfect":2745,"cap_index":2746,"nb_set_voronoi_indices_perfect_aligned":2747,"get_neighb_voronoi_indices":2748,"cap_voronoi_index":2749,"new_site_voronoi_indices":2750,"double_cap_hints":2751,"triple_cap_hints":2752,"first_cap_index_perfect":2753,"first_cap_index":2754,"second_cap_index_perfect":2755,"second_cap_index":2756,"first_cap_voronoi_index":2757,"second_cap_voronoi_index":2758,"new_site_voronoi_indices1":2759,"new_site_voronoi_indices2":2760,"new_site_voronoi_indices3":2761,"third_cap_index_perfect":2762,"third_cap_index":2763,"third_cap_voronoi_index":2764,"new_site_voronoi_indices4":2765,"new_site_voronoi_indices5":2766,"new_site_voronoi_indices6":2767,"new_site_voronoi_indices7":2768,"alternative_names":2769,"iupac_symbol":2770,"iucr_symbol":2771,"solid_angles":2772,"permutations_safe_override":2773,"deactivate":2774,"neighbors_sets_hints":2775,"internally":2776,"names":2777,"iupac":2778,"iucr":2779,"neighboring":2780,"computes":2781,"overrides":2782,"purposes":2783,"clockwise":2784,"anticlockwise":2785,"skip":2786,"_mp_symbol":2787,"iupacsymbol":2788,"iucrsymbol":2789,"_solid_angles":2790,"plane_safe_permutations":2791,"setup_permutations":2792,"_faces":2793,"_edges":2794,"_algorithms":2795,"centroid":2796,"_pauling_stability_ratio":2797,"distfactor_max":2798,"xx":2799,"algo":2800,"nbsh":2801,"process_decoded":2802,"algo_d":2803,"nb_sets_hints":2804,"outs":2805,"pauling_stability_ratio":2806,"get_coordination_number":2807,"is_implemented":2808,"get_name":2809,"iupac_symbol_str":2810,"iucr_symbol_str":2811,"number_of_permutations":2812,"csm_skip_algo":2813,"distfactor":2814,"usually":2815,"symmetric":2816,"polyhedrons":2817,"theoretical":2818,"pauling":2819,"stability":2820,"rc":2821,"ra":2822,"min_dist_anions":2823,"min_dist_cation_anion":2824,"1_000_000":2825,"ipt1":2826,"pt1":2827,"ipt2":2828,"pt2":2829,"anion_radius":2830,"cation_radius":2831,"mp":2832,"ref_permutation":2833,"get_central_site":2834,"a002":2835,"perms":2836,"eqv_indices":2837,"invalid":2838,"get_pmeshes":2839,"pmesh":2840,"p_meshes":2841,"_vertices":2842,"_face_centers":2843,"n_faces":2844,"face_vertex":2845,"8f":2846,"iface":2847,"pmesh_string":2848,"only_symbols":2849,"__contains__":2850,"restrict":2851,"cg_list":2852,"coordination_geometries_files":2853,"txt":2854,"readlines":2855,"cg_file":2856,"strip":2857,"rb":2858,"loads":2859,"fsymbol":2860,"minpoints":2861,"maxpoints":2862,"separations_cg":2863,"21":2864,"get_implemented_geometries":2865,