{"sources":0,"atomate2":1,"__init__":2,"py":3,"uses":4,"_version":5,"__version__":6,"settings":7,"atomate2settings":8,"library":9,"computational":10,"materials":11,"science":12,"workflows":13,"from":14,"import":15,"importlib":16,"metadata":17,"version":18,"abinit":19,"module":20,"files":21,"defines":22,"def":23,"fname2ext":24,"filepath":25,"path":26,"str":27,"none":28,"out_to_in":29,"out_files":30,"iterable":31,"tuple":32,"src_host":33,"indir":34,"indir_name":35,"file_client":36,"fileclient":37,"link_files":38,"bool":39,"true":40,"load_abinit_input":41,"dirpath":42,"fname":43,"abinit_input":44,"json":45,"abinitinput":46,"logging":47,"os":48,"typing":49,"type_checking":50,"abipy":51,"flowtk":52,"utils":53,"abi_extensions":54,"monty":55,"serialization":56,"loadfn":57,"common":58,"before":59,"write_abinit_input_set":60,"functions":61,"manipulating":62,"__future__":63,"annotations":64,"auto_fileclient":65,"collections":66,"abc":67,"pathlib":68,"abio":69,"inputs":70,"pymatgen":71,"core":72,"structure":73,"sets":74,"base":75,"abinitinputgenerator":76,"logger":77,"getlogger":78,"__name__":79,"all_abiexts":80,"get":81,"extension":82,"given":83,"filename":84,"return":85,"found":86,"basename":87,"ext":88,"split":89,"replace":90,"nc":91,"copy":92,"link":93,"output":94,"input":95,"directory":96,"parameters":97,"list":98,"tuples":99,"copied":100,"linked":101,"source":102,"hostname":103,"used":104,"specify":105,"remote":106,"filesystem":107,"can":108,"either":109,"username":110,"remote_host":111,"just":112,"which":113,"case":114,"inferred":115,"current":116,"user":117,"local":118,"file":119,"client":120,"use":121,"performing":122,"operations":123,"whether":124,"instead":125,"copying":126,"them":127,"dest_dir":128,"abspath":129,"host":130,"out_filepath":131,"in_file":132,"src_file":133,"dest_file":134,"join":135,"else":136,"load":137,"object":138,"name":139,"containing":140,"returns":141,"abinit_input_file":142,"exists":143,"raise":144,"notimplementederror":145,"cannot":146,"without":147,"scope":148,"input_set_generator":149,"prev_outputs":150,"restart_from":151,"after":152,"write":153,"using":154,"generator":155,"have":156,"written":157,"previous":158,"directories":159,"needed":160,"calculation":161,"same":162,"restart":163,"note":164,"should":165,"provided":166,"one":167,"ais":168,"get_input_set":169,"validate":170,"runtimeerror":171,"abinitinputset":172,"valid":173,"write_input":174,"make_dir":175,"overwrite":176,"false":177,"flows":178,"running":179,"calculations":180,"class":181,"bandstructuremaker":182,"maker":183,"make":184,"self":185,"flow":186,"dataclasses":187,"dataclass":188,"field":189,"jobflow":190,"jobs":191,"linenonscfmaker":192,"relaxflowmaker":193,"makers":194,"relaxmaker":195,"staticmaker":196,"uniformnonscfmaker":197,"baseabinitmaker":198,"generate":199,"band":200,"structures":201,"static":202,"followed":203,"two":204,"non":205,"consistent":206,"uniform":207,"line":208,"mode":209,"produced":210,"scf_maker":211,"bs_maker":212,"dos":213,"static_maker":214,"default_factory":215,"dos_maker":216,"create":217,"static_job":218,"uniform_job":219,"dir_name":220,"append":221,"line_job":222,"ion_ioncell_relaxation":223,"cls":224,"args":225,"kwargs":226,"relaxation":227,"relaxation_makers":228,"lambda":229,"ionic_relaxation":230,"full_relaxation":231,"relax_job1":232,"rlx_maker":233,"rlx_job":234,"classmethod":235,"double":236,"ionic":237,"full":238,"ion_rlx_maker":239,"ioncell_rlx_maker":240,"jobsetupvars":241,"namedtuple":242,"time":243,"setup_job":244,"definition":245,"job":246,"any":247,"classvar":248,"response":249,"run":250,"run_abinit":251,"schemas":252,"taskstate":253,"task":254,"abinittaskdoc":255,"unconvergederror":256,"history":257,"jobhistory":258,"sequence":259,"events":260,"abinitcriticalwarning":261,"__all__":262,"start_time":263,"float":264,"workdir":265,"abipy_manager":266,"change":267,"future":268,"wall_time":269,"int":270,"set":271,"up":272,"start":273,"least":274,"defined":275,"supposedly":276,"first":277,"created":278,"elif":279,"we":280,"want":281,"log":282,"only":283,"due":284,"automatic":285,"another":286,"scf":287,"relax":288,"different":289,"log_restart":290,"working":291,"getcwd":292,"information":293,"about":294,"log_start":295,"log_handler":296,"filehandler":297,"atomate2_abinit":298,"setformatter":299,"formatter":300,"basic_format":301,"io":302,"addhandler":303,"atomate":304,"configuration":305,"todo":306,"how":307,"allow":308,"tuned":309,"per":310,"basis":311,"similar":312,"fw_spec":313,"passed":314,"currently":315,"disabled":316,"autoparal":317,"yet":318,"supported":319,"get_abipy_manager":320,"walltime":321,"possible":322,"see":323,"set_walltime":324,"where":325,"put":326,"walltime_command":327,"__post_init__":328,"calc_type":329,"wall":330,"run_abinit_kwargs":331,"dict":332,"keyword":333,"arguments":334,"obj":335,"task_document_kwargs":336,"taskdoc":337,"from_directory":338,"variables":339,"critical_events":340,"process":341,"post":342,"init":343,"property":344,"type":345,"add":346,"description":347,"setup":348,"general":349,"config":350,"parse":351,"outputs":352,"task_doc":353,"cwd":354,"task_label":355,"len":356,"event_report":357,"filter_types":358,"model_copy":359,"update":360,"state":361,"unconverged":362,"calcs_reversed":363,"has_abinit_completed":364,"optional":365,"think":366,"get_response":367,"task_document":368,"max_restarts":369,"abinit_max_restarts":370,"new":371,"success":372,"run_number":373,"check":374,"here":375,"stop":376,"children":377,"throw":378,"error":379,"unconverged_error":380,"msg":381,"runs":382,"stop_children":383,"stop_jobflow":384,"stored_data":385,"info":386,"getting":387,"new_job":388,"nscfconvergencewarning":389,"nonscfmaker":390,"nonscfwfqmaker":391,"relaxconvergencewarning":392,"scfconvergencewarning":393,"linenonscfsetgenerator":394,"nonscfsetgenerator":395,"nonscfwfqinputgenerator":396,"relaxsetgenerator":397,"staticsetgenerator":398,"uniformnonscfsetgenerator":399,"along":400,"nscf_line":401,"nscf_uniform":402,"nscf":403,"options":404,"symmetry":405,"lines":406,"mesh":407,"super":408,"original":409,"wfq":410,"nscf_wfq":411,"possibility":412,"tune":413,"relaxinputgenerator":414,"method":415,"relax_cell":416,"ions":417,"powerups":418,"update_maker_kwargs":419,"class_filter":420,"dict_mod_updates":421,"name_filter":422,"update_user_abinit_settings":423,"abinit_updates":424,"deepcopy":425,"abiobjects":426,"ksampling":427,"update_factory_kwargs":428,"update_user_kpoints_settings":429,"update_generator_attributes":430,"modifications":431,"inside":432,"generic":433,"shared":434,"more":435,"specific":436,"updates":437,"build":438,"apply":439,"filter":440,"match":441,"subclasses":442,"modified":443,"updated_flow":444,"isinstance":445,"update_kwargs":446,"_set":447,"dict_mod":448,"user_abinit_settings":449,"alternatively":450,"supplied":451,"updated":452,"does":453,"happen":454,"place":455,"existing":456,"keys":457,"unless":458,"explicitly":459,"specified":460,"items":461,"factory_updates":462,"kpoints_updates":463,"factory_kwargs":464,"factory":465,"user_kpoints_settings":466,"dictionary":467,"kpoints":468,"generator_updates":469,"attribute":470,"attributes":471,"abinit_cmd":472,"mpirun_cmd":473,"subprocess":474,"qutils":475,"time2slurm":476,"input_file_name":477,"log_file_name":478,"stderr_file_name":479,"sleep_time_step":480,"30":481,"abinit_mpirun_cmd":482,"command":483,"max_end_time":484,"abinit_timelimit":485,"480":486,"tuning":487,"timelimit":488,"buffer":489,"variable":490,"possibly":491,"240":492,"extend":493,"open":494,"stdout":495,"stderr":496,"popen":497,"while":498,"sleep":499,"poll":500,"break":501,"current_time":502,"remaining_time":503,"terminate":504,"wait":505,"results":506,"valueenum":507,"abinitobject":508,"calculationoutput":509,"basemodel":510,"datetime":511,"timezone":512,"electrons":513,"gsr":514,"gsrfile":515,"objects":516,"emmet":517,"math":518,"matrix3d":519,"vector3d":520,"types":521,"enums":522,"pydantic":523,"typing_extensions":524,"mpiabortfile":525,"get_event_report":526,"successful":527,"failed":528,"data":529,"band_structure":530,"electron_density":531,"e_density":532,"wfn":533,"wavefunction":534,"trajectory":535,"document":536,"defining":537,"energy":538,"final":539,"total":540,"dft":541,"energy_per_atom":542,"atom":543,"system":544,"efermi":545,"fermi":546,"level":547,"ev":548,"forces":549,"acting":550,"each":551,"stress":552,"cell":553,"is_metal":554,"metallic":555,"bandgap":556,"gap":557,"cbm":558,"conduction":559,"minimum":560,"vbm":561,"valence":562,"maximum":563,"direct_bandgap":564,"direct":565,"lumo":566,"molecules":567,"homo":568,"from_abinit_gsr":569,"must":570,"auto_load":571,"kwarg":572,"when":573,"abinitoutput":574,"default":575,"bands":576,"were":577,"included":578,"try":579,"ebands":580,"get_edge_state":581,"eig":582,"fundamental_gaps":583,"spin":584,"channel":585,"direct_gaps":586,"except":587,"valueerror":588,"electronic_output":589,"fermie":590,"cart_forces":591,"tolist":592,"cart_stress_tensor":593,"abinit_version":594,"perform":595,"completed":596,"successfully":597,"completed_at":598,"timestamp":599,"output_file_paths":600,"paths":601,"relative":602,"associated":603,"eventreport":604,"event":605,"report":606,"from_abinit_files":607,"task_name":608,"abinit_gsr_file":609,"out_gsr":610,"abinit_log_file":611,"abinit_abort_file":612,"main":613,"abort":614,"abinit_gsr":615,"from_file":616,"fromtimestamp":617,"stat":618,"st_mtime":619,"tz":620,"utc":621,"output_doc":622,"detect":623,"status":624,"has":625,"would":626,"converged":627,"other":628,"reasons":629,"what":630,"been":631,"killed":632,"slurm":633,"pbs":634,"kills":635,"ofile":636,"mpiabort_file":637,"run_completed":638,"exception":639,"exc":640,"noqa":641,"ble001":642,"parsing":643,"critical":644,"instance":645,"abinit_objects":646,"inputdoc":647,"from_abinit_calc_doc":648,"calc_doc":649,"outputdoc":650,"_find_abinit_files":651,"mson":652,"representing":653,"structuremetadata":654,"datetime_str":655,"get_uri":656,"strip_hostname":657,"summary":658,"xc":659,"exchange":660,"correlation":661,"functional":662,"calculationdocument":663,"pseudos":664,"last":665,"atoms":666,"unit":667,"last_updated":668,"included_objects":669,"tags":670,"author":671,"extracted":672,"transformations":673,"icsd_id":674,"international":675,"crystal":676,"database":677,"id":678,"all":679,"structural":680,"parsed":681,"custodian":682,"additional_json":683,"additional":684,"loaded":685,"additional_fields":686,"abinit_calculation_kwargs":687,"folder":688,"fields":689,"function":690,"doc":691,"task_files":692,"filenotfounderror":693,"all_abinit_objects":694,"convert":695,"uri":696,"vt":697,"necessary":698,"laptop":699,"store":700,"option":701,"rewrite":702,"save":703,"attr":704,"from_structure":705,"dat":706,"meta_structure":707,"include_structure":708,"getattr":709,"ddict":710,"deep":711,"_get_task_files":712,"suffix":713,"find":714,"folders":715,"names":716,"matching":717,"out":718,"returned":719,"standard":720,"search":721,"filenames":722,"ordered":723,"abinit_output_file":724,"abinit_output_filename":725,"task_names":726,"precondition":727,"range":728,"abinit_files":729,"assumptions":730,"naming":731,"outdata":732,"relative_to":733,"subfolder_match":734,"glob":735,"suffix_match":736,"subfolder":737,"schema":738,"root":739,"standard_files":740,"inputset":741,"as_pseudo_table":742,"_combine_kpoints":743,"numpy":744,"np":745,"multidataset":746,"psrepos":747,"get_repo_from_name":748,"irdvars_for_ext":749,"montyencoder":750,"jsanitize":751,"ksamplingmodes":752,"pseudo":753,"pseudotable":754,"inputgenerator":755,"vasp":756,"analyzer":757,"spacegroupanalyzer":758,"bandstructure":759,"highsymmkpath":760,"indata_prefix":761,"indatafile_prefix":762,"outdata_prefix":763,"outdatafile_prefix":764,"outdir_name":765,"tmpdata_prefix":766,"tmpdir_name":767,"initializationerror":768,"get_final_structure":769,"callable":770,"input_files":771,"zip_inputs":772,"set_workdir":773,"represent":774,"corresponding":775,"reading":776,"ird":777,"present":778,"dumps":779,"as_dict":780,"do":781,"zipping":782,"sure":783,"really":784,"makes":785,"sense":786,"also":787,"links":788,"outdir":789,"tmpdir":790,"del":791,"_outdir":792,"_tmpdir":793,"_out_filepath":794,"irdvars":795,"irdvar":796,"irdval":797,"staticmethod":798,"creates":799,"temporary":800,"dirs":801,"tmp":802,"makedirs":803,"set_vars":804,"remove_vars":805,"strict":806,"runlevel":807,"set_structure":808,"values":809,"pass":810,"mapping":811,"combination":812,"allowed":813,"added":814,"remove":815,"listed":816,"removes":817,"string":818,"strings":819,"removed":820,"keyerror":821,"basically":822,"forwards":823,"setting":824,"pseudopotentials":825,"single":826,"pseudopotential":827,"repository":828,"table":829,"pseudorepo":830,"isfile":831,"pseudo_repo_name":832,"table_name":833,"rsplit":834,"repo":835,"is_installed":836,"installed":837,"abips":838,"install":839,"get_pseudos":840,"generates":841,"short":842,"define":843,"pseudodojo":844,"https":845,"github":846,"com":847,"accuracy":848,"separated":849,"colon":850,"requires":851,"coming":852,"customize":853,"allows":854,"generated":855,"override":856,"value":857,"previously":858,"supplying":859,"reciprocal_density":860,"1000":861,"supply":862,"restart_from_deps":863,"needs":864,"format":865,"element":866,"levels":867,"extensions":868,"example":869,"wfk":870,"prev_outputs_deps":871,"required":872,"execution":873,"factory_prev_inputs_kwargs":874,"key":875,"argument":876,"runlevels":877,"compatible":878,"force_gamma":879,"force":880,"gamma":881,"centered":882,"kpoint":883,"generation":884,"symprec":885,"tolerance":886,"finding":887,"points":888,"abinit_calculation":889,"oncvpsp":890,"pbe":891,"sr":892,"pdv0":893,"check_format_prev_dirs":894,"resolve_deps":895,"resolve_prev_inputs":896,"assume":897,"execute":898,"dependencies":899,"all_irdvars":900,"continue":901,"deps":902,"get_abinit_input":903,"always":904,"reset":905,"pop_irdvars":906,"need":907,"density":908,"extra":909,"down":910,"prev_dirs":911,"check_runlevel":912,"prev_inputs_kwargs":913,"_get_in_file_name":914,"dependency":915,"prev_dir":916,"resolve":917,"assumes":918,"correct":919,"deps_irdvars":920,"dep":921,"exts":922,"intersection":923,"inp_files":924,"resolve_dep_exts":925,"suitable":926,"retrieves":927,"selected":928,"abinit_inputs":929,"var_name":930,"run_levels":931,"multiple":932,"requirements":933,"final_structure":934,"n_found":935,"n_required":936,"exactly":937,"prev_outdir":938,"don":939,"1wf":940,"1den":941,"special":942,"treatment":943,"find_1wf_files":944,"find_1den_files":945,"occur":946,"den":947,"relaxations":948,"md":949,"may":950,"several":951,"tim":952,"_den":953,"look":954,"out_den":955,"path_in":956,"last_timden":957,"find_last_timden_file":958,"endswith":959,"in_file_name":960,"out_file":961,"has_abiext":962,"abinit_settings":963,"kpoints_settings":964,"input_index":965,"_set_kpt_vars":966,"_clean_none":967,"_get_kpoints":968,"keywords":969,"index":970,"select":971,"total_factory_kwargs":972,"previous_outputs":973,"consider":974,"cases":975,"might":976,"even":977,"mandatory":978,"since":979,"fit":980,"your":981,"generated_input":982,"printed":983,"cause":984,"issues":985,"checking":986,"according":987,"kpt_related_vars":988,"kpt":989,"kptbounds":990,"kptnrm":991,"kptns":992,"kptns_hf":993,"kptopt":994,"kptrlatt":995,"kptrlen":996,"ndivk":997,"ndivsm":998,"ngkpt":999,"nkpath":1000,"nkpt":1001,"nshiftk":1002,"shiftk":1003,"wtk":1004,"pop_vars":1005,"abivars":1006,"whose":1007,"modify":1008,"ai":1009,"otherwise":1010,"kconfig":1011,"explicit":1012,"added_kpoints":1013,"zero_weighted_reciprocal_density":1014,"zero_weighted_line_density":1015,"base_kpoints":1016,"line_density":1017,"handle":1018,"kpath":1019,"kpath_kwargs":1020,"frac_k_points":1021,"_k_points_labels":1022,"get_kpoints":1023,"coords_are_cartesian":1024,"num_kpts":1025,"kpts":1026,"kpts_weights":1027,"comment":1028,"grid_density":1029,"regular":1030,"weighted":1031,"point":1032,"grid":1033,"vasp_kpoints":1034,"automatic_density":1035,"monkhorst":1036,"kpt_shifts":1037,"kpts_shift":1038,"automatic_density_by_vol":1039,"sga":1040,"get_ir_reciprocal_mesh":1041,"means":1042,"so":1043,"some":1044,"sanity":1045,"kpoints_objects":1046,"invalid":1047,"algo":1048,"combine":1049,"together":1050,"weights":1051,"kpoints_object":1052,"concatenate":1053,"combined":1054,"factories":1055,"dos_from_gsinput":1056,"ebands_from_gsinput":1057,"ion_ioncell_relax_input":1058,"generators":1059,"nscf_from_gsinput":1060,"scf_input":1061,"input_tags":1062,"molecular_dynamics":1063,"gs_restart_from_deps":1064,"ground":1065,"related":1066,"disable":1067,"scf_abinit_settings":1068,"ionmov":1069,"optcell":1070,"ntime":1071,"_get_nband":1072,"ddkinputgenerator":1073,"nbands_factor":1074,"gs_input":1075,"nband":1076,"previous_abinit_input":1077,"next":1078,"iter":1079,"n_band":1080,"num_valence_electrons":1081,"ceil":1082,"wfq_tol":1083,"tolwfr":1084,"1e":1085,"18":1086,"ddk":1087,"tolmxf":1088,"5e":1089,"determines":1090,"move":1091,"tools":1092,"collection":1093,"helper":1094,"package":1095,"errorcode":1096,"abiatomateerror":1097,"to_dict":1098,"abinitoutputfile":1099,"dfpt":1100,"ddb":1101,"ddbfile":1102,"abinitruntimeerror":1103,"walltimeerror":1104,"classes":1105,"msonable":1106,"montydecoder":1107,"tmpdata":1108,"indata":1109,"tmpdatafile_prefix":1110,"err":1111,"output_file_name":1112,"abo":1113,"outnc_file_name":1114,"out_out":1115,"abi":1116,"__abi_mpiabortfile__":1117,"dummy_filename":1118,"__dummy__":1119,"elphon_output_file_name":1120,"abo_elphon":1121,"ddk_files_file_name":1122,"history_json":1123,"code":1124,"classify":1125,"errors":1126,"unrecoverable":1127,"unclassified":1128,"unconverged_parameters":1129,"initialization":1130,"postprocess":1131,"error_code":1132,"representation":1133,"num_errors":1134,"num_warnings":1135,"warnings":1136,"from_dict":1137,"raised":1138,"during":1139,"contains":1140,"warning":1141,"initialized":1142,"prepare":1143,"message":1144,"construct":1145,"number":1146,"doesn":1147,"both":1148,"decode_monty":1149,"hasattr":1150,"dct":1151,"error_message":1152,"__module__":1153,"its":1154,"dec":1155,"process_decoded":1156,"restart_info":1157,"restartinfo":1158,"restarterror":1159,"didn":1160,"converge":1161,"max":1162,"restarts":1163,"further":1164,"postprocesserror":1165,"previous_dir":1166,"num_restarts":1167,"prev_indir":1168,"complete":1169,"show":1170,"problems":1171,"encountered":1172,"processing":1173,"pointing":1174,"step":1175,"tries":1176,"gsr_path":1177,"gsr_file":1178,"occurred":1179,"log015":1180,"ddb_path":1181,"ddb_file":1182,"out_path":1183,"ab_out":1184,"could":1185,"analyzes":1186,"presence":1187,"parser":1188,"eventsparser":1189,"abi_mpiabortfile":1190,"abort_report":1191,"empty":1192,"than":1193,"initial":1194,"differs":1195,"last_abort_event":1196,"entry":1197,"report_exception":1198,"deque":1199,"traceback":1200,"jobevent":1201,"abinitevent":1202,"log_initialization":1203,"initialization_info":1204,"log_corrections":1205,"corrections":1206,"log_end":1207,"tracking":1208,"creation":1209,"actions":1210,"performed":1211,"thus":1212,"dicts":1213,"lists":1214,"expected":1215,"dictionaries":1216,"initializations":1217,"handled":1218,"item":1219,"contain":1220,"starting":1221,"forwarded":1222,"resets":1223,"order":1224,"keep":1225,"track":1226,"details":1227,"job_class":1228,"applied":1229,"restarted":1230,"started":1231,"ended":1232,"end":1233,"happens":1234,"starts":1235,"count":1236,"following":1237,"get_events_by_types":1238,"event_type":1239,"is_first_run":1240,"log_autoparal":1241,"optconf":1242,"log_unconverged":1243,"log_finalized":1244,"final_input":1245,"log_converge_params":1246,"unconverged_params":1247,"abiinput":1248,"log_error":1249,"log_abinit_stop":1250,"run_time":1251,"get_total_run_time":1252,"determine":1253,"nstart":1254,"calling":1255,"logged":1256,"finalized":1257,"total_run_time":1258,"convergence":1259,"respect":1260,"dilatmx":1261,"relaxing":1262,"params":1263,"param":1264,"new_value":1265,"old_value":1266,"tb":1267,"format_exc":1268,"event_details":1269,"stacktrace":1270,"serializable":1271,"exception_details":1272,"attributeerror":1273,"baseexception":1274,"couldn":1275,"serialized":1276,"stopped":1277,"abinit_stop":1278,"based":1279,"summing":1280,"times":1281,"te":1282,"categorize":1283,"taskmanager":1284,"tasks":1285,"manager":1286,"abipy_manager_file":1287,"from_user_config":1288,"aims":1289,"fhi":1290,"interface":1291,"copy_aims_outputs":1292,"src_dir":1293,"additional_aims_files":1294,"restart_to_input":1295,"copy_files":1296,"get_zfile":1297,"write_aims_input_set":1298,"cleanup_aims_outputs":1299,"dealing":1300,"gunzip_files":1301,"molecule":1302,"aimsinputgenerator":1303,"inspired":1304,"cp2k":1305,"plugin":1306,"directory_listing":1307,"listdir":1308,"like":1309,"cube":1310,"whatever":1311,"additional_files":1312,"hessian":1313,"geometry":1314,"next_step":1315,"csc":1316,"pattern":1317,"as_posix":1318,"all_files":1319,"allow_missing":1320,"include_files":1321,"zipped_files":1322,"gz":1323,"finished":1324,"file_patterns":1325,"ghi":1326,"calc":1327,"aimsinputset":1328,"properties":1329,"aims_is":1330,"writing":1331,"unnecessary":1332,"patterns":1333,"deletion":1334,"files_to_delete":1335,"anharmonicity":1336,"anharmonicitymaker":1337,"baseanharmonicitymaker":1338,"prev_calc_dir_argname":1339,"phonons":1340,"phononmaker":1341,"quantification":1342,"calculate":1343,"score":1344,"material":1345,"sigma":1346,"doi":1347,"org":1348,"10":1349,"1103":1350,"physrevmaterials":1351,"083809":1352,"calculating":1353,"generating":1354,"shot":1355,"sample":1356,"harmonic":1357,"phonon_maker":1358,"basephononmaker":1359,"phonon":1360,"model":1361,"informing":1362,"between":1363,"codes":1364,"left":1365,"implemented":1366,"inheriting":1367,"applicable":1368,"relax_maker":1369,"ordering":1370,"doublerelaxmaker":1371,"work":1372,"baseaimsmaker":1373,"from_parameters":1374,"species_defaults":1375,"light":1376,"tight":1377,"relax_maker1":1378,"relax_maker2":1379,"second":1380,"chained":1381,"relax1":1382,"relax2":1383,"ase":1384,"parameter":1385,"doublerelaxflow":1386,"species":1387,"defaults":1388,"species_dir":1389,"various":1390,"checks":1391,"include":1392,"basis_set":1393,"basis_set_dir":1394,"oserror":1395,"exist":1396,"now":1397,"actual":1398,"begins":1399,"input_set":1400,"user_params":1401,"elastic":1402,"elasticmaker":1403,"baseelasticmaker":1404,"constants":1405,"constant":1406,"initially":1407,"obtain":1408,"approximately":1409,"zero":1410,"subsequently":1411,"perturbations":1412,"lattice":1413,"vectors":1414,"resulting":1415,"tensor":1416,"calculated":1417,"allowing":1418,"degrees":1419,"freedom":1420,"finally":1421,"constitutive":1422,"relations":1423,"linear":1424,"elasticity":1425,"relating":1426,"strain":1427,"employed":1428,"6x6":1429,"aggregate":1430,"voigt":1431,"reuss":1432,"bounds":1433,"bulk":1434,"shear":1435,"moduli":1436,"derived":1437,"heavily":1438,"recommended":1439,"symmetrize":1440,"passing":1441,"reduction":1442,"routines":1443,"effective":1444,"reducing":1445,"deformations":1446,"expansion":1447,"determined":1448,"sym_reduce":1449,"reduce":1450,"precision":1451,"bulk_relax_maker":1452,"skip":1453,"elastic_relax_maker":1454,"generate_elastic_deformations_kwargs":1455,"generate_elastic_deformations":1456,"fit_elastic_tensor_kwargs":1457,"fit_elastic_tensor":1458,"elasticdocument":1459,"from_stresses":1460,"fixed_cell_relaxation":1461,"stress_sign_correction":1462,"sign":1463,"done":1464,"because":1465,"sigma_ij":1466,"partial":1467,"n_ij":1468,"eos":1469,"aimseosmaker":1470,"equation":1471,"workflow":1472,"commoneosmaker":1473,"relaxes":1474,"initial_relax_maker":1475,"series":1476,"relaxed":1477,"evaluate":1478,"energies":1479,"eos_relax_maker":1480,"deformed":1481,"statics":1482,"percentage":1483,"deformation":1484,"number_of_frames":1485,"postprocessor":1486,"eospostprocessor":1487,"postprocessing":1488,"postprocesseosenergy":1489,"_store_transformation_information":1490,"unfortunately":1491,"validation":1492,"interpreted":1493,"setdefault":1494,"initial_params":1495,"eos_params":1496,"gw":1497,"gwconvergencemaker":1498,"convergencemaker":1499,"gwmaker":1500,"adjusted":1501,"employs":1502,"fact":1503,"scale":1504,"large":1505,"prefactor":1506,"part":1507,"negligible":1508,"criterion_name":1509,"criterion":1510,"epsilon":1511,"difference":1512,"subsequent":1513,"convergence_field":1514,"changes":1515,"achieve":1516,"convergence_steps":1517,"depleted":1518,"reached":1519,"phonondisplacementmaker":1520,"phonondisplacementmakersocket":1521,"literal":1522,"phonopy":1523,"supercells":1524,"displaced":1525,"accurate":1526,"computed":1527,"help":1528,"converted":1529,"dynamical":1530,"matrix":1531,"polarization":1532,"effects":1533,"correction":1534,"born":1535,"charges":1536,"densities":1537,"states":1538,"thermodynamic":1539,"space":1540,"group":1541,"detected":1542,"too":1543,"many":1544,"displacement":1545,"adjust":1546,"enough":1547,"primitive":1548,"conventional":1549,"use_primitive_standard_structure":1550,"use_conventional_standard_structure":1551,"distance":1552,"min_length":1553,"min":1554,"length":1555,"supercell":1556,"built":1557,"prefer_90_degrees":1558,"algorithm":1559,"90":1560,"degree":1561,"angles":1562,"get_supercell_size_kwargs":1563,"get_supercell_size":1564,"size":1565,"use_symmetrized_structure":1566,"enforce":1567,"computation":1568,"setyawan":1569,"curtarolo":1570,"2010":1571,"high":1572,"throughput":1573,"electronic":1574,"challenges":1575,"49":1576,"299":1577,"312":1578,"1016":1579,"commatsci":1580,"05":1581,"010":1582,"certain":1583,"definitions":1584,"rely":1585,"seekpath":1586,"however":1587,"compute":1588,"static_energy_maker":1589,"born_maker":1590,"phonon_displacement_maker":1591,"generate_frequencies_eigenvectors_kwargs":1592,"generate_frequencies_eigenvectors":1593,"create_thermal_displacements":1594,"thermal_displacement_matrices":1595,"kpath_scheme":1596,"scheme":1597,"please":1598,"aware":1599,"you":1600,"kind":1601,"available":1602,"schemes":1603,"hinuma":1604,"setyawan_curtarolo":1605,"latimer_munro":1606,"relies":1607,"relationship":1608,"forcefield":1609,"store_force_constants":1610,"stored":1611,"socket":1612,"phonon_symprec":1613,"01":1614,"20":1615,"communicator":1616,"dumpfn":1617,"run_aims":1618,"should_stop_children":1619,"aimstaskdoc":1620,"gzip_output_folder":1621,"exclude":1622,"those":1623,"_input_files":1624,"control":1625,"_output_files":1626,"zip":1627,"additionally":1628,"_files_to_zip":1629,"write_input_set_kwargs":1630,"copy_aims_kwargs":1631,"run_aims_kwargs":1632,"stop_children_kwargs":1633,"write_additional_data":1634,"fireworks":1635,"character":1636,"typically":1637,"denote":1638,"avoid":1639,"automatically":1640,"my_file":1641,"txt":1642,"contents":1643,"store_output_data":1644,"jobstore":1645,"through":1646,"governed":1647,"decide":1648,"child":1649,"proceed":1650,"cleanup":1651,"disk":1652,"gzip":1653,"vasp_zip_files":1654,"files_list":1655,"convergencesummary":1656,"convergence_file_name":1657,"steps":1658,"performs":1659,"stops":1660,"absolute":1661,"less":1662,"001":1663,"convergence_data":1664,"prev_output_value":1665,"top":1666,"controlling":1667,"iteration":1668,"date":1669,"being":1670,"idx":1671,"convergence_field_values":1672,"criterion_values":1673,"abs":1674,"convergence_field_name":1675,"split_prev_dir":1676,"convergence_file":1677,"dump":1678,"next_base_job":1679,"append_name":1680,"append_str":1681,"next_job":1682,"replace_flow":1683,"from_data":1684,"socketiostaticmaker":1685,"pyfhiaims":1686,"external_interfaces":1687,"read_aims_output":1688,"bs":1689,"bandstructuresetgenerator":1690,"gwsetgenerator":1691,"socketiosetgenerator":1692,"run_aims_socket":1693,"fixed":1694,"socketio":1695,"calculator":1696,"maintain":1697,"server":1698,"port":1699,"listen":1700,"multi_scf":1701,"localhost":1702,"12345":1703,"communication":1704,"speed":1705,"from_prev":1706,"hostless_prev_dir":1707,"images":1708,"img":1709,"ii":1710,"magnetism":1711,"magneticstaticmaker":1712,"magneticrelaxmaker":1713,"magneticrelaxsetgenerator":1714,"magneticstaticsetgenerator":1715,"magnetic":1716,"magnetic_scf":1717,"phonondisplacementmakers":1718,"finite":1719,"tighter":1720,"stricter":1721,"normal":1722,"compute_forces":1723,"aims_cmd":1724,"handle_unsuccessful":1725,"expandvars":1726,"calculators":1727,"runner":1728,"socketiocalculator":1729,"aseatomsadaptor":1730,"return_code":1731,"call":1732,"bin":1733,"bash":1734,"env":1735,"environ":1736,"three":1737,"way":1738,"toggle":1739,"looks":1740,"ok":1741,"actually":1742,"mark":1743,"nothing":1744,"unknown":1745,"structures_to_calculate":1746,"ase_adaptor":1747,"atoms_to_calculate":1748,"get_atoms":1749,"param_file":1750,"del_keys":1751,"val":1752,"pop":1753,"use_pimd_wrapper":1754,"atoms_calc":1755,"delete":1756,"prior":1757,"clear":1758,"positions":1759,"system_changes":1760,"close":1761,"ensure_stress_full":1762,"input_stress":1763,"aimsobject":1764,"calculationinput":1765,"_get_output_file_paths":1766,"spectrum":1767,"electronic_structure":1768,"aimsgeometryin":1769,"aimsoutput":1770,"volumetricdata":1771,"store_volumetric_data":1772,"total_density":1773,"test":1774,"vector":1775,"3x3":1776,"array":1777,"shape":1778,"xx":1779,"yy":1780,"zz":1781,"yz":1782,"xz":1783,"xy":1784,"flatten":1785,"all_forces":1786,"stresses":1787,"atomic":1788,"virial":1789,"atomic_steps":1790,"from_aims_output":1791,"store_trajectory":1792,"_get_volumetric_data":1793,"_parse_dos":1794,"flag":1795,"fermi_energy":1796,"band_gap":1797,"direct_band_gap":1798,"st":1799,"ff":1800,"final_energy":1801,"from_aims_files":1802,"aims_output_file":1803,"volumetric_files":1804,"parse_dos":1805,"parse_bandstructure":1806,"aims_version":1807,"has_aims_completed":1808,"volumetric":1809,"auto":1810,"never":1811,"projections":1812,"projects":1813,"rather":1814,"pmg":1815,"pushed":1816,"bson":1817,"od":1818,"useful":1819,"trajectories":1820,"store_scf":1821,"aims_geo_in":1822,"aims_parameters":1823,"pj":1824,"input_doc":1825,"aims_output":1826,"from_outfile":1827,"aims_objects":1828,"ignore":1829,"pgh003":1830,"_parse_bandstructure":1831,"traj":1832,"_parse_trajectory":1833,"lower":1834,"aims_object":1835,"volumetric_file":1836,"etc":1837,"volumetric_data":1838,"file_type":1839,"from_cube":1840,"accordingly":1841,"ionic_steps":1842,"complete_dos":1843,"support":1844,"distinction":1845,"aims_ouput":1846,"grab":1847,"analysisdoc":1848,"from_aims_calc_docs":1849,"calc_docs":1850,"moleculemetadata":1851,"basetaskdocument":1852,"calc_types":1853,"tasktype":1854,"entries":1855,"computed_entries":1856,"computedentry":1857,"_volumetric_files":1858,"spin_density":1859,"eigenstate_density":1860,"delta_volume":1861,"volume":1862,"delta_volume_as_percent":1863,"max_force":1864,"analysis":1865,"documents":1866,"delta_vol":1867,"percent_delta_vol":1868,"final_calc":1869,"_get_max_force":1870,"from_aims_calc_doc":1871,"species_info":1872,"speciessummary":1873,"magnetic_moments":1874,"moments":1875,"magmom":1876,"site_properties":1877,"_find_aims_files":1878,"achieved":1879,"convergence_criterion_name":1880,"study":1881,"against":1882,"convergence_criterion_value":1883,"convergence_field_value":1884,"asked_epsilon":1885,"criteria":1886,"asked":1887,"actual_epsilon":1888,"_get_state":1889,"job_dir":1890,"did":1891,"calc_code":1892,"aims_calculation_kwargs":1893,"all_aims_objects":1894,"get_entry":1895,"job_id":1896,"task_type":1897,"identifier":1898,"entry_dict":1899,"entry_id":1900,"composition":1901,"formula":1902,"run_type":1903,"tarp":1904,"mangnetism":1905,"tasktypes":1906,"changed":1907,"require":1908,"optimization":1909,"aims_output_filename":1910,"v_hartree":1911,"aims_files":1912,"vol_files":1913,"vol":1914,"_files":1915,"linalg":1916,"norm":1917,"axis":1918,"all_calcs_completed":1919,"_segmentdict":1920,"typeddict":1921,"prepare_band_input":1922,"utilities":1923,"gims":1924,"own":1925,"dedicated":1926,"python":1927,"coords":1928,"labels":1929,"angstrom":1930,"bp":1931,"lines_and_labels":1932,"current_segment":1933,"label_":1934,"rename":1935,"label":1936,"segment":1937,"lstart":1938,"lend":1939,"5f":1940,"4d":1941,"mkdir":1942,"rmdir":1943,"contextlib":1944,"shutil":1945,"control_file_name":1946,"params_json_file_name":1947,"geometry_file_name":1948,"contextmanager":1949,"intermediately":1950,"some_path":1951,"stuff":1952,"old":1953,"upon":1954,"exiting":1955,"chdir":1956,"yield":1957,"rmtree":1958,"units":1959,"pi":1960,"602176634e":1961,"19":1962,"codata":1963,"2002":1964,"thz":1965,"1e12":1966,"amu":1967,"66053906660e":1968,"27":1969,"kg":1970,"aa":1971,"omegatothz":1972,"n816":1973,"ev_per_a3_to_kbar":1974,"1e8":1975,"amset":1976,"copy_amset_files":1977,"write_amset_settings":1978,"settings_updates":1979,"rename_files":1980,"gunzip":1981,"gzipped":1982,"hostnames":1983,"properly":1984,"yaml":1985,"vasprun":1986,"xml":1987,"band_structure_data":1988,"h5":1989,"transport":1990,"found_file":1991,"prev":1992,"amset_settings_update":1993,"write_settings":1994,"amsetmaker":1995,"gzip_dir":1996,"check_converged":1997,"run_amset":1998,"amsettaskdocument":1999,"wavefunction_dir":2000,"deformation_dir":2001,"bandstructure_dir":2002,"resubmit":2003,"denser":2004,"interpolation":2005,"factor":2006,"output_schema":2007,"dense":2008,"prev_transport_file":2009,"transport_data":2010,"transport_":2011,"include_mesh":2012,"resubmission":2013,"interpolation_factor":2014,"new_transport":2015,"old_transport":2016,"_convergence_properties":2017,"tensor_average":2018,"ndarray":2019,"pydash":2020,"mobility":2021,"overall":2022,"seebeck":2023,"multiprocessing":2024,"std_out":2025,"f_std":2026,"std_err":2027,"f_err":2028,"s607":2029,"averaged":2030,"within":2031,"tol":2032,"assessed":2033,"flagged":2034,"conductivity":2035,"thermal":2036,"prop":2037,"new_prop":2038,"old_prop":2039,"skipping":2040,"new_avg":2041,"old_avg":2042,"diff":2043,"isfinite":2044,"very":2045,"small":2046,"numbers":2047,"numerical":2048,"noise":2049,"less_than_one":2050,"element_converged":2051,"100":2052,"average":2053,"eigenvalues":2054,"eigvalsh":2055,"transportdata":2056,"usagestats":2057,"re":2058,"union":2059,"meshdata":2060,"_get_structure":2061,"dev":2062,"importerror":2063,"doping":2064,"carrier":2065,"concentrations":2066,"cm":2067,"temperatures":2068,"fermi_levels":2069,"ndoping":2070,"ntemps":2071,"µv":2072,"electronic_thermal_conductivity":2073,"mk":2074,"vs":2075,"scattering_type":2076,"timing":2077,"taken":2078,"scattering":2079,"max_memory":2080,"memory":2081,"usage":2082,"mb":2083,"irreducible":2084,"fractional":2085,"coordinates":2086,"ir_kpoints":2087,"ir_to_full_kpoint_mapping":2088,"intrinsic":2089,"vb_idx":2090,"highest":2091,"num_electrons":2092,"velocities":2093,"scattering_rates":2094,"rates":2095,"nscattering_types":2096,"nbands":2097,"nkpoints":2098,"fd_cutoffs":2099,"cutoffs":2100,"min_cutoff":2101,"max_cutoff":2102,"cutoff":2103,"usage_stats":2104,"kpoint_mesh":2105,"interpolated":2106,"metal":2107,"scattering_labels":2108,"soc":2109,"orbit":2110,"coupling":2111,"load_mesh":2112,"util":2113,"cast_dict_list":2114,"transport_file":2115,"inter_mesh":2116,"findall":2117,"map":2118,"read_text":2119,"insert":2120,"known":2121,"mesh_kwargs":2122,"mesh_files":2123,"mesh_":2124,"duplicated":2125,"prod":2126,"extract":2127,"vr_files":2128,"bs_files":2129,"bsvasprun":2130,"get_band_structure":2131,"simulation":2132,"environment":2133,"asemaker":2134,"abstractmethod":2135,"aserelaxmaker":2136,"emtrelaxmaker":2137,"lennardjonesrelaxmaker":2138,"storetrajectoryoption":2139,"aseresult":2140,"asetaskdoc":2141,"aserelaxer":2142,"asemoleculetaskdoc":2143,"asestructuretaskdoc":2144,"_ase_data_objects":2145,"mol_or_struct":2146,"basic":2147,"template":2148,"relevant":2149,"intent":2150,"twofold":2151,"users":2152,"wish":2153,"access":2154,"subclass":2155,"sufficient":2156,"emt":2157,"emtstaticmaker":2158,"adapt":2159,"run_ase":2160,"calculator_kwargs":2161,"ionic_step_data":2162,"quantities":2163,"taskdocument":2164,"struct_or_mol":2165,"magmoms":2166,"aliases":2167,"identical":2168,"unused":2169,"signature":2170,"to_mol_or_struct_metadata_doc":2171,"is_mol":2172,"adaptor":2173,"t_i":2174,"perf_counter":2175,"get_potential_energy":2176,"t_f":2177,"final_mol_or_struct":2178,"get_":2179,"elapsed_time":2180,"lennardjonesstaticmaker":2181,"subclassed":2182,"subclassing":2183,"fix_symmetry":2184,"fix":2185,"refines":2186,"relax_kwargs":2187,"optimizer_kwargs":2188,"500":2189,"negative":2190,"defaulting":2191,"relaxer":2192,"gfnxtbrelaxmaker":2193,"gfnxtbstaticmaker":2194,"potential":2195,"serves":2196,"mostly":2197,"purposes":2198,"documentation":2199,"lennard":2200,"jones":2201,"12":2202,"lj":2203,"lennardjones":2204,"tblite":2205,"gfn":2206,"xtb":2207,"citing":2208,"neugebauer":2209,"bädorf":2210,"ehlert":2211,"hansen":2212,"grimme":2213,"comput":2214,"chem":2215,"44":2216,"2120":2217,"2023":2218,"gfn1":2219,"bannwarth":2220,"shushkov":2221,"theory":2222,"13":2223,"1989":2224,"2017":2225,"gfn2":2226,"15":2227,"1652":2228,"2019":2229,"charge":2230,"multiplicity":2231,"guess":2232,"sad":2233,"max_iterations":2234,"250":2235,"mixer_damping":2236,"electric_field":2237,"spin_polarization":2238,"electronic_temperature":2239,"300":2240,"cache_api":2241,"verbosity":2242,"pip":2243,"conda":2244,"forge":2245,"gfnn":2246,"mdensemble":2247,"enum":2248,"dynamicspresets":2249,"asemdmaker":2250,"sys":2251,"lennardjonesmdmaker":2252,"gfnxtbmdmaker":2253,"import_module":2254,"moleculardynamics":2255,"npt":2256,"velocitydistribution":2257,"maxwellboltzmanndistribution":2258,"stationary":2259,"zerorotation":2260,"scipy":2261,"interpolate":2262,"interp1d":2263,"trajectoryobserver":2264,"ensembles":2265,"nve":2266,"nvt":2267,"mappings":2268,"thermo":2269,"baro":2270,"stats":2271,"nve_velocityverlet":2272,"verlet":2273,"velocityverlet":2274,"nvt_andersen":2275,"andersen":2276,"nvt_berendsen":2277,"nvtberendsen":2278,"nvt_langevin":2279,"langevin":2280,"nvt_nose_hoover":2281,"npt_berendsen":2282,"nptberendsen":2283,"npt_nose_hoover":2284,"pie796":2285,"npt_nose_hoover_chain":2286,"nose_hoover_chain":2287,"mtknpt":2288,"default_dynamics":2289,"nose":2290,"hoover":2291,"chain":2292,"_valid_dynamics":2293,"preset":2294,"__members__":2295,"ensemble":2296,"thermostat":2297,"implementation":2298,"temperature":2299,"kelvin":2300,"tebeg":2301,"teend":2302,"time_step":2303,"femtoseconds":2304,"potim":2305,"pressure":2306,"kb":2307,"pstress":2308,"dynamics":2309,"friction":2310,"coefficient":2311,"ps":2312,"langevin_gamma":2313,"rest":2314,"custom":2315,"inherited":2316,"consult":2317,"ase_md_kwargs":2318,"timestep":2319,"fs":2320,"isotope":2321,"hydrogen":2322,"n_steps":2323,"1d":2324,"schedule":2325,"linearly":2326,"throughout":2327,"kilobar":2328,"pre":2329,"specifying":2330,"traj_file":2331,"traj_file_fmt":2332,"xdatcar":2333,"parquet":2334,"writes":2335,"style":2336,"efficiency":2337,"traj_interval":2338,"interval":2339,"saving":2340,"mb_velocity_seed":2341,"random":2342,"seed":2343,"maxwell":2344,"boltzmann":2345,"distribution":2346,"zero_linear_momentum":2347,"initialize":2348,"momentum":2349,"zero_angular_momentum":2350,"angular":2351,"verbose":2352,"print":2353,"screen":2354,"use_emmet_models":2355,"models":2356,"larger":2357,"_interpolate_quantity":2358,"n_pts":2359,"_get_ensemble_schedule":2360,"ase_forcefield_use_emmet_models":2361,"ensure":2362,"n_vals":2363,"interp":2364,"linspace":2365,"barostat":2366,"nan":2367,"t_schedule":2368,"p_schedule":2369,"ndim":2370,"normally":2371,"scalars":2372,"principle":2373,"quantity":2374,"giving":2375,"arange":2376,"_get_ensemble_defaults":2377,"temperature_k":2378,"externalstress":2379,"issubclass":2380,"longer":2381,"advised":2382,"switch":2383,"stress_kwarg":2384,"pressure_au":2385,"1e3":2386,"bar":2387,"permit":2388,"has_h_isotope":2389,"initial_velocities":2390,"thermostats":2391,"_dyn_mod_path":2392,"to_ase_atoms":2393,"until":2394,"instantiated":2395,"upper":2396,"triangular":2397,"set_cell":2398,"standard_form":2399,"form":2400,"set_velocities":2401,"isnan":2402,"rng":2403,"default_rng":2404,"md_observer":2405,"store_md_outputs":2406,"md_runner":2407,"attach":2408,"_callback":2409,"dyn":2410,"_temperature_k":2411,"nsteps":2412,"slf001":2413,"set_temperature":2414,"set_pressure":2415,"broken":2416,"set_stress":2417,"redirect_stdout":2418,"stringio":2419,"fmt":2420,"get_structure":2421,"to_emmet_trajectory":2422,"to_pymatgen_trajectory":2423,"overwritten":2424,"neb":2425,"asenebfromimagesmaker":2426,"nebresult":2427,"asenebfromendpointsmaker":2428,"mep":2429,"idpp_interpolate":2430,"interpolate_endpoints_ase":2431,"emtnebfromimagesmaker":2432,"asenebinterface":2433,"nebinterpolation":2434,"_get_images_from_endpoints":2435,"neb_kwargs":2436,"neb_doc_kwargs":2437,"run_neb":2438,"prevent":2439,"image":2440,"interpolate_endpoints":2441,"endpoints":2442,"num_images":2443,"interpolation_method":2444,"interpolation_kwargs":2445,"optionally":2446,"hop":2447,"interpolates":2448,"endpoint_relax_maker":2449,"methods":2450,"specifies":2451,"intermediate":2452,"endpoint":2453,"endpoint_jobs":2454,"relax_job":2455,"get_images":2456,"neb_from_images":2457,"endpoint_atoms":2458,"interp_method":2459,"idpp":2460,"convert_stress_from_voigt_to_symm":2461,"vector6d":2462,"voigt_6_to_full_3x3_stress":2463,"gpa":2464,"aseobject":2465,"asebasemodel":2466,"generalized":2467,"materialsvirtuallab":2468,"m3gnet":2469,"released":2470,"under":2471,"bsd":2472,"clause":2473,"license":2474,"copyright":2475,"applies":2476,"2022":2477,"virtual":2478,"lab":2479,"atomtrajectory":2480,"pmgtrajectory":2481,"_task_doc_translation_keys":2482,"ase_calculator_name":2483,"is_force_converged":2484,"energy_downhill":2485,"converts":2486,"a³":2487,"kbar":2488,"comply":2489,"mp":2490,"convention":2491,"__getitem__":2492,"__setitem__":2493,"model_post_init":2494,"context":2495,"ionicstep":2496,"asetaskdocument":2497,"frame":2498,"molecular":2499,"optimizer":2500,"interatomic":2501,"seconds":2502,"subscriptable":2503,"backwards":2504,"compatibility":2505,"assignment":2506,"setattr":2507,"establish":2508,"alias":2509,"free":2510,"site":2511,"blob":2512,"storage":2513,"retrieved":2514,"from_ase_task_doc":2515,"ase_task_doc":2516,"manipulation":2517,"summarizing":2518,"from_ase_compatible_result":2519,"result":2520,"input_mol_or_struct":2521,"to_pmg":2522,"frame_props":2523,"indices":2524,"workaround":2525,"correctly":2526,"limit":2527,"output_mol_or_struct":2528,"final_forces":2529,"final_stress":2530,"ionic_step_props":2531,"frame_properties":2532,"use_ionic_step_props":2533,"enumerate":2534,"equivalent":2535,"classical":2536,"forcefields":2537,"docs":2538,"depending":2539,"meta_class":2540,"meta_":2541,"from_":2542,"accessing":2543,"propertynotimplementederror":2544,"singlepoint":2545,"singlepointcalculator":2546,"constraints":2547,"fixsymmetry":2548,"filters":2549,"frechetcellfilter":2550,"asetrajectory":2551,"ase_write":2552,"optimize":2553,"bfgs":2554,"fire":2555,"lbfgs":2556,"bfgslinesearch":2557,"lbfgslinesearch":2558,"mdmin":2559,"sciopt":2560,"scipyfminbfgs":2561,"scipyfmincg":2562,"nebmethod":2563,"pathlike":2564,"trajectoryreader":2565,"optimizers":2566,"force_based_optimizers":2567,"chosen":2568,"consistency":2569,"nebsetgenerator":2570,"default_neb_kwargs":2571,"climb":2572,"improvedtangent":2573,"__call__":2574,"compute_energy":2575,"observer":2576,"hook":2577,"saves":2578,"observe":2579,"_is_periodic":2580,"pbc":2581,"_calc_kwargs":2582,"implemented_properties":2583,"atom_positions":2584,"cells":2585,"_store_md_outputs":2586,"saved":2587,"get_forces":2588,"kinetic":2589,"parts":2590,"ideal":2591,"gas":2592,"contribution":2593,"periodic":2594,"systems":2595,"get_stress":2596,"include_ideal_gas":2597,"get_magnetic_moments":2598,"get_positions":2599,"get_cell":2600,"get_velocities":2601,"get_temperature":2602,"to_ase_trajectory":2603,"file_format":2604,"arg":2605,"set_positions":2606,"frame_property_keys":2607,"to_singular":2608,"__dict__":2609,"n_md_steps":2610,"frames":2611,"spin_multiplicity":2612,"traj_method":2613,"from_structures":2614,"from_molecules":2615,"pmg_traj":2616,"constant_lattice":2617,"write_xdatcar":2618,"elements":2619,"get_atomic_numbers":2620,"cart_coords":2621,"num_ionic_steps":2622,"file_name":2623,"fmax":2624,"final_atoms_object_file":2625,"final_atoms_object":2626,"xyz":2627,"cell_filter":2628,"filter_kwargs":2629,"jsonable":2630,"traj_dict":2631,"atomic_number":2632,"sanitize":2633,"optimized":2634,"optimizer_obj":2635,"opt_class":2636,"shown":2637,"including":2638,"input_atoms":2639,"set_constraint":2640,"obs":2641,"struct":2642,"first_last_energy":2643,"write_atoms":2644,"26":2645,"fixatoms":2646,"fixcartesian":2647,"extxyz":2648,"write_atoms_constraints":2649,"cons":2650,"prefix":2651,"traj_mp":2652,"149":2653,"individual":2654,"alternately":2655,"initial_images":2656,"neb_calc":2657,"observers":2658,"traj_file_suffix":2659,"suffixes":2660,"traj_file_prefix":2661,"traj_files":2662,"num_sites":2663,"is_force_conv":2664,"image_idx":2665,"site_idx":2666,"elapsed":2667,"image_indices":2668,"climbing_image":2669,"cli":2670,"click":2671,"context_settings":2672,"help_option_names":2673,"add_command":2674,"vasp_test_data":2675,"test_dir":2676,"additional_file":2677,"_potcar_to_potcar_spec":2678,"abinit_script_maker":2679,"abinit_generate_reference":2680,"scripts":2681,"developers":2682,"chgcar":2683,"locpot":2684,"tests":2685,"script":2686,"expects":2687,"refer":2688,"spaces":2689,"punctuation":2690,"pprint":2691,"pformat":2692,"delete_files":2693,"filterwarnings":2694,"echo":2695,"test_data":2696,"already":2697,"refusing":2698,"systemexit":2699,"task_labels":2700,"unique":2701,"original_mapping":2702,"job_name":2703,"orig_job_dir":2704,"folder_name":2705,"testing":2706,"across":2707,"input_dir":2708,"incar":2709,"potcar":2710,"poscar":2711,"spec":2712,"output_dir":2713,"contcar":2714,"outcar":2715,"mapping_str":2716,"original_mapping_str":2717,"run_vasp_kwargs":2718,"incar_settings":2719,"nsw":2720,"ismear":2721,"run_vasp_kwargs_str":2722,"test_function_str":2723,"absolutely":2724,"defect":2725,"increase":2726,"formatted":2727,"below":2728,"particulars":2729,"examples":2730,"test_my_flow":2731,"mock_vasp":2732,"clean_dir":2733,"si_structure":2734,"run_locally":2735,"ref_paths":2736,"fake_run_vasp":2737,"fake_run_vasp_kwargs":2738,"fake":2739,"mymaker":2740,"responses":2741,"create_folders":2742,"ensure_success":2743,"output1":2744,"uuid":2745,"assert":2746,"pytest":2747,"approx":2748,"85037078":2749,"t201":2750,"potcar_filename":2751,"output_filename":2752,"abinit_test_data":2753,"save_abinit_maker":2754,"write_text":2755,"symbols":2756,"script_fname":2757,"create_maker":2758,"exit":2759,"e501":2760,"kppa":2761,"ecut":2762,"structure_file":2763,"make_kwargs":2764,"test_name":2765,"test_data_dir":2766,"_find_sub_list":2767,"reference":2768,"initial_structure":2769,"opened":2770,"nb":2771,"compressed":2772,"compress":2773,"maggma":2774,"stores":2775,"mongolike":2776,"memorystore":2777,"maker_info":2778,"flow_or_job":2779,"make_info":2780,"easily":2781,"compile":2782,"additional_stores":2783,"query":2784,"dir":2785,"is_flag":2786,"_makedir":2787,"force_overwrite":2788,"compress_dir":2789,"abinittaskdocument":2790,"abinit_test_data_dir":2791,"__file__":2792,"parent":2793,"maker_name":2794,"take":2795,"module_path":2796,"maker_dir":2797,"parents":2798,"_fake_dirdata":2799,"dirdata_name":2800,"include_fake_files":2801,"_fake_dirs":2802,"indata_files":2803,"outdata_files":2804,"tmpdata_files":2805,"indata_fake_files":2806,"outdata_fake_files":2807,"tmpdata_fake_files":2808,"src_dirdata":2809,"dest_dirdata":2810,"empty_file":2811,"git":2812,"able":2813,"src_fpath":2814,"dest_fpath":2815,"is_symlink":2816,"symbolic_link":2817,"is_file":2818,"regular_file":2819,"symbolic":2820,"nor":2821,"data_files":2822,"data_fake_files":2823,"index_job":2824,"job_index_dir":2825,"job_index_dir_parts":2826,"job_test":2827,"job_index_dir_for_mapping":2828,"in_den":2829,"in_wfk":2830,"out_fatbands":2831,"out_wfk":2832,"flow_files":2833,"occurrence":2834,"reversed":2835,"index_part":2836,"well":2837,"respective":2838,"test_run_":2839,"mock_abinit":2840,"abinit_test_dir":2841,"sublist":2842,"mainlist":2843,"inspect":2844,"caller_frame":2845,"stack":2846,"caller_filename_full":2847,"script_str":2848,"read":2849,"author_mail":2850,"capture_output":2851,"encoding":2852,"utf":2853,"mail":2854,"email":2855,"returncode":2856,"strip":2857,"warn":2858,"manually":2859,"stacklevel":2860,"created_on":2861,"sll":2862,"inds":2863,"ind":2864,"get_default_strain_states":2865,"tensors":2866,"2nd":2867,"3rd":2868,"builders":2869,"agnostic":2870,"magneticorderingsbuilder":2871,"builder":2872,"magnetic_orderings":2873,"structure_match_stol":2874,"structure_match_ltol":2875,"structure_match_angle_tol":2876,"ensure_indexes":2877,"structure_matcher":2878,"structurematcher":2879,"_group_orderings":2880,"orderings":2881,"magneticorderingsdocument":2882,"iterator":2883,"analyze":2884,"magnetization":2885,"particular":2886,"especially":2887,"analyzed":2888,"equivalence":2889,"angle":2890,"targets":2891,"ensure_index":2892,"formula_pretty":2893,"get_items":2894,"process_item":2895,"update_targets":2896,"grouping":2897,"fast":2898,"grouped":2899,"yields":2900,"debug":2901,"adding":2902,"ensuring":2903,"num_formulas":2904,"distinct":2905,"groupby":2906,"n_formula":2907,"decoded_docs":2908,"grouped_tasks":2909,"n_groups":2910,"n_group":2911,"transformation":2912,"from_tasks":2913,"model_dump":2914,"allow_bson":2915,"updating":2916,"ground_state_uuid":2917,"ltol":2918,"stol":2919,"angle_tol":2920,"distinguishing":2921,"polymorphs":2922,"sm":2923,"parent_structure":2924,"group_parent_structure":2925,"rigorous":2926,"exclude_files":2927,"fnmatch":2928,"gzip_files":2929,"destination":2930,"usernamehost":2931,"supports":2932,"find_and_filter_files":2933,"to_file":2934,"with_suffix":2935,"home":2936,"deleted":2937,"old_name":2938,"new_name":2939,"matches":2940,"old_filename":2941,"new_filename":2942,"gunzipped":2943,"base_name":2944,"expand":2945,"globbed_files":2946,