{"acfdt_calculations":0,"md":1,"sections":2,"acfdt":3,"rpa":4,"calculations":5,"general":6,"recipe":7,"calculate":8,"total":9,"energies":10,"categories":11,"many":12,"body":13,"perturbation":14,"theory":15,"howto":16,"low":17,"scaling":18,"gw":19,"adiabatic":20,"connection":21,"fluctuation":22,"dissipation":23,"theorem":24,"can":25,"used":26,"derive":27,"random":28,"phase":29,"approximation":30,"ground":31,"state":32,"energy":33,"mathrm":34,"sum":35,"correlation":36,"hartree":37,"fock":38,"hf":39,"exx":40,"evaluated":41,"non":42,"self":43,"consistently":44,"using":45,"kohn":46,"sham":47,"orbitals":48,"computed":49,"within":50,"density":51,"functional":52,"dft":53,"note":54,"here":55,"includes":56,"also":57,"kinetic":58,"well":59,"ewald":60,"ions":61,"whereas":62,"often":63,"literature":64,"refers":65,"only":66,"exact":67,"exchange":68,"algo":69,"set":70,"incar":71,"file":72,"vasp":73,"calculates":74,"end":75,"first":76,"independent":77,"particle":78,"response":79,"function":80,"unoccupied":81,"states":82,"given":83,"wavecar":84,"determines":85,"plasmon":86,"equation":87,"frac":88,"pi":89,"int":90,"infty":91,"tr":92,"ln":93,"chi":94,"rm":95,"omega":96,"more":97,"information":98,"about":99,"behind":100,"found":101,"four":102,"step":103,"procedure":104,"all":105,"one":106,"approach":107,"available":108,"done":109,"single":110,"both":111,"procedures":112,"comprise":113,"consistent":114,"calculation":115,"diagonalizing":116,"ks":117,"hamiltonian":118,"itself":119,"while":120,"very":121,"convenient":122,"several":123,"caveats":124,"discussed":125,"below":126,"standard":127,"setting":128,"nbands":129,"run":130,"occupied":131,"usual":132,"few":133,"calculated":134,"instance":135,"ediff":136,"1e":137,"required":138,"convergence":139,"ismear":140,"sigma":141,"05":142,"warning":143,"eigenenergies":144,"influences":145,"tip":146,"use":147,"perdew":148,"burke":149,"ernzerhof":150,"pbe":151,"pseudopotentials":152,"small":153,"avoid":154,"your":155,"favorite":156,"setup":157,"we":158,"recommend":159,"attaining":160,"high":161,"precision":162,"tag":163,"smearing":164,"width":165,"higher":166,"order":167,"methfessel":168,"paxton":169,"see":170,"because":171,"lead":172,"negative":173,"electron":174,"occupancies":175,"which":176,"result":177,"unphysical":178,"suggest":179,"input":180,"other":181,"choices":182,"local":183,"lda":184,"hybrids":185,"possible":186,"hybrid":187,"functionals":188,"carefully":189,"considering":190,"mentioned":191,"ref":192,"specifically":193,"dielectric":194,"matrix":195,"yields":196,"too":197,"weak":198,"screening":199,"potentially":200,"deteriorates":201,"results":202,"compute":203,"eigenval":204,"nelm":205,"lwave":206,"false":207,"written":208,"lhfcalc":209,"true":210,"aexx":211,"aldac":212,"avoids":213,"accidental":214,"update":215,"automatically":216,"sets":217,"insulators":218,"semiconductors":219,"sizable":220,"gap":221,"faster":222,"point":223,"obtained":224,"hfrcut":225,"although":226,"slows":227,"metals":228,"sufficient":229,"number":230,"outcar":231,"search":232,"maximum":233,"plane":234,"waves":235,"again":236,"following":237,"determine":238,"diagonalization":239,"must":240,"same":241,"might":242,"times":243,"vasp_gam":244,"loptics":245,"gamma":246,"version":247,"twice":248,"since":249,"down":250,"nomega":251,"12":252,"default":253,"imaginary":254,"frequency":255,"time":256,"grid":257,"points":258,"usually":259,"24":260,"large":261,"suffice":262,"10":263,"suffices":264,"important":265,"read":266,"perform":267,"iterating":268,"until":269,"reached":270,"diagonalize":271,"basis":272,"spanned":273,"finally":274,"proceed":275,"particularly":276,"rpar":277,"gwr":278,"algorithms":279,"example":280,"optional":281,"lpead":282,"head":283,"expression":284,"after":285,"discretization":286,"pead":287,"method":288,"supported":289,"furthermore":290,"should":291,"strictly":292,"starting":293,"from":294,"converged":295,"support":296,"top":297,"leq":298,"gradient":299,"corrected":300,"type":301,"without":302,"range":303,"separation":304,"however":305,"separated":306,"including":307,"hse":308,"lmodelhf":309,"yield":310,"erroneous":311,"even":312,"crash":313,"please":314,"compare":315,"against":316,"mean":317,"field":318,"exactly":319,"differ":320,"fall":321,"back":322,"explained":323,"above":324,"select":325,"new":326,"proceeds":327,"reading":328,"directory":329,"present":330,"option":331,"reduce":332,"size":333,"selected":334,"component":335,"lmaxfockae":336,"nmaxfockae":337,"changes":338,"slightly":339,"hence":340,"you":341,"need":342,"obtain":343,"output":344,"different":345,"cutoffs":346,"linear":347,"regression":348,"extrapolate":349,"infinite":350,"cutoff":351,"limit":352,"section":353,"successful":354,"writes":355,"lines":356,"smooth":357,"contr":358,"mp2":359,"316":360,"767":361,"17":362,"5265976349":363,"26":364,"2640927215":365,"301":366,"683":367,"3846505665":368,"0990489039":369,"287":370,"317":371,"2429031341":372,"25":373,"9344769084":374,"273":375,"635":376,"0686574017":377,"7325162480":378,"260":379,"605":380,"16":381,"8914915810":382,"5277026697":383,"248":384,"195":385,"7202601717":386,"3302982602":387,"236":388,"376":389,"5559849344":390,"1415392478":391,"225":392,"120":393,"3635400223":394,"9210737434":395,"value":396,"19":397,"2585393615":398,"28":399,"2627347266":400,"third":401,"fourth":402,"columns":403,"correspond":404,"specific":405,"direct":406,"second":407,"møller":408,"plesset":409,"term":410,"corresponding":411,"line":412,"algorithm":413,"virtually":414,"tags":415,"apply":416,"implemented":417,"needs":418,"replaced":419,"either":420,"acfdtr":421,"polarizability":422,"green":423,"functions":424,"tau":425,"axis":426,"contraction":427,"formula":428,"_m":429,"subsequently":430,"compressed":431,"fourier":432,"transformation":433,"axes":434,"_n":435,"nm":436,"remaining":437,"evaluation":438,"described":439,"crucial":440,"accuracy":441,"depends":442,"two":443,"factors":444,"similar":445,"recommended":446,"have":447,"optimized":448,"interval":449,"transition":450,"minimum":451,"omegamin":452,"omegatl":453,"smaller":454,"larger":455,"than":456,"bandgap":457,"previous":458,"values":459,"gg":460,"checked":461,"consistency":462,"inspecting":463,"errors":464,"looking":465,"nu_":466,"1561030e":467,"00":468,"err":469,"6327933e":470,"finished":471,"steps":472,"error":473,"3369591e":474,"06":475,"every":476,"shown":477,"corresponds":478,"integration":479,"singles":480,"contribution":481,"selecting":482,"computes":483,"free":484,"fhf":485,"11173505":486,"ev":487,"corr":488,"toten":489,"36":490,"96463791":491,"e_corr":492,"extrapolated":493,"37":494,"70506951":495,"contains":496,"largest":497,"encutgw":498,"denotes":499,"determined":500,"electronic":501,"most":502,"systems":503,"resulting":504,"good":505,"agreement":506,"reference":507,"compatibility":508,"lfockstd":509,"centre":510,"terms":511,"allows":512,"determination":513,"so":514,"called":515,"represented":516,"diagrams":517,"textbooks":518,"assumed":519,"zero":520,"ren":521,"et":522,"al":523,"pointed":524,"out":525,"vanishing":526,"lsingles":527,"case":528,"additional":529,"shot":530,"change":531,"23182672":532,"renormalized":533,"23310555":534,"proposed":535,"klimeš":536,"cases":537,"exceedingly":538,"close":539,"each":540,"understood":541,"way":542,"how":543,"propagator":544,"forces":545,"noise":546,"optionally":547,"adding":548,"lrpaforce":549,"performed":550,"routine":551,"block":552,"data":553,"position":554,"force":555,"angst":556,"17542":557,"22348":558,"292069":559,"581315":560,"12850":561,"31044":562,"304683":563,"605527":564,"drift":565,"012614":566,"024212":567,"suggested":568,"updated":569,"poscar":570,"coordinates":571,"00958461":572,"13485779":573,"04179056":574,"00283088":575,"25787833":576,"22191754":577,"04337198":578,"00431513":579,"positions":580,"contcar":581,"nsw":582,"multiplying":583,"parameter":584,"damp":585,"_newton":586,"inverse":587,"hessian":588,"during":589,"resultant":590,"vector":591,"current":592,"currently":593,"defaults":594,"user":595,"want":596,"damping":597,"instabilities":598,"observed":599,"copied":600,"recover":601,"groundstate":602,"structure":603,"alternatively":604,"relaxations":605,"ibrion":606,"improve":607,"generally":608,"quite":609,"noisy":610,"ionic":611,"particular":612,"precfock":613,"fast":614,"related":615,"affecting":616,"useful":617,"separately":618,"reported":619,"shows":620,"odd":621,"jumps":622,"volume":623,"strongly":624,"consider":625,"options":626,"sensible":627,"normal":628,"typically":629,"doubling":630,"execution":631,"memory":632,"requirement":633,"implicitly":634,"makes":635,"less":636,"technically":637,"accurate":638,"part":639,"missing":640,"overall":641,"extensive":642,"testing":643,"relevant":644,"parameters":645,"bottleneck":646,"parallelization":647,"some":648,"issues":649,"tests":650,"known":651,"cubic":652,"space":653,"requires":654,"considerably":655,"quartic":656,"implementations":657,"bf":658,"stored":659,"real":660,"overhead":661,"exploits":662,"transformations":663,"fft":664,"storage":665,"matrices":666,"hand":667,"where":668,"code":669,"redundant":670,"distributed":671,"individual":672,"distribution":673,"ntaupar":674,"nomegapar":675,"splits":676,"groups":677,"purpose":678,"divisors":679,"reasonable":680,"provided":681,"maxmem":682,"correctly":683,"instead":684,"estimated":685,"memavailable":686,"entry":687,"linux":688,"kernel":689,"proc":690,"meminfo":691,"mostly":692,"mpi":693,"share":694,"rough":695,"estimate":696,"bytes":697,"ngx":698,"ngy":699,"ngz":700,"ngx_s":701,"ngy_s":702,"ngz_s":703,"ncpu":704,"ranks":705,"job":706,"_s":707,"supercell":708,"grids":709,"per":710,"node":711,"finish":712,"successfully":713,"approximate":714,"advance":715,"printed":716,"screen":717,"follows":718,"min":719,"rank":720,"1234":721,"mb":722,"9872":723,"converges":724,"fastest":725,"respect":726,"eq":727,"long":728,"wavelength":729,"contributions":730,"considered":731,"evaluate":732,"correction":733,"partial":734,"has":735,"added":736,"hfc":737,"any":738,"neglect":739,"simply":740,"remove":741,"waveder":742,"files":743,"beginning":744,"include":745,"center":746,"enabling":747,"incorporating":748,"significantly":749,"enhances":750,"least":751,"magnitude":752,"compared":753,"finite":754,"difference":755,"methods":756,"therefore":757,"activate":758,"earlier":759,"versions":760,"managed":761,"reciprocal":762,"lattice":763,"vectors":764,"reads":765,"mathbf":766,"bz":767,"left":768,"tilde":769,"right":770,"over":771,"truncated":772,"max":773,"hbar":774,"_e":775,"encut":776,"experience":777,"taught":778,"us":779,"systematic":780,"increase":781,"repeat":782,"aware":783,"when":784,"increased":785,"impossible":786,"converge":787,"absolute":788,"rather":789,"concentrate":790,"relative":791,"differences":792,"between":793,"solids":794,"solid":795,"constituent":796,"atoms":797,"slowly":798,"extrapolates":799,"coulomb":800,"smoothly":801,"encutgwsoft":802,"simple":803,"cosine":804,"like":805,"window":806,"hann":807,"extrapolation":808,"lsck":809,"squeezed":810,"do":811,"integral":812,"means":813,"highly":814,"minimax":815,"flag":816,"transitions":817,"band":818,"lowest":819,"highest":820,"orbital":821,"choice":822,"mu":823,"atom":824,"already":825,"up":826,"sometimes":827,"necessary":828,"unit":829,"cells":830,"adhere":831,"outlines":832,"three":833,"require":834,"generated":835,"slow":836,"test":837,"ideally":838,"another":839,"issue":840,"curves":841,"best":842,"strategy":843,"enmax":844,"potcar":845,"symmetry":846,"broken":847,"requiring":848,"spline":849,"interpolation":850,"mind":851,"esf":852,"_splines":853,"upon":854,"rewriting":855,"_c":856,"factor":857,"stores":858,"coarse":859,"defined":860,"kpoints":861,"performs":862,"tricubic":863,"towards":864,"finer":865,"iteratively":866,"iteration":867,"_conv":868,"_ninter":869,"considers":870,"reports":871,"format":872,"interp":873,"166":874,"667":875,"133":876,"333":877,"9738715106":878,"7255874374":879,"13":880,"4968000908":881,"158":882,"730":883,"126":884,"984":885,"8840657072":886,"6294580403":887,"4017404001":888,"151":889,"172":890,"937":891,"7775593388":892,"5151822998":893,"3005326847":894,"143":895,"973":896,"115":897,"178":898,"6604147404":899,"3892142669":900,"1868498210":901,"137":902,"117":903,"109":904,"694":905,"5530911576":906,"2733151174":907,"0861120393":908,"130":909,"588":910,"104":911,"470":912,"4659186304":913,"1786165194":914,"9778587892":915,"124":916,"369":917,"99":918,"495":919,"3690601643":920,"0725742983":921,"8709666989":922,"118":923,"447":924,"94":925,"758":926,"2461267475":927,"18":928,"9372318755":929,"7590723870":930,"14":931,"0340307585":932,"20":933,"8751715586":934,"5828037654":935,"last":936,"column":937,"delete":938,"incompatible":939,"lim":940,"cdot":941,"explicitly":942,"wave":943,"assumes":944,"add":945,"working":946,"ill":947,"metallic":948,"contrast":949,"nevertheless":950,"still":951,"efficiency":952,"reasons":953,"references":954,"nomegar":955,"switches":956,"store":957,"wings":958,"controls":959,"lfinite":960,"_temperature":961,"matsubara":962,"temperature":963,"formalism":964,"uses":965,"accelerate":966,"addgrid":967,"articles":968,"projector":969,"augmented":970,"description":971,"whether":972,"augmentation":973,"charges":974,"fine":975,"ngxf":976,"ngyf":977,"ngzf":978,"whenever":979,"involving":980,"charge":981,"transformed":982,"helps":983,"caveat":984,"potential":985,"conventional":986,"leads":987,"oscillations":988,"cut":989,"alternate":990,"positive":991,"ultra":992,"regions":993,"terminus":994,"techniques":995,"termination":996,"wiggles":997,"somewhat":998,"oversimplified":999,"presentation":1000,"fairly":1001,"straightforward":1002,"rigorous":1003,"1d":1004,"upshot":1005,"interpolated":1006,"components":1007,"smoothing":1008,"essence":1009,"densities":1010,"problematic":1011,"performing":1012,"careful":1013,"works":1014,"desired":1015,"prec":1016,"enaug":1017,"examples":1018,"lrhfcalc":1019,"specifies":1020,"fraction":1021,"prior":1022,"aldax":1023,"constrained":1024,"equal":1025,"constraint":1026,"lifted":1027,"off":1028,"aggac":1029,"amggac":1030,"thus":1031,"runs":1032,"full":1033,"aggax":1034,"amggax":1035,"hfscreen":1036,"list":1037,"neq":1038,"multiplies":1039,"gga":1040,"listed":1041,"except":1042,"am05":1043,"libxc":1044,"libxc1":1045,"details":1046,"minimization":1047,"bethe":1048,"salpeter":1049,"equations":1050,"veryfast":1051,"conjugate":1052,"damped":1053,"subrot":1054,"none":1055,"nothing":1056,"g0w0":1057,"gw0":1058,"scgw0":1059,"scgw":1060,"g0w0r":1061,"gw0r":1062,"scgw0r":1063,"scgwr":1064,"bse":1065,"tdhf":1066,"specify":1067,"selects":1068,"ialgo":1069,"38":1070,"blocked":1071,"davidson":1072,"scheme":1073,"48":1074,"rmm":1075,"diis":1076,"been":1077,"robustness":1078,"old":1079,"combined":1080,"ldiag":1081,"conserve":1082,"initial":1083,"ov":1084,"vo":1085,"robust":1086,"mixture":1087,"sweep":1088,"fo":1089,"simultaneous":1090,"58":1091,"synonymous":1092,"improved":1093,"isearch":1094,"velocity":1095,"friction":1096,"53":1097,"90":1098,"subspace":1099,"rotation":1100,"sub":1101,"recalculate":1102,"postprocessing":1103,"under":1104,"documentation":1105,"spelled":1106,"letter":1107,"applied":1108,"newer":1109,"lmaxmix":1110,"appropriately":1111,"electrons":1112,"tddft":1113,"internal":1114,"cassida":1115,"timeev":1116,"delta":1117,"pulse":1118,"timepropagation":1119,"renamed":1120,"qpgw":1121,"qpgw0":1122,"evgw":1123,"evgw0":1124,"partially":1125,"wavefunctions":1126,"maintained":1127,"iterations":1128,"qp":1129,"diagonal":1130,"selfenergy":1131,"synonym":1132,"acfdtrk":1133,"combination":1134,"lmp2lt":1135,"tutorial":1136,"dyson":1137,"screened":1138,"remains":1139,"unchanged":1140,"cycles":1141,"interacting":1142,"system":1143,"ignored":1144,"corrections":1145,"nelmgw":1146,"replaces":1147,"crpa":1148,"alculations":1149,"evgw0r":1150,"analog":1151,"loops":1152,"kept":1153,"level":1154,"alpha_vdw":1155,"van":1156,"der":1157,"waals":1158,"alpha":1159,"_vdw":1160,"94950":1161,"ivdw":1162,"_nl":1163,"28248":1164,"vdw":1165,"df3":1166,"opt1":1167,"opt2":1168,"nonlocal":1169,"param1":1170,"param2":1171,"df":1172,"meta":1173,"whole":1174,"amin":1175,"mixing":1176,"amix":1177,"_mag":1178,"minimal":1179,"kerker":1180,"broyden":1181,"pulay":1182,"imix":1183,"inimix":1184,"ag":1185,"bmix":1186,"maxmix":1187,"mixpre":1188,"wc":1189,"ispin":1190,"pps":1191,"paw":1192,"datasets":1193,"eigenvalue":1194,"spectrum":1195,"easy":1196,"optimization":1197,"eigenvalues":1198,"optimal":1199,"γmean":1200,"easily":1201,"amixoptimal":1202,"amixcurrent":1203,"keep":1204,"fixed":1205,"decrease":1206,"much":1207,"02":1208,"amix_mag":1209,"magnetism":1210,"magnetization":1211,"spinpolarized":1212,"settings":1213,"spin":1214,"enhancement":1215,"combinations":1216,"tried":1217,"turns":1218,"slabs":1219,"magnetic":1220,"insulating":1221,"molecules":1222,"clusters":1223,"model":1224,"try":1225,"0001":1226,"almost":1227,"bmix_mag":1228,"polarized":1229,"andersen_prob":1230,"molecular":1231,"dynamics":1232,"thermostats":1233,"andersen":1234,"_prob":1235,"collision":1236,"probability":1237,"anderson":1238,"thermostat":1239,"compiled":1240,"dtbdyn":1241,"thermally":1242,"coupled":1243,"fictitious":1244,"heat":1245,"bath":1246,"coupling":1247,"stochastic":1248,"impulsive":1249,"act":1250,"occasionally":1251,"randomly":1252,"particles":1253,"average":1254,"collisions":1255,"quantity":1256,"controlled":1257,"report":1258,"generates":1259,"microcanonical":1260,"nve":1261,"ensemble":1262,"mdalgo":1263,"antires":1264,"tamm":1265,"dancoff":1266,"tda":1267,"roughly":1268,"cost":1269,"beyond":1270,"frequencies":1271,"outlined":1272,"computational":1273,"requirements":1274,"andersen_thermostat":1275,"momentum":1276,"lucky":1277,"instantaneously":1278,"chosen":1279,"boltzmann":1280,"occurs":1281,"nu":1282,"exponent":1283,"scaled":1284,"implementation":1285,"chapter":1286,"nosé":1287,"hoover":1288,"langevin":1289,"csvr":1290,"chain":1291,"isif":1292,"angular":1293,"spherical":1294,"harmonics":1295,"name":1296,"ylm":1297,"sqrt":1298,"py":1299,"pz":1300,"px":1301,"dxy":1302,"15":1303,"xy":1304,"dyz":1305,"yz":1306,"dz2":1307,"3z":1308,"dxz":1309,"zx":1310,"dx2":1311,"y2":1312,"fy":1313,"3x2":1314,"35":1315,"3x":1316,"fxyz":1317,"105":1318,"xyz":1319,"fyz2":1320,"21":1321,"5z":1322,"fz3":1323,"3r":1324,"fxz2":1325,"fz":1326,"x2":1327,"fx":1328,"3y2":1329,"3y":1330,"sp":1331,"_x":1332,"sp2":1333,"_y":1334,"sp3":1335,"_z":1336,"sp3d":1337,"sp3d2":1338,"at_and_mol_further":1339,"mol":1340,"further":1341,"overview":1342,"dimer":1343,"co":1344,"vibration":1345,"dos":1346,"h2o":1347,"things":1348,"tutorials":1349,"does":1350,"decreases":1351,"001":1352,"_atom":1353,"why":1354,"copy":1355,"running":1356,"_dimer":1357,"play":1358,"potim":1359,"what":1360,"reason":1361,"_vibration":1362,"behaviour":1363,"changed":1364,"happens":1365,"molecule":1366,"vibrational":1367,"relaxation":1368,"find":1369,"modes":1370,"available_potentials":1371,"potentials":1372,"redirect":1373,"available_pseudopotentials":1374,"pseudopotential":1375,"potpaw":1376,"64":1377,"latest":1378,"elements":1379,"periodic":1380,"table":1381,"portal":1382,"based":1383,"created":1384,"recipes":1385,"cite":1386,"instructions":1387,"correct":1388,"prepare":1389,"guide":1390,"recommendations":1391,"checks":1392,"decide":1393,"flavor":1394,"choosing":1395,"tables":1396,"split":1397,"intended":1398,"treating":1399,"appropriate":1400,"far":1401,"fermi":1402,"_gw":1403,"suffix":1404,"computing":1405,"optical":1406,"properties":1407,"valence":1408,"configuration":1409,"bold":1410,"highlighted":1411,"entries":1412,"depending":1413,"preferable":1414,"choose":1415,"refer":1416,"explanation":1417,"variants":1418,"understand":1419,"54":1420,"li":1421,"he":1422,"_new":1423,"balanced":1424,"_h":1425,"kcal":1426,"rn":1427,"_d":1428,"_sv":1429,"mass":1430,"220":1431,"ba":1432,"cs":1433,"cu":1434,"ghost":1435,"dy":1436,"er":1437,"eu":1438,"gd":1439,"ho":1440,"nd":1441,"pm":1442,"pr":1443,"sm":1444,"tb":1445,"tm":1446,"yb":1447,"lanthanides":1448,"newly":1449,"mainly":1450,"involve":1451,"enamx":1452,"250":1453,"33":1454,"42":1455,"66":1456,"75":1457,"h1":1458,"_ae":1459,"1000":1460,"700":1461,"200":1462,"477":1463,"779":1464,"140":1465,"498":1466,"387":1467,"9999":1468,"247":1469,"951":1470,"308":1471,"45":1472,"318":1473,"762":1474,"269":1475,"251":1476,"400":1477,"742":1478,"464":1479,"704":1480,"755":1481,"833":1482,"279":1483,"424":1484,"765":1485,"442":1486,"282":1487,"604":1488,"772":1489,"351":1490,"289":1491,"647":1492,"ne":1493,"343":1494,"403":1495,"na":1496,"101":1497,"956":1498,"_pv":1499,"259":1500,"494":1501,"644":1502,"874":1503,"mg":1504,"999":1505,"538":1506,"473":1507,"240":1508,"957":1509,"si":1510,"245":1511,"255":1512,"155":1513,"390":1514,"903":1515,"258":1516,"602":1517,"402":1518,"84":1519,"cl":1520,"262":1521,"409":1522,"272":1523,"ar":1524,"266":1525,"116":1526,"596":1527,"ca":1528,"119":1529,"552":1530,"727":1531,"sc":1532,"006":1533,"11":1534,"222":1535,"ti":1536,"52":1537,"435":1538,"274":1539,"719":1540,"192":1541,"706":1542,"263":1543,"722":1544,"cr":1545,"227":1546,"202":1547,"265":1548,"753":1549,"395":1550,"443":1551,"mn":1552,"944":1553,"112":1554,"fe":1555,"267":1556,"969":1557,"293":1558,"303":1559,"513":1560,"268":1561,"056":1562,"270":1563,"871":1564,"ni":1565,"618":1566,"367":1567,"726":1568,"295":1569,"521":1570,"368":1571,"406":1572,"zn":1573,"276":1574,"847":1575,"ga":1576,"134":1577,"829":1578,"404":1579,"723":1580,"ge":1581,"173":1582,"310":1583,"448":1584,"410":1585,"208":1586,"87":1587,"288":1588,"se":1589,"211":1590,"br":1591,"216":1592,"224":1593,"kr":1594,"185":1595,"392":1596,"rb":1597,"122":1598,"215":1599,"sr":1600,"226":1601,"327":1602,"554":1603,"zr":1604,"230":1605,"037":1606,"nb":1607,"207":1608,"304":1609,"mo":1610,"535":1611,"514":1612,"tc":1613,"228":1614,"636":1615,"345":1616,"479":1617,"ru":1618,"213":1619,"221":1620,"239":1621,"907":1622,"687":1623,"rh":1624,"926":1625,"321":1626,"pd":1627,"832":1628,"249":1629,"752":1630,"297":1631,"68":1632,"cd":1633,"96":1634,"062":1635,"196":1636,"sn":1637,"103":1638,"241":1639,"107":1640,"sb":1641,"te":1642,"175":1643,"144":1644,"712":1645,"xe":1646,"153":1647,"021":1648,"186":1649,"981":1650,"la":1651,"219":1652,"044":1653,"136":1654,"594":1655,"ce":1656,"088":1657,"299":1658,"927":1659,"431":1660,"237":1661,"414":1662,"ta":1663,"223":1664,"759":1665,"re":1666,"os":1667,"023":1668,"ir":1669,"210":1670,"837":1671,"pt":1672,"294":1673,"au":1674,"229":1675,"869":1676,"hg":1677,"233":1678,"142":1679,"tl":1680,"pb":1681,"98":1682,"039":1683,"817":1684,"bi":1685,"071":1686,"242":1687,"856":1688,"po":1689,"159":1690,"801":1691,"264":1692,"606":1693,"161":1694,"481":1695,"461":1696,"fr":1697,"214":1698,"489":1699,"ra":1700,"ac":1701,"170":1702,"048":1703,"th":1704,"389":1705,"169":1706,"575":1707,"pa":1708,"252":1709,"31":1710,"193":1711,"642":1712,"603":1713,"209":1714,"218":1715,"np":1716,"254":1717,"349":1718,"932":1719,"pu":1720,"436":1721,"493":1722,"am":1723,"953":1724,"cm":1725,"027":1726,"478":1727,"896":1728,"2135":1729,"499":1730,"034":1731,"01":1732,"543":1733,"768":1734,"614":1735,"741":1736,"689":1737,"911":1738,"582":1739,"692":1740,"519":1741,"853":1742,"626":1743,"968":1744,"561":1745,"645":1746,"929":1747,"04":1748,"472":1749,"408":1750,"731":1751,"559":1752,"622":1753,"154":1754,"763":1755,"335":1756,"61":1757,"673":1758,"08":1759,"681":1760,"471":1761,"864":1762,"187":1763,"882":1764,"238":1765,"558":1766,"271":1767,"042":1768,"362":1769,"532":1770,"986":1771,"446":1772,"648":1773,"678":1774,"691":1775,"601":1776,"807":1777,"425":1778,"702":1779,"651":1780,"555":1781,"285":1782,"331":1783,"121":1784,"353":1785,"898":1786,"608":1787,"235":1788,"584":1789,"676":1790,"523":1791,"703":1792,"049":1793,"855":1794,"996":1795,"925":1796,"844":1797,"865":1798,"336":1799,"95":1800,"934":1801,"083":1802,"069":1803,"174":1804,"982":1805,"181":1806,"292":1807,"_3":1808,"176":1809,"506":1810,"337":1811,"338":1812,"34":1813,"182":1814,"619":1815,"016":1816,"340":1817,"358":1818,"959":1819,"341":1820,"177":1821,"087":1822,"405":1823,"382":1824,"344":1825,"705":1826,"_2":1827,"328":1828,"129":1829,"057":1830,"212":1831,"342":1832,"859":1833,"332":1834,"407":1835,"613":1836,"043":1837,"547":1838,"713":1839,"886":1840,"845":1841,"415":1842,"91":1843,"22":1844,"346":1845,"429":1846,"583":1847,"23":1848,"206":1849,"149":1850,"419":1851,"812":1852,"312":1853,"578":1854,"188":1855,"359":1856,"lu":1857,"695":1858,"992":1859,"334":1860,"444":1861,"022":1862,"283":1863,"607":1864,"943":1865,"204":1866,"053":1867,"97":1868,"835":1869,"839":1870,"707":1871,"565":1872,"43":1873,"497":1874,"306":1875,"363":1876,"466":1877,"502":1878,"83":1879,"875":1880,"257":1881,"cf":1882,"300":1883,"806":1884,"433":1885,"253":1886,"417":1887,"536":1888,"413":1889,"894":1890,"668":1891,"420":1892,"452":1893,"165":1894,"315":1895,"114":1896,"366":1897,"487":1898,"919":1899,"822":1900,"952":1901,"372":1902,"86":1903,"671":1904,"430":1905,"099":1906,"411":1907,"007":1908,"546":1909,"548":1910,"290":1911,"518":1912,"281":1913,"378":1914,"598":1915,"383":1916,"093":1917,"384":1918,"278":1919,"537":1920,"488":1921,"323":1922,"357":1923,"352":1924,"485":1925,"032":1926,"991":1927,"401":1928,"745":1929,"375":1930,"469":1931,"475":1932,"88":1933,"563":1934,"92":1935,"339":1936,"437":1937,"857":1938,"65":1939,"350":1940,"798":1941,"347":1942,"881":1943,"989":1944,"355":1945,"354":1946,"361":1947,"653":1948,"086":1949,"147":1950,"686":1951,"381":1952,"757":1953,"179":1954,"528":1955,"581":1956,"198":1957,"012":1958,"484":1959,"313":1960,"728":1961,"649":1962,"85":1963,"319":1964,"628":1965,"708":1966,"657":1967,"311":1968,"949":1969,"793":1970,"138":1971,"146":1972,"261":1973,"89":1974,"666":1975,"326":1976,"597":1977,"397":1978,"329":1979,"841":1980,"615":1981,"78":1982,"699":1983,"454":1984,"373":1985,"983":1986,"843":1987,"902":1988,"633":1989,"797":1990,"664":1991,"698":1992,"480":1993,"848":1994,"432":1995,"275":1996,"893":1997,"599":1998,"998":1999,"961":2000,"774":2001,"627":2002,"491":2003,"467":2004,"191":2005,"665":2006,"434":2007,"232":2008,"197":2009,"364":2010,"872":2011,"914":2012,"348":2013,"106":2014,"356":2015,"045":2016,"624":2017,"771":2018,"066":2019,"778":2020,"674":2021,"476":2022,"688":2023,"625":2024,"309":2025,"286":2026,"008":2027,"132":2028,"773":2029,"716":2030,"669":2031,"658":2032,"028":2033,"809":2034,"876":2035,"529":2036,"variety":2037,"original":2038,"release":2039,"2015":2040,"09":2041,"identical":2042,"before":2043,"title":2044,"string":2045,"reside":2046,"hash":2047,"key":2048,"152":2049,"941":2050,"189":2051,"515":2052,"256":2053,"824":2054,"168":2055,"298":2056,"296":2057,"391":2058,"964":2059,"early":2060,"snapshot":2061,"2012":2062,"_soft":2063,"_pbe":2064,"possess":2065,"projectors":2066,"advantage":2067,"entirely":2068,"clear":2069,"precise":2070,"correlated":2071,"wavefunction":2072,"practice":2073,"improvements":2074,"seem":2075,"modest":2076,"justify":2077,"greater":2078,"load":2079,"457":2080,"284":2081,"878":2082,"322":2083,"41":2084,"483":2085,"360":2086,"496":2087,"422":2088,"503":2089,"451":2090,"654":2091,"574":2092,"320":2093,"997":2094,"891":2095,"396":2096,"576":2097,"650":2098,"065":2099,"07":2100,"77":2101,"246":2102,"423":2103,"002":2104,"418":2105,"792":2106,"905":2107,"091":2108,"766":2109,"2010":2110,"pw91":2111,"2006":2112,"respectively":2113,"outdated":2114,"feature":2115,"undesired":2116,"metagga":2117,"458":2118,"_old":2119,"_f":2120,"840":2121,"525":2122,"_local":2123,"1047":2124,"2744":2125,"566":2126,"370":2127,"394":2128,"135":2129,"_nopc":2130,"280":2131,"150":2132,"141":2133,"593":2134,"385":2135,"_ldapu":2136,"725":2137,"781":2138,"_nc2":2139,"077":2140,"549":2141,"836":2142,"145":2143,"_rel":2144,"_dr":2145,"041":2146,"184":2147,"815":2148,"81":2149,"380":2150,"102":2151,"811":2152,"804":2153,"696":2154,"616":2155,"887":2156,"995":2157,"921":2158,"749":2159,"733":2160,"718":2161,"557":2162,"655":2163,"199":2164,"325":2165,"993":2166,"449":2167,"918":2168,"842":2169,"639":2170,"081":2171,"553":2172,"014":2173,"693":2174,"183":2175,"955":2176,"729":2177,"776":2178,"659":2179,"194":2180,"516":2181,"291":2182,"072":2183,"277":2184,"938":2185,"004":2186,"923":2187,"913":2188,"492":2189,"883":2190,"377":2191,"_sv2":2192,"544":2193,"_nr":2194,"684":2195,"901":2196,"runelements":2197,"_vs":2198,"1421":2199,"825":2200,"_pbe0":2201,"393":2202,"586":2203,"388":2204,"_new2":2205,"runelements2":2206,"863":2207,"675":2208,"082":2209,"365":2210,"533":2211,"945":2212,"_pvf":2213,"697":2214,"_d3":2215,"534":2216,"641":2217,"632":2218,"47":2219,"098":2220,"_vnew":2221,"846":2222,"979":2223,"908":2224,"685":2225,"009":2226,"_zora":2227,"948":2228,"063":2229,"_rel2":2230,"851":2231,"783":2232,"_nc":2233,"_gw2":2234,"509":2235,"1261":2236,"234":2237,"_parsv":2238,"933":2239,"205":2240,"721":2241,"971":2242,"556":2243,"462":2244,"1708":2245,"987":2246,"963":2247,"nrel":2248,"579":2249,"_d2":2250,"307":2251,"802":2252,"217":2253,"646":2254,"096":2255,"571":2256,"_ref":2257,"572":2258,"ultrasoft":2259,"2002":2260,"pseudo":2261,"dated":2262,"_200ev":2263,"76":2264,"427":2265,"805":2266,"148":2267,"526":2268,"567":2269,"061":2270,"946":2271,"508":2272,"49":2273,"003":2274,"787":2275,"808":2276,"70":2277,"743":2278,"587":2279,"542":2280,"849":2281,"139":2282,"656":2283,"167":2284,"754":2285,"63":2286,"936":2287,"994":2288,"786":2289,"203":2290,"46":2291,"180":2292,"885":2293,"592":2294,"866":2295,"672":2296,"201":2297,"977":2298,"744":2299,"097":2300,"769":2301,"612":2302,"243":2303,"51":2304,"545":2305,"795":2306,"302":2307,"928":2308,"486":2309,"904":2310,"611":2311,"67":2312,"59":2313,"438":2314,"569":2315,"873":2316,"27":2317,"44":2318,"073":2319,"univie":2320,"equivalent":2321,"strings":2322,"keys":2323,"them":2324,"specified":2325,"exist":2326,"element":2327,"vartiations":2328,"distinguished":2329,"suffixes":2330,"indicates":2331,"soft":2332,"core":2333,"radius":2334,"lower":2335,"computation":2336,"reduced":2337,"transferability":2338,"compromised":2339,"extent":2340,"atomic":2341,"units":2342,"volts":2343,"signifies":2344,"hard":2345,"increases":2346,"dealing":2347,"short":2348,"bonds":2349,"additionally":2350,"tend":2351,"transferable":2352,"ones":2353,"semicore":2354,"types":2355,"bit":2356,"harder":2357,"shell":2358,"adds":2359,"six":2360,"those":2361,"now":2362,"ten":2363,"3d":2364,"integer":2365,"denote":2366,"put":2367,"frozen":2368,"beforehand":2369,"125":2370,"contain":2371,"ae":2372,"reproduce":2373,"region":2374,"variant":2375,"extremely":2376,"eaug":2377,"2900":2378,"achieved":2379,"taking":2380,"care":2381,"scattering":2382,"superior":2383,"excited":2384,"indicate":2385,"comparable":2386,"generation":2387,"basics":2388,"check":2389,"weight":2390,"kpoint":2391,"compact":2392,"verbosity":2393,"reporting":2394,"character":2395,"significant":2396,"fundamental":2397,"definition":2398,"semimetals":2399,"cuts":2400,"through":2401,"bands":2402,"defines":2403,"defining":2404,"meaningful":2405,"separates":2406,"conduction":2407,"interest":2408,"vbm":2409,"cbm":2410,"weights":2411,"provides":2412,"comprehensive":2413,"extrema":2414,"individually":2415,"figure":2416,"illustrates":2417,"structures":2418,"affects":2419,"verbose":2420,"semimetal":2421,"shares":2422,"crosses":2423,"visible":2424,"interprets":2425,"metal":2426,"half":2427,"filled":2428,"increasing":2429,"necessarily":2430,"semiconductor":2431,"may":2432,"treated":2433,"smallest":2434,"produces":2435,"collinear":2436,"allow":2437,"impacts":2438,"evaluating":2439,"occupations":2440,"enforce":2441,"certain":2442,"nupdown":2443,"ferwe":2444,"ferdo":2445,"val":2446,"679953":2447,"987917":2448,"cond":2449,"148387":2450,"409707":2451,"531566":2452,"729754":2453,"160470":2454,"2949":2455,"4423":2456,"1474":2457,"0000":2458,"5000":2459,"126216":2460,"283444":2461,"087674":2462,"upper":2463,"386102":2464,"916258":2465,"259885":2466,"632813":2467,"060713":2468,"3846":2469,"0641":2470,"0962":2471,"0321":2472,"always":2473,"ignoring":2474,"describe":2475,"rows":2476,"show":2477,"edges":2478,"analogous":2479,"efermi":2480,"bext":2481,"lnoncollinear":2482,"else":2483,"external":2484,"acts":2485,"zeeman":2486,"manner":2487,"form":2488,"carries":2489,"interaction":2490,"uparrow":2491,"ext":2492,"downarrow":2493,"noncollinear":2494,"beta":2495,"b1":2496,"b2":2497,"b3":2498,"pauli":2499,"saxis":2500,"_1":2501,"hat":2502,"effect":2503,"raised":2504,"lowered":2505,"amount":2506,"effectively":2507,"shifts":2508,"consequently":2509,"redistribute":2510,"changing":2511,"scf":2512,"rigid":2513,"splitting":2514,"restart":2515,"icharg":2516,"_0":2517,"splitted":2518,"_b":2519,"bohr":2520,"magneton":2521,"imply":2522,"relationship":2523,"our":2524,"788":2525,"8060":2526,"56":2527,"mixed":2528,"rho":2529,"mix":2530,"bigl":2531,"bigr":2532,"combinitions":2533,"bparam":2534,"rvv10":2535,"scan":2536,"rvv10l":2537,"cparam":2538,"category":2539,"building":2540,"solving":2541,"iterative":2542,"solution":2543,"calculating":2544,"hole":2545,"constitutes":2546,"art":2547,"absorption":2548,"spectra":2549,"detail":2550,"page":2551,"hermitian":2552,"problem":2553,"begin":2554,"array":2555,"cc":2556,"lambda":2557,"eigenvectors":2558,"excitonic":2559,"effects":2560,"steep":2561,"limiting":2562,"its":2563,"application":2564,"_k":2565,"_v":2566,"brillouin":2567,"zone":2568,"scales":2569,"_q":2570,"_g":2571,"simplify":2572,"solved":2573,"doing":2574,"ibse":2575,"cubically":2576,"evolution":2577,"lanczos":2578,"diagonalizaing":2579,"multiplication":2580,"via":2581,"bseprec":2582,"various":2583,"eigensolvers":2584,"scalapack":2585,"elpa":2586,"cusolver":2587,"libraries":2588,"directly":2589,"analysis":2590,"excitons":2591,"macroscopic":2592,"accounts":2593,"epsilon":2594,"rightarrow":2595,"langle":2596,"qr":2597,"rangle":2598,"cv":2599,"features":2600,"varepsilon":2601,"neq0":2602,"fatband":2603,"plot":2604,"applies":2605,"dirac":2606,"electric":2607,"dipole":2608,"moments":2609,"transform":2610,"xi":2611,"obtaining":2612,"quadratic":2613,"broadening":2614,"cshift":2615,"omegamax":2616,"depend":2617,"ray":2618,"gpu":2619,"continued":2620,"cfrac":2621,"eta":2622,"guess":2623,"coefficients":2624,"stopping":2625,"once":2626,"consecutive":2627,"threshold":2628,"sensitive":2629,"optically":2630,"active":2631,"moment":2632,"ignore":2633,"inactive":2634,"reach":2635,"xas":2636,"excitations":2637,"detailed":2638,"fully":2639,"nvidia":2640,"gpus":2641,"able":2642,"offload":2643,"compile":2644,"cusolvermp":2645,"cublasmp":2646,"nvhpc":2647,"sdk":2648,"hpc":2649,"shipped":2650,"loaded":2651,"module":2652,"hpcx":2653,"cuda12":2654,"enable":2655,"make":2656,"sure":2657,"makefile":2658,"cpp_options":2659,"dcusolvermp":2660,"dcublasmp":2661,"llibs":2662,"cudalib":2663,"lnvhpcwrapcal":2664,"gb":2665,"eigensolver":2666,"scratch":2667,"nbandsv":2668,"nbandso":2669,"included":2670,"otherwise":2671,"transfers":2672,"cpu":2673,"serious":2674,"performance":2675,"degradation":2676,"practical":2677,"casida":2678,"optimizing":2679,"dependent":2680,"bseelectron":2681,"exciton":2682,"nbseeig":2683,"fractional":2684,"fixing":2685,"ensure":2686,"coincides":2687,"shift":2688,"coordinate":2689,"away":2690,"taken":2691,"nearest":2692,"whose":2693,"bsehole":2694,"plotting":2695,"bsefatband":2696,"1bse":2697,"e_bse":2698,"ip":2699,"e_ip":2700,"kx":2701,"ky":2702,"kz":2703,"e_v":2704,"e_c":2705,"abs":2706,"x_bse":2707,"w_k":2708,"nb_v":2709,"nb_c":2710,"im":2711,"2bse":2712,"nbseeigbse":2713,"_bse":2714,"_ip":2715,"eigenvector":2716,"numbers":2717,"medium":2718,"timestep":2719,"inversely":2720,"proportional":2721,"stable":2722,"times1":2723,"lanczosthr":2724,"stops":2725,"differs":2726,"bellow":2727,"root":2728,"square":2729,"rms":2730,"_i":2731,"prevent":2732,"being":2733,"loop":2734,"bse_calculations":2735,"offers":2736,"powerful":2737,"approximations":2738,"take":2739,"account":2740,"essentially":2741,"solves":2742,"xc":2743,"preceding":2744,"provide":2745,"derivatives":2746,"addition":2747,"storing":2748,"produced":2749,"wxxxx":2750,"tmp":2751,"summary":2752,"approaches":2753,"w0001":2754,"w0002":2755,"nkpts":2756,"wfull0001":2757,"wfull0002":2758,"wfull":2759,"wfullxxxx":2760,"_dump":2761,"produce":2762,"flags":2763,"great":2764,"completed":2765,"virtual":2766,"desired_maximum_excitation_energy":2767,"quasiparticle":2768,"restricted":2769,"tries":2770,"excitation":2771,"pairs":2772,"hint":2773,"thoroughly":2774,"quickly":2775,"isotropic":2776,"bulk":2777,"tensor":2778,"surfaces":2779,"write":2780,"vasprun":2781,"xml":2782,"mbse":2783,"work":2784,"intermediate":2785,"lhartree":2786,"ladder":2787,"lfxc":2788,"disabled":2789,"lorbitalreal":2790,"phi":2791,"valued":2792,"wavevectors":2793,"compatible":2794,"kpoint_bse":2795,"index":2796,"integers":2797,"arbitrary":2798,"supplied":2799,"enabled":2800,"infinitesimal":2801,"scalar":2802,"verify":2803,"switched":2804,"complex":2805,"manually":2806,"optics":2807,"correctness":2808,"switching":2809,"keeping":2810,"made":2811,"practically":2812,"perfect":2813,"common":2814,"232563":2815,"000000":2816,"571667":2817,"176976":2818,"5716670828":2819,"removing":2820,"plus":2821,"zeros":2822,"recalculation":2823,"enforces":2824,"numerical":2825,"differentiation":2826,"analytically":2827,"unknown":2828,"lrpa":2829,"decomposed_charge_densities":2830,"stm":2831,"simulations":2832,"writing":2833,"decomposed":2834,"analyze":2835,"ranges":2836,"gaining":2837,"insight":2838,"visualizing":2839,"transport":2840,"especially":2841,"simulating":2842,"scanning":2843,"tunneling":2844,"microscopy":2845,"images":2846,"quick":2847,"lpard":2848,"contributing":2849,"nbmod":2850,"iband":2851,"eint":2852,"kpuse":2853,"symmetrized":2854,"group":2855,"symmetries":2856,"wrong":2857,"due":2858,"turned":2859,"subsequent":2860,"briefly":2861,"explains":2862,"control":2863,"behavior":2864,"decomposition":2865,"toggles":2866,"chgcar":2867,"lpardh5":2868,"vaspout":2869,"h5":2870,"specifying":2871,"contribute":2872,"interpreted":2873,"mode":2874,"empty":2875,"parchg":2876,"parchgh5":2877,"utilize":2878,"lsepb":2879,"merge":2880,"lsepk":2881,"separate":2882,"multiple":2883,"hdf5":2884,"redirects":2885,"py4vasp":2886,"simulated":2887,"pictures":2888,"hold":2889,"4th":2890,"summed":2891,"holds":2892,"channel":2893,"post":2894,"processing":2895,"sums":2896,"workaround":2897,"digits":2898,"picture":2899,"simulation":2900,"bias":2901,"voltage":2902,"distance":2903,"experiment":2904,"translate":2905,"oszicar":2906,"mesh":2907,"get":2908,"making":2909,"isym":2910,"could":2911,"520":2912,"activates":2913,"assures":2914,"allowing":2915,"volt":2916,"clarity":2917,"separating":2918,"rapid":2919,"execute":2920,"python":2921,"script":2922,"environment":2923,"installed":2924,"import":2925,"calc":2926,"from_file":2927,"path":2928,"partial_density":2929,"to_stm":2930,"selection":2931,"constant_height":2932,"tip_height":2933,"image":2934,"constant":2935,"height":2936,"4å":2937,"surface":2938,"plotted":2939,"hood":2940,"pre":2941,"processed":2942,"gaussian":2943,"smoothening":2944,"alternative":2945,"visualization":2946,"program":2947,"view":2948,"slices":2949,"isosurfaces":2950,"experimental":2951,"graphene":2952,"measured":2953,"room":2954,"air":2955,"department":2956,"earth":2957,"environmental":2958,"sciences":2959,"lmu":2960,"nanoscience":2961,"cens":2962,"munich":2963,"calcualte":2964,"website":2965,"structure_calculation_using_hybrid_functionals":2966,"give":2967,"introduction":2968,"advice":2969,"human":2970,"effort":2971,"cannot":2972,"expressed":2973,"alone":2974,"regular":2975,"restarting":2976,"along":2977,"connects":2978,"tools":2979,"help":2980,"identify":2981,"materials":2982,"simultaneously":2983,"supply":2984,"explicit":2985,"weighted":2986,"irreducible":2987,"ibzkpt":2988,"multiplicity":2989,"according":2990,"_opt":2991,"accept":2992,"centered":2993,"monkhorst":2994,"pack":2995,"automatic":2996,"vary":2997,"auxiliary":2998,"hfalpha":2999,"truncation":3000,"singularity":3001,"discontinuities":3002,"notebook":3003,"pv":3004,"from_path":3005,"kpoints_opt":3006,"submitted":3007,"independently":3008,"successive":3009,"principle":3010,"criterion":3011,"entire":3012,"likely":3013,"premature":3014,"counteracted":3015,"nelmin":3016,"expensive":3017,"checking":3018,"achieve":3019,"sampling":3020,"aspects":3021,"_nkbatch":3022,"exceed":3023,"computationally":3024,"feasible":3025,"let":3026,"stress":3027,"define":3028,"never":3029,"were":3030,"forgot":3031,"mitigate":3032,"semi":3033,"dispersionless":3034,"featured":3035,"subtracting":3036,"faulty":3037,"dispersion":3038,"diamond":3039,"generate":3040,"00000000000000":3041,"33333333333334":3042,"00000000":3043,"12500000":3044,"25000000":3045,"37500000":3046,"50000000":3047,"creating":3048,"intersections":3049,"0000000000":3050,"5000000000":3051,"continue":3052,"structure_calculation_using_meta":3053,"gga_functionals":3054,"follow":3055,"band_gap_renormalization_in_diamond_using_one":3056,"shot_method":3057,"renormalization":3058,"task":3059,"zpr":3060,"dependence":3061,"indirect":3062,"primitive":3063,"cell":3064,"prim":3065,"c_2_fcc":3066,"78349300":3067,"75000000":3068,"4x4x4":3069,"super":3070,"c_128_fcc":3071,"13397200":3072,"128":3073,"123":3074,"phon_lmc":3075,"phon_nstruct":3076,"phon_ntlist":3077,"phon_tlist":3078,"phon":3079,"phonon":3080,"_lmc":3081,"enables":3082,"displacements":3083,"monte":3084,"carlo":3085,"harmonic":3086,"oscillator":3087,"_nstruct":3088,"zg":3089,"_ntlist":3090,"temperatures":3091,"_tlist":3092,"dynamical":3093,"special":3094,"levels":3095,"throughout":3096,"consists":3097,"distorted":3098,"containing":3099,"extract":3100,"gaps":3101,"init":3102,"later":3103,"undistorted":3104,"comment":3105,"looks":3106,"degenerate":3107,"averaged":3108,"drastically":3109,"ensures":3110,"extracted":3111,"previously":3112,"saved":3113,"click":3114,"_zpr":3115,"sh":3116,"bin":3117,"bash":3118,"homo1":3119,"awk":3120,"nelect":3121,"print":3122,"homo2":3123,"homo3":3124,"lumo1":3125,"var":3126,"lumo2":3127,"lumo3":3128,"lumo4":3129,"lumo5":3130,"lumo6":3131,"e1a":3132,"grep":3133,"nkpt":3134,"sort":3135,"tail":3136,"e1b":3137,"e1c":3138,"e2a":3139,"e2b":3140,"e2c":3141,"e2d":3142,"e2e":3143,"e2f":3144,"homo_ref":3145,"lumo_ref":3146,"h_ref":3147,"l_ref":3148,"echo":3149,"vibrations":3150,"extract_zpr":3151,"look":3152,"4049":3153,"05102":3154,"353883":3155,"better":3156,"dominantly":3157,"5x5x5":3158,"repeating":3159,"83717":3160,"304933":3161,"interested":3162,"build":3163,"covered":3164,"interactions":3165,"located":3166,"temp":3167,"_dependence":3168,"switch":3169,"100":3170,"500":3171,"600":3172,"_temp":3173,"enter":3174,"executable":3175,"vasp_exec":3176,"processors":3177,"cp":3178,"mpirun":3179,"mv":3180,"edit":3181,"_exec":3182,"going":3183,"run_temperature":3184,"analyzed":3185,"gap_vs_temp":3186,"dat":3187,"fi":3188,"touch":3189,"counter":3190,"extract_temp":3191,"offset":3192,"shifted":3193,"gnuplot":3194,"terminal":3195,"jpeg":3196,"xlabel":3197,"ylabel":3198,"style":3199,"c_exp_points_offset0":3200,"circles":3201,"c_exp_fit_offset0":3202,"jpg":3203,"curve":3204,"blue":3205,"slope":3206,"underestimated":3207,"quasi":3208,"save":3209,"vs":3210,"overwritten":3211,"gap_vs_temp_novol":3212,"go":3213,"_harmonic":3214,"sizes":3215,"scripts":3216,"_harm":3217,"_4x4x4":3218,"_diamond":3219,"_create":3220,"_pos":3221,"_and":3222,"_run":3223,"_vasp":3224,"_make":3225,"_energy":3226,"_volume":3227,"_plots":3228,"_obtain":3229,"_fitting":3230,"fit":3231,"equilibrium":3232,"create":3233,"volumes":3234,"qh":3235,"13521592":3236,"27789536":3237,"4205748":3238,"56325424":3239,"70593368":3240,"84861312":3241,"99129256":3242,"133972":3243,"27665144":3244,"41933088":3245,"56201032":3246,"70468976":3247,"8473692":3248,"99004864":3249,"13272808":3250,"sed":3251,"poscar_":3252,"outcar_":3253,"creates":3254,"varied":3255,"directions":3256,"percent":3257,"quasi_harm_4x4x4_diamond_create_pos_and_run_vasp":3258,"renames":3259,"needed":3260,"next":3261,"bandshift":3262,"gwrun":3263,"dgbd":3264,"con":3265,"gwldadiff":3266,"gt":3267,"esac":3268,"helpscript":3269,"perl":3270,"cat":3271,"eof":3272,"strict":3273,"warnings":3274,"my":3275,"zahler":3276,"entropy":3277,"ezp":3278,"fhelmholtz":3279,"uenergy":3280,"kboltzmann":3281,"6173303":3282,"ntemp":3283,"tmax":3284,"tmin":3285,"tstep":3286,"itemp":3287,"chomp":3288,"homega":3289,"kbt":3290,"0000001":3291,"log":3292,"exp":3293,"printf":3294,"8e":3295,"notemp":3296,"outtemp":3297,"v2":3298,"helpfile":3299,"thz":3300,"hhhhelp":3301,"txt":3302,"runcount":3303,"outtemp_":3304,"outhelp":3305,"quasi_harm_4x4x4_diamond_make_energy_vs_volume_plots":3306,"fitting":3307,"e0":3308,"b0":3309,"v0":3310,"b0p":3311,"720":3312,"1150":3313,"suppress_output":3314,"a_latt":3315,"quasi_harm_4x4x4_diamond_obtain_fitting":3316,"00000000e":3317,"18012":3318,"18014":3319,"18064":3320,"18267":3321,"18613":3322,"19037":3323,"19493":3324,"19959":3325,"15218":3326,"folder":3327,"replace":3328,"rerun":3329,"together":3330,"gap_vs_temp_volume":3331,"would":3332,"consuming":3333,"worse":3334,"discrepancy":3335,"expected":3336,"sufficiently":3337,"really":3338,"excellent":3339,"speaking":3340,"around":3341,"download":3342,"epc":3343,"tgz":3344,"bandgap_renormalization_due_to_electron":3345,"phonon_coupling":3346,"basic":3347,"usage":3348,"nonadiabatic":3349,"allen":3350,"heine":3351,"cardona":3352,"ahc":3353,"activated":3354,"elph_run":3355,"elph_driver":3356,"el":3357,"elph_selfen_gaps":3358,"induced":3359,"displacement":3360,"phelel":3361,"_params":3362,"dense":3363,"_elph":3364,"governs":3365,"elph":3366,"_nbands":3367,"lreal":3368,"lcharg":3369,"elph_nbands":3370,"kpoints_opt_mode":3371,"elph_selfen_delta":3372,"elph_selfen_fan":3373,"elph_selfen_dw":3374,"convenience":3375,"elph_mode":3376,"renorm":3377,"overwrite":3378,"resources":3379,"study":3380,"reveals":3381,"favorable":3382,"final":3383,"concept":3384,"accumulators":3385,"infinity":3386,"deal":3387,"cumbersome":3388,"double":3389,"contained":3390,"monitoring":3391,"silicon":3392,"monitored":3393,"highlighting":3394,"importance":3395,"reaching":3396,"compromise":3397,"apart":3398,"implies":3399,"increasingly":3400,"meshes":3401,"extrapolating":3402,"accomplished":3403,"_selfen":3404,"_delta":3405,"inaccurate":3406,"broadenings":3407,"accumulator":3408,"treatment":3409,"polar":3410,"born":3411,"effective":3412,"challenging":3413,"diverges":3414,"rightarrow0":3415,"divergence":3416,"electrostatic":3417,"interpolate":3418,"interatomic":3419,"constants":3420,"encutlr":3421,"50":3422,"elph_lr":3423,"ifc_lr":3424,"enough":3425,"become":3426,"supercells":3427,"bandstructure_and_crpa_of_srvo3":3428,"bandstructure":3429,"srvo3":3430,"vasp2wannier90":3431,"wannier90":3432,"actual":3433,"postprocessed":3434,"involves":3435,"easiest":3436,"doall":3437,"plotall":3438,"kpar":3439,"aforementioned":3440,"describes":3441,"84652":3442,"6x6x6":3443,"sampled":3444,"uniform":3445,"definitely":3446,"quality":3447,"speed":3448,"live":3449,"went":3450,"diag":3451,"lot":3452,"stage":3453,"idea":3454,"safety":3455,"repeatedly":3456,"backup":3457,"bonus":3458,"visualize":3459,"parts":3460,"plotoptics2":3461,"eigenstates":3462,"ffts":3463,"hilbert":3464,"transforms":3465,"plotchi":3466,"illustrate":3467,"kind":3468,"actually":3469,"calulate":3470,"routines":3471,"hse06":3472,"bloechl":3473,"tetrahedron":3474,"3x3x3":3475,"emin":3476,"emax":3477,"nedos":3478,"lorbit":3479,"apropriate":3480,"doscar":3481,"xxx":3482,"projected":3483,"t2g":3484,"eg":3485,"scriptfile":3486,"plotdos":3487,"wannier":3488,"library":3489,"wan":3490,"lwannier90_run":3491,"win":3492,"bands_plot":3493,"kpoint_path":3494,"num_wann":3495,"bloch":3496,"num_bands":3497,"dis_win_min":3498,"dis_win_max":3499,"projections":3500,"vanadium":3501,"conveniently":3502,"visualized":3503,"persist":3504,"wannier90_band":3505,"gnu":3506,"modern":3507,"respond":3508,"message":3509,"unless":3510,"_band":3511,"deprecated":3512,"syntax":3513,"adapting":3514,"bstr":3515,"auto":3516,"linemode":3517,"tells":3518,"tight":3519,"lm":3520,"plotbands":3521,"main":3522,"bandstructure_of_srvo3_in_gw":3523,"p4v":3524,"vesta":3525,"plotdos_comp":3526,"older":3527,"wannier90_win":3528,"proper":3529,"preferred":3530,"completely":3531,"selfconsistently":3532,"conventionally":3533,"1st":3534,"bad":3535,"irregular":3536,"applicable":3537,"zip":3538,"be_careful_with_the_default_smearing_method_":3539,"pitfalls":3540,"conversely":3541,"undesirable":3542,"breaking":3543,"berry_phases_and_finite_electric_fields":3544,"berry":3545,"phases":3546,"fields":3547,"polarization":3548,"pbc":3549,"nontrivial":3550,"introducing":3551,"dependency":3552,"shape":3553,"ω0":3554,"recently":3555,"king":3556,"smith":3557,"vanderbilt":3558,"resta":3559,"showed":3560,"identified":3561,"geometric":3562,"quantum":3563,"summarize":3564,"essential":3565,"review":3566,"papers":3567,"central":3568,"proposition":3569,"crystalline":3570,"psi":3571,"me":3572,"crystal":3573,"operator":3574,"solutions":3575,"parameterizes":3576,"cast":3577,"longer":3578,"appear":3579,"knowledge":3580,"nabla":3581,"occupation":3582,"physics":3583,"becomes":3584,"transparent":3585,"wn":3586,"centers":3587,"realize":3588,"modulo":3589,"indeterminacy":3590,"stems":3591,"fact":3592,"invariant":3593,"shortest":3594,"nonzero":3595,"removed":3596,"inspection":3597,"uncertainty":3598,"dividing":3599,"λ1":3600,"λ2":3601,"intervals":3602,"useless":3603,"circumvented":3604,"dimensional":3605,"transforming":3606,"span":3607,"dk":3608,"area":3609,"segment":3610,"parallel":3611,"interchanging":3612,"indices":3613,"expressions":3614,"obey":3615,"2πδij":3616,"2d":3617,"termed":3618,"perpendicular":3619,"influence":3620,"introduced":3621,"propose":3622,"alias":3623,"direction":3624,"perp":3625,"prod":3626,"det":3627,"determinant":3628,"appearing":3629,"formed":3630,"letting":3631,"instrumental":3632,"product":3633,"φj":3634,"cyclic":3635,"summation":3636,"assuming":3637,"reasonably":3638,"clustered":3639,"lie":3640,"branch":3641,"logarithm":3642,"pick":3643,"spurious":3644,"homogeneous":3645,"closely":3646,"nunes":3647,"gonze":3648,"souza":3649,